{"Annual Report 2021":{"Headingtag":"ar","Sectiontext":{"data":{"about this report":"The audited annual accounts and consolidated accounts\ncan be found on pages 14-20 and 34-74. The corporate\ngovernance report examined by the auditors can be found\non pages 21–27.\nThe sustainability report has been reviewed\nby the auditors for compliance with the Annual\nAccounts Act and can be found on:\nhexagon.com\nHexagon AB is a Swedish public limited liability company with corporate\nregistration number 556190-4771. All values are expressed in Euros unless\notherwise stated. The Euro is abbreviated EUR, thousands of Euro to KEUR,\nmillions of Euro to MEUR, billions of Euro to bn EUR and million US dollars\nto MUSD. Figures in parentheses refer to 2020 unless otherwise stated.\nData on markets and peers represent Hexagon's own assessments unless\notherwise stated. Assessments are based on most recent available facts\nfrom published sources. While every care has been taken in the translation\nof this annual report, readers are reminded that the original annual report,\nsigned by the Board of Directors, is in Swedish.\nThis report contains forward-looking statements based on Hexagon\nmanagement's current expectations. Although management\nconsiders expectations expressed in such future-oriented\ninformation as reasonable, no assurance can be given that these\nexpectations will prove correct. Consequently, actual future results\ncan differ considerably from those implied in the forward-looking\nstatements as a result of factors such as changed conditions in the\neconomy, market and competition, changes in legal requirements and\nother political measures, fluctuations in exchange rates and other\nfactors."},"hexagon in brief":{"data":"Hexagon has long been a leader in delivering smart digital realities that\nrequire real-time and autonomous data capture, analysis and visualisation.\nWe integrate real-world sensor inputs with software solutions built to\nanalyse, predict and act to create new and more complete realities\nthat address uncertainty and enable resilient organisations, teams\nand workflows.\nOur digital reality solutions enable customers to harness the rapidly\nincreasing amounts of data, putting it to work to boost efficiency,\nproductivity, quality and safety across industrial, manufacturing,\ninfrastructure, public sector and mobility applications. At our very core is\na powerful vision of a future where data is fully leveraged so that business,\nindustry and humanity sustainably thrive. This is our North Star, our guiding\nprinciple that people and the planet can sustainably thrive only when\nindustry and business prosper.\nOur goal is to empower our customers with the freedom to use data to its\ngreatest potential-the freedom to innovate, the freedom to thrive, the\nfreedom to ensure a sustainable planet for future generations.\nNorth Star:\nRespect for people,\nplanet and profitability","vision":"A future where data is fully and autonomously\nleveraged so that business, industry and humanity\nsustainably thrive","mission":"Putting data to work to enable autonomous,\nconnected ecosystems that boost efficiency,\nproductivity, quality and safety for our customers","stability":"- 500 MEUR (2000) to 4.3 bn EUR (2021)\n- More than 22,000 employees across\n50 countries - Increasing role in customers'\nbusinesses","relevancy":"- Serving manufacturing, infrastructure,\nconstruction, city services and more\n- Solutions that drive fewer inputs, less\nwaste and less pollution from efficiency,\nproductivity, quality and safety gains","innovation":"- 10-13% of revenues for R&D\n- 5,000 R&D employees\n- Thousands of active patents\n- Complementary emerging tech through\nacquisitions (170+ in 21 yrs)","sustainability":"- Committed to driving profitable business\nvalue that ensures economic growth, but\nnot at the expense of the planet or people","core values":{"profit driven":"We value sustainable profitability,\nperformance over procedure, setting\nmeasurable goals and working collectively\nto achieve our financial targets.","engaged":"We seek personal fulfilment by doing\ngreat work while enjoying what we do.\nWe lead with a sense of urgency, without\nprejudice or politics.","innovative":"We invest heavily in innovation to meet\nour customers' ever-changing needs, with\nlaser-like focus on creating sustainable\nbusinesses that benefit humanity.","entrepreneurial":"We're confident we have what it takes\nto achieve our ambitious vision. We take\nownership in dreaming big, trying new\nthings and pushing for progress.","professional":"We are honest professionals who\nunderstand the importance of knowing\nour business, leading by example and\ndemonstrating humility along the way.","customer focused":"We know our customers' success is\nparamount to our own, and we are\ndedicated to driving efficiency, productivity\nand quality for everyone we serve."}},"business overview":{"geospatial enterprise solutions":"Geospatial Enterprise Solutions (GES) includes a world-\nleading portfolio of reality-capture sensors - from\nlaser scanners, airborne cameras and unmanned aerial\nvehicles (UAV) to monitoring equipment, mobile mapping\ntechnologies and precise positioning. The sensors are\ncomplemented by software to create 3D maps and\nmodels, which are used for decision-making in a range of\nsoftware applications, covering areas such as surveying,\nconstruction, public safety, mining and agriculture.\nThe segment comprises the\nfollowing divisions:\n- Geosystems - Safety, Infrastructure &\nGeospatial - Autonomy & Positioning\nAverage number of employees\nGeography, % Americas, 41 EMEA, 40 Asia, 19 Customer segment, %\nSurveying, 39 Infrastructure & construction, 26 Natural resources, 14\nAerospace & defence, 8\nPublic safety, 7\nOther, 6 Sales mix\nSoftware & services\nDirect sales\nRecurring revenue\nSolution Examples\nLaser scanners\nSurveying Public safety\nMobile mapping technologies\nMining Precise positioning","industrial enterprise solutions":"Industrial Enterprise Solutions (IES) includes a world-leading\nbroad software portfolio, encompassing CAD (computer-\nportfolio of metrology solutions incorporating the latest\nsensor and software technologies for fast and accurate\nmeasurements. These solutions include technologies such\nas coordinate measurement machines (CMM) and laser\ntrackers and scanners for optimising design, processes and\nthroughput in manufacturing facilities. IES also includes a\naided design), CAM (computer-aided manufacturing) and\nCAE (computer-aided engineering) platforms. Solutions\nwithin this segment also include software for optimising\ndesign, improving productivity and creating and leveraging\nasset management information through the lifecycle of\nindustrial plants and processing facilities.\nThe segment comprises the\nfollowing divisions:\n- Manufacturing Intelligence\n- PPM Average number of employees\nCustomer segment, %\nElectronics & manufacturing, 34 Power & energy, 24\nAutomotive, 18 Aerospace & defence, 10\nOther, 14 Geography, % Asia, 39 Americas, 32 EMEA, 29 Sales mix\nSoftware & services\nDirect sales\nRecurring revenue\nSolution Examples\nOptical scanners\nCAD for industrial facilities\nCAD/CAM/CAE software\nCMMs Industrial metrology software\nOperations management"},"letter from the president and ceo":{"freedom to do our best work":{"data":"2021 will be remembered as the year the world began\nto regain positive momentum, freeing itself from an\nextraordinary period that had held people, industries and\neconomies in check. To move beyond the obstacles that\nhold us back provides a sense of relief and freedom, and\nit's something I want to address in this year's annual letter:\nhow freedom, data and Hexagon are inextricably linked.\nAs challenging as the last two years have been, there\nexists a completely different yet equally extraordinary\nphenomenon that continues to test our agility and speed.\nPundits heralded the IoT, the so-called Internet of Things,\nas the next new \"thing\" that would deliver trillions in value.\nThe connectivity of billions of devices and absurd amounts\nof data was intended to set us free, enabling us to achieve\nour greatest potential.\nInstead, the data deluge has us scrambling. We find ourselves\nin an overwhelmingly complex situation, determinedly\nendeavouring to use data to make businesses run better and\noperate more sustainably. Ironically, as our hunger for data\ngrows, so does our inability to harness it-impinging on our\nfreedom and slowing progress across industry.\nIt is for this very reason we chose to make a bold strategic shift\ntoward empowering an autonomous future a few years ago.\nThis strategy targets the rapidly widening gap between data\ncreation and usage, bringing the freedom of to sensor-software\nsolutions so that data is no longer an obstacle.\nWe've been connecting sensors to software for years-this\nwas nothing new. But what was, and still is, revolutionary is\ncreating value by empowering customers to leverage this\ndata in new, world-changing ways-providing the freedom\nto do their best work.\nThis is how Hexagon will drive sustainability, growth and\nshareholder value for years to come. The freedom that\nbrings to data is opening new ways to understand the world\nand make decisions-creating value for our customers\nwhere they need it most: (1) resilience, (2) innovation and\n(3) sustainability.","resilience needs freedom from uncertainty":"Uncertainty is something we're hardwired to dislike. Yet, it\nseems to be the only certain reality we face. With the right\ntools and supports in place, we can emerge stronger when\nthe unexpected hits.\nHexagon has long been a leader in delivering smart digital\nrealities that require real-time and autonomous data\ncapture, analyses and visualisation. Our solutions integrate\nreal-world sensor inputs with software systems built to\nanalyse, predict and act-in real-time and autonomously-\nto create new and better realities that address uncertainty\nand enable resilient organisations, teams and workflows.\nWe made six acquisitions in 2021 to further strengthen\nthese capabilities in the areas of manufacturing, industrial\nmaterials tracking, augmented reality applications and\nEAM (enterprise asset management).","innovation needs freedom to accelerate":"The ability to fully leverage data changes our thought\nprocesses and approach to innovation. It becomes an\nindispensable resource for fostering new value creation\nand knowledge.\nFor example, in June we launched the future of citywide\ncollaboration and connected data communities with HxGN\nConnect, an SaaS collaboration workspace purposely built\nto bridge communication gaps, break down data siloes, and\nimprove safety and scalability.\nHxGN Connect provides greater freedom for government\nagencies and other diverse organisations to coordinate\naction for ad hoc, routine and emergency situations. Users\ncan work with people and information irrespective of\norganisational and geographical affiliations or technology\nlimitations-bridging gaps between vertical sectors,\norganisation types and operational functions to drive\nsafer communities, more effective services and happier\nresidents. In October, we extended our iconic, award-winning BLK\nsensor series with fully autonomous mobile reality capture,\ngiving our customers greater freedom to capture the world\nwith precision and simplicity. We introduced the Leica BLK\nARC, an autonomous laser scanning module for robots, and\nthe Leica BLK2FLY, an autonomous flying laser scanner\nwith advanced obstacle avoidance.\nBoth purposefully integrated sensor-software systems\nbring autonomous agility and speed to any reality-capture\nworkflow. They dynamically adjust reality-capture missions\nfor seemingly limitless business applications-from\nas-built site documentation for buildings to monitoring\nand situational awareness of remote or hazardous\nenvironments, such as mines, factory floors, off-shore\nfacilities, fire investigations and more.\nLate in 2021, we launched HxGN MineMeasure to put data\nto work in the delivery of high-value ore. MineMeasure\ncombines blast design software, high-precision drilling,\nblast movement monitoring, fragmentation analysis and\nenterprise analytics to empower customers with a data-\ndriven feedback loop calibrated to increase profit from\nevery blast while minimising ore loss.\nImproving ore recovery by just 1 per cent can mean\nmillions of dollars for a mine. Not only does MineMeasure\naddress the small, compounding errors that lead to costly\nconsequences throughout the notoriously complex\ndrill and blast cycle, but it also addresses sustainability\nof precious resources-diminishing unintentional loss\n(sending ore to a waste dump) and dilution (sending waste\nto the mill).\nThese are just a few of the hundreds of innovations we\nlaunched in 2021.","sustainability needs freedom to grow and profit":"It wasn't long ago that growth, profitability and\nsustainability were seen as mutually exclusive objectives.\nToday, leaders must achieve all three, and it's our\nambition to unleash industry transformations that create\nunparalleled opportunities to help them succeed.\nWith solutions that leverage data to free industry to do\nwhat's right, we create the freedom to grow in a way that\nis both sustainable and profitable. For more than two\ndecades, we've contributed to environmental and social\nsustainability by improving efficiency, productivity, quality\nand safety-the antidotes to waste, pollution, diminishing\nmargins and increased risk. Through our solutions we\nenable factories, cities, industrial facilities, construction\nprojects and almost any other endeavour to become safer,\nmore productive, more efficient and more profitable.\nBut green-tech projects can benefit from many of the\nsame digital reality solutions, which is why we launched\nR-evolution in early 2021. Founded to accelerate the\ntransition to a sustainable economy, R-evolution runs\nprofit-driven investments in green-tech projects where\nHexagon's technology can be applied. Saving the planet is\nthe biggest business opportunity of the 21st century, and\nR-evolution is Hexagon's opportunity to motivate action\nthrough profitable change that gives back to the planet.\nOut of the gate, R-evolution leveraged multiple Hexagon\ntechnologies to construct and operate cutting-edge solar\nfarms. Later in the year, R-evolution began mapping the\nthreatened seagrass meadows of the Caribbean with our\nairborne bathymetric LiDAR technologies-detecting,\nmapping and capturing critical details about this vital blue\ncarbon ecosystem.\nWithout a doubt, companies that can help the world\nachieve its environmental goals must step up to lead. We're\nproud to be a sustainability enabler with plans to expand\nfocus to sustainable agriculture, cleaning up our oceans,\nprotecting our forests and more.\nWe're also deeply committed to driving sustainable\noutcomes through our actions, supported by the launch\nof a new sustainability programme in 2021. It outlines our\nkey environmental, social and governance (ESG) goals\ncentred on carbon emissions, supplier audits and diversity.\nIt articulates our ESG targets for 2023 and beyond that\ninclude significant reductions in our carbon footprint,\nbetter management of supply chain risks and improved\ngender balance across our leadership team.\nWe also joined the Responsible Business Alliance (RBA),\nthe world's largest industry coalition dedicated to\ncorporate social responsibility in global supply chains.\nOur membership is an important step towards reaching\nour ESG goals, enabling Hexagon to engage with some of\nthe world's leading companies to improve working and\nenvironmental conditions across the globe.","doing well to do good":"Tackling climate change is humanity's defining challenge\nin the twenty-first century. The systems that have fuelled\nour growth and wellbeing must be transformed. Bottom\nline, industry needs to do well to do good. This is our\nNorth Star, our guiding principle: that people and the\nplanet can sustainably thrive only when industry and\nbusiness prosper.\nDoing better requires constant, incremental change that\nleverages current technologies, improving and innovating\nto optimise efficiency, productivity, quality and safety. But\nbetter isn't enough.\nIt is our commitment to go beyond better, creating\nexponential change with disruptive and unconventional\nmethods that make giant leaps forward. We have the\nresources and ingenuity to drive continued business value\nthat ensures economic growth, and not at the expense of\nthe planet or people.\nI want to thank our shareholders for your continuing\nsupport, confidence and trust. It is without a doubt that\nour passion for an autonomous, sustainable future will\ncontinue to generate the profitable returns you have come\nto expect. We can and will continue freeing industry to put\ndata to work to grow sustainably, achieve sustainable gains\nin performance and build business models that will thrive\ninto the future.\nOur greatest work to accelerate groundbreaking\ninnovations that simultaneously scale profitability and\nsustainability lies ahead.\nOla Rollén\nPresident and Chief Executive Officer\n@OlaRollen"}},"strategy":{"hexagon is committed to empowering an autonomous future":{"data":"Hexagon's strategy is focused on the rapidly widening gap between the enormous amounts of\ndata being created, and the world's ability to harness it. Putting data to work to empower an\nautonomous, sustainable future is in our DNA, enabled by five core competencies: (1) Reality\ncapture (2) Positioning (3) Location Intelligence (4) Design and simulation and (5) . These core\ncompetencies combine in perhaps the most dynamic and powerful use of data in history: The\nSmart Digital Reality™. This is what Hexagon aims to deliver with every solution it provides. It is\nHexagon's strategic advantage and the greatest source of value for its customers.","reality-capture solutions":"Hexagon's reality-capture technologies\nenable the digital representation of the\nphysical world - from distance measurements\n(point A to point B) to the capture of physical\nworld objects (e.g., auto parts) to the creation\nof entire real-world environments in 3D (e.g.\nthe complete infrastructure of a city).","positioning technologies":"Hexagon's positioning technologies enable the secure location, tracking, navigation and/\nor control of anything, anywhere. They power intelligent positioning ecosystems in vital\nindustries and safety-of-life applications.","location intelligence capabilities":"Hexagon's location intelligence capabilities\nenable active, georeferenced and\nsituational intelligence for any application,\nproviding businesses and governments with\nunlimited potential to incorporate high-\ndefinition, real-time, dynamic maps into\ntheir decision support systems.","design and simulation capabilities":"Hexagon's design and simulation\ncapabilities replicate real-world\nscenarios in virtual environments - from\nmanufacturing and assembly processes to\nautonomous driving.","autonomous capabilities":"Hexagon's autonomous technologies provide the ability to \"autonomise\" almost any task\nor process in a workflow to an entire operation or industry (e.g., mobility/transportation),\nin which cars, UAVs, industrial vehicles, trains, vessels and more can operate safely,\nsecurely, reliably and efficiently thanks to assured and positioning."},"value-generating customer solutions":{"data":"Hexagon's vision, a future where data is fully and autonomously leveraged so that\nbusinesses, industry and humanity sustainably thrive, drives the company's strategic\ndecision-making process. Customers are increasingly demanding autonomous sensor-\nsoftware systems with tighter integration between reality-capture devices and the\naccompanying software built to visualise, analyse, predict and act - all in real-time and\nautonomously. it is for this reason the smart digital reality is becoming increasingly vital\nfor the future of business.\nAutomated processes are ideal for a predictable world. But\nthe world is rarely predictable. Transformation is coming to\nevery existing industry sector, which will require a shift from\nautomation to . In today's automated and hyperconnected\nworld there's so much data being created that most of it sits\nunused, unconnected and underleveraged. enables industry\nto put all of it to work, giving customers the advantage to\nshape unpredictability to their benefit - where they can be\nproactive, predictive and even preventative.\nMachines with limited automated functions today will\nbecome capable of dealing with dynamic, real-world\nsituations - intelligently and autonomously. will be\nintroduced to tasks, work processes, entire operations and\nindustries. Solutions that support increasingly connected\nand autonomous ecosystems will dwarf and leverage the\nimpact of recent disruptions like the Internet of Things and\nBig Data.","1. smart digital realities":"A Smart Digital Reality™ provides a platform to extract\ndata's full potential, enabling organisations, industries\nand the planet to sustainably thrive. It reimagines the\nconcept of feedback loops, treating the physical and digital\nworlds as one, where all data is available, live, in context\nand in one place-providing complete line-of-sight to ever-\nchanging situations. It is workflow-driven, bringing speed\nand agility to any process by serving up the right data in\nthe right place at the right time-to humans or machines.\nIt is real-time and autonomous, ensuring the most up-to-\ndate information with artificial intelligence and machine\nlearning capabilities to reduce, or even eliminate, human\nintervention in decision-making.\nIn summary, smart digital realities integrate real-world\nsensor inputs with software systems built to visualise,\nanalyse, predict and act-in real-time and autonomously-\nto create new and better realities that address uncertainty\nand enable resilient organisations, teams and workflows.","2. technology leadership":"Hexagon has a strong focus on R&D, with annual\ninvestments of about 10-13 per cent of net sales. Hexagon\nhas around 5,000 employees working in R&D, with\napproximately 4,000 active patents. Every development\nproject is based on an identified business case with clearly\ndefined technical, commercial and financial targets.\nOne of the key innovation strategies across Hexagon is\nXalt, a proprietary technology platform used exclusively\nacross Hexagon's solutions to accelerate the ability to\nharness and extract data's full potential. Xalt integrates\nthe unlimited data inputs coming from all Hexagon's\nsensors, erasing interoperability barriers, turning data\ninto visualisation for faster insights and unleashing AI\ncapabilities to put data to work autonomously.\nHexagon's R&D investments in 2021 amounted to 566.5\nMEUR (507.3), corresponding to 13 per cent (13) of net sales.\nUnder IFRS accounting standards, development expenses\nare capitalised if they pertain to new products, the cost\nis significant and the product is believed to have major\nearnings potential.","3. value-generating acquisitions":"Acquisitions play a vital role in strengthening Hexagon's\nsolutions portfolio and accelerating the growth strategy.\nOver the past 21 years, Hexagon has completed more\nthan 170 acquisitions to fill portfolio gaps, augment R&D\nroadmaps, add domain expertise and deliver on strategic\npriorities. Acquisition candidates are regularly monitored and\nevaluated in terms of market position, customer\nreputation as well as growth and profitability potential.\nIn the future, Hexagon expects acquired companies to\nadd approximately 3-5 per cent to annual growth with an\nincremental operating margin above group average levels.","4. creating opportunities for sustainable growth":"Cutting-edge technology has always set Hexagon apart\nfrom its peers, creating relevancy and opportunities for\nsustainable growth. The development of industry-specific\nsoftware solutions to augment its leadership in reality\ncapture and positioning devices requires sophisticated\nvisualisation capabilities that speed understanding and aid\ndecision-making. As autonomous processes become more\nsophisticated and robots play a bigger role in industry and\neveryday life, visualisation and perception tools will become\neven more crucial, aiding the creation and adaptation of\nrobot behaviours. Hexagon is poised to meet these needs\nthrough HxDR, a powerful cloud storage, collaboration\nand visualisation platform that can seamlessly ingest\nand visualise any type of reality-capture data. HxDR\naddresses the growing need for simple-to-create yet highly\nsophisticated and accurate visualisations of reality-capture\ndata for limitless applications, keeping Hexagon future-\nproofed and relevant for many years to come.","5. sustainability":"The Hexagon story is about customers doing well, and\nhow doing well will lead to doing good things for the\nplanet. Efficiency, productivity, quality and safety, are the\nantidotes to a planet under siege—helping to minimise\nwaste, pollution, cost and risk. Hexagon’s solutions\nempower customers to turn data into a sustainable,\ncompetitive advantage, and to make factories more\nproductive, cities safer, industrial facilities more efficient\nand construction projects more profitable. To further\ndrive its sustainability mission, Hexagon launched a\nsustainability programme and R-evolution in early 2021.\nR-evolution is a business venture focused on accelerating\nthe world’s transition to a sustainable economy by running\nprofit-driven investments in green-tech projects where\nHexagon’s technology can be applied. Today and beyond,\nHexagon is committed to ensuring continued sustainability\ncontributions at an increasingly faster pace. Hexagon will\ndrive sustainability, growth and shareholder value well into\nthe future by providing businesses and industry with the\nfreedom to do good by doing well."}},"financial plan":{"financial plan for continued profitable growth":{"data":"Hexagon launched a new financial plan and growth strategy during its Capital Markets Day 2021.\nAverage total\ngrowth per year\nThe financial targets are to reach annual average sales\ngrowth of 8-12 per cent between 2022-2026 and an\nadjusted operating margin (EBIT1) of over 30 per cent by\n2026. The margin target includes amortisation of surplus\nvalues (PPA). The targeted sales growth is driven by a\ncombination of 5-7 per cent organic growth per year and\n3-5 per cent structural growth per year from acquisitions.\nThe targets will be reached through a continued focus on\ninnovation and customer-centric solutions to further sales\ngrowth, margins and recurring revenues.","continued growth":"Hexagon's growth strategy is focused on using technology\nand innovative leadership to grow organically and through\nacquisitions, with a focus on customer-centric solutions.\nTotal average annual growth is estimated at 8-12, with\nvariation expected between the years. Organic growth,\nwhich is estimated at 5-7 per cent annually, relates in part to\nGDP-driven growth from existing solutions, but is primarily\nexpected to come from increasing revenues from new\nsolutions. An increase in recurring revenue is expected\nthrough more focus on customer-centric solutions and an\nincrease in revenue coming from software. Acquisition-related\ngrowth is estimated at approximately 3-5 per cent annually.","proven ability to deliver margin improvements":"Hexagon has proven its ability to steadily deliver enhanced\nmargins. Since 2011, the operating margin (EBIT1) has\nincreased by 7 percentage points. The ambitious operating\nmargin of more than 30 per cent by 2026 will continue to\nbe strengthened by changes to the sales mix - where\nsoftware and new product generations account for a\ngreater share of sales. The target is that organic growth\nwill contribute with an incremental margin of 35-40 per\ncent. At the same time, the cost structure will continue\nto change. Investments in R&D will continue in order to\nmeet the demand of a more solution-centric business.\n✓ ✓ EBIT margin\nRevenue bn EUR\nAverage growth\nfrom M&A per year\ngrowth per year\nAverage organic\nAdjusted operating margin\nThis will trigger investments in sales resources while\nreducing administrative costs, which are non-accretive\nto profitability.\nThe target to improve profitability will be achieved through a\nhigher proportion of sales from new high-margin applications\nand software, with a high recurring revenue percentage.\nThere is also a strong focus on further generating and\nutilising synergies. The shift toward a higher proportion of\nsoftware- and solution-selling has improved the operating\nmargin but also resulted in changes to the cost structure.\nHexagon now has lower costs for goods sold, but higher R&D\nand amortisation costs.\nDevelopment during financial plan 2017-2021\nThe previous financial plan was to reach an annual average\ngrowth rate of 8-10 per cent per year, of which organic growth\nwas estimated to be 5 per cent, 3-5 per cent was to come\nfrom M&A and the FX effect was assumed to be neutral. This\nwould correspond to revenues of between 4.6-5.1 bn EUR\nand an operating margin of 27-28 percent. During this period,\nHexagon was negatively impacted by FX by -1 per cent and\naveraged 7 per cent total growth, 4 per cent organic growth\nand 4 per cent structural growth. In 2021 Hexagon achieved\nsales of 4.3 bn EUR and an operating margin (including\namortisation of surplus values) of 28 per cent. In October\nHexagon made a transformative acquisition with the carve-\nout of Infor's EAM-business. Including full year pro-forma\nEAM revenues, Hexagon would have reached the sales goal of\n4.6 bn EUR."}},"other targets":{"data":"Hexagon targets the efficient use of capital in order to generate a strong cash flow,\nreach a sound equity ratio and achieve a balanced debt structure while generating\nvalue for shareholders.","strong cash flow generation":"A strong cash flow is\nnecessary to finance\ninvestments, settle interest\non debts and pay dividends\nto shareholders. Hexagon's\ncash conversion, i.e., the ratio\nat which profits are converted\ninto cash, has averaged 86 per\ncent since 2013 and was 91 per\nHexagon's target is to reach a\ncash conversion of 80-90 per\ncent. Cash flow from operating\nactivities, excluding non-\nrecurring items, amounted to\nCash flow, MEUR","efficient use of operating capital":"Hexagon seeks to minimise\nworking capital and in recent\nyears, the ratio of working\ncapital to sales has averaged\nless than 15 per cent. The ratio of\nworking capital to sales in 2021\namounted to 6 per cent (5).\nThe downward trend of working\ncapital as a percentage of sales\nresults from a business model\nshift towards more software-\ncentric solutions. Hexagon's\noverall long-term objective is\nto increase earnings per share\nby at least 15 per cent annually\nand to achieve a return on\ncapital employed exceeding\n15 per cent over a business\ncycle, including goodwill from\nacquisitions. Return on average\ncapital employed, excluding\nnon-recurring items, was 13.5\nWorking capital to sales,\nReturn on capital\nemployed, %","environmental targets":"Hexagon has a goal to become carbon neutral in its scope\n1 and 2 emissions by 2030, and to become carbon neutral\nin its whole value chain (scope 1, 2 and 3) by 2050. Hexagon\nhas a target to conduct sustainability supplier audits on\n100 per cent of its direct suppliers in risk areas by 2023.\nHexagon targets to achieve at least 30 per cent women in\nleading positions by 2025.","sound equity ratio and balanced debt structure":"A sound equity ratio and\nbalanced leverage are\nrequirements for financing\nacquisitions by loans. Hexagon\ntargets an equity ratio of at\nleast 25 per cent and has the\nambition to have a net debt to\nEBITDA ratio of 2.5x or below.\nThe equity ratio amounted to 62\nper cent (56) and the net debt\nto EBITDA ratio amounted to\ncapital markets account for\n78 per cent (90) of Hexagon's\nfinancing, while bank loans\nmake up the remainder.\nHexagon's net financial\nexpense amounted to -26.2\naverage interest rate on the\nGroup's short- and long-term\nloans was 0.6 per cent (1.0) at\nyear-end 2021. Equity ratio, %","dividend policy":"Hexagon's dividend policy is\nto distribute 25-35 per cent of\nnet earnings after tax.\nA dividend of 0.65 EUR per\nshare for the fiscal year 2020\nwas distributed during 2021\n(pre share split).\nThe Board of Directors\nproposes a dividend of\n0.11 EUR per share (0.09)\nfor the fiscal year 2021,\ncorresponding to 36 per cent\nof net earnings after tax.\nCash dividend per share,\nEUR 1) According to the Board of\nDirectors' proposal"},"board of directors' report":{"data":"The Board of Directors and the President of Hexagon AB hereby submit their annual\nreport for the year of operation 1 January 2021 to 31 December 2021. Hexagon AB is a\npublic limited liability company with its registered office in Stockholm, Sweden and its\ncorporate registration number is 556190-4771.","operating structure":"Hexagon's business activities are conducted through\nmore than 300 operating companies in about 50 countries\nworldwide. The President and CEO is responsible for daily\nmanagement and decision-making together with the\nother members of Hexagon Group Management, including\nthe chief financial officer, the chief strategy officer, the\ngeneral counsel, the chief marketing officer, the chief\noperating officer, the chief technology officer, the head\nof sustainability & investor relations and the divisional\npresidents. Hexagon's Group functions consist of Finance (group\naccounting, treasury and tax), Operations, Business and\nTechnology development (Innovation Hub), Legal, Strategy,\nMarketing, Sustainability and Investor Relations.\nRisks are managed by each relevant function. For more\ninformation about managing risks see page 34.","hexagon's reporting structure":{"data":"Hexagon Group functions serving both:\nHexagon's reporting structure is divided into Geospatial Enterprise Solutions and Industrial Enterprise Solutions as follows, with\nGeospatial Enterprise Solutions\nThe business area comprises\nthe following divisions:\n- Geosystems - Safety, Infrastructure &\nGeospatial - Autonomy & Positioning\nIndustrial Enterprise Solutions\nThe business area comprises\nthe following divisions:\n- Manufacturing Intelligence\n- PPM Group functions\n- Finance - Operations - Innovation Hub - Sustainability - Legal - Marketing - Strategy - Investor Relations Important events 2021\nHexagon acquired\nMecadat , a distributor of CAD and CAM\nsoftware Hexagon announced\nnew sustainability targets\nto further\nits ESG agenda\nHexagon launched\nR-evolution , a new business venture\nfocused on a sustainable future\nQ2 Hexagon acquired","cadlm,":"a provider of CAD software\nHexagon introduced\nHxGN Connect\n, an SaaS workspace\nenabling seamless, citywide collaboration, planning and\nresponse Hexagon resolved on a","share split":"Hexagon acquired\nZGTech , a provider of metrology-grade\n3D scanners\nHexagon acquired\nImmersal Oy\n, a provider of spatial\nmapping and visual positioning solutions\nHexagon introduces the autonomous reality-capture\nsolutions Leica BLK ARC\nand","leica blk2fly":"Hexagon held a virtual\nCapital Markets Day\nwhere a new\nfinancial plan was introduced\nQ4 Hexagon acquired\nInfor's EAM business\n, a provider of EAM\nsoftware Hexagon acquired\nJovix , a provider of material-tracking\nsoftware Hexagon held an\nExtraordinary General Meeting\nwhere it\nwas resolved to amend the Articles of Associations and raise\nthe number of allowed directors of the Board from eight to ten\n2021 in brief\n- Operating net sales increased by 15 per cent to 4,347.4 MEUR\n(3,770.5). Using fixed exchange rates and a comparable group\nstructure (organic growth), net sales increased by 12 per cent\n- Adjusted operating earnings (EBIT1) increased by 26 per cent to\n- Earnings before tax, excluding adjustments, amounted to 1,243.4\n- Net earnings, excluding adjustments, amounted to 1,018.0 MEUR\n- Earnings per share, excluding adjustments, increased by 28 per\ncent to 38.8 Euro cent (31.0)\n- Operating cash flow decreased by 2 per cent to 904.2 MEUR (920.7)\nRevenue adjustment3\nAdjusted operating earnings\nEarnings before taxes excl.\nAdjustments (before taxes)4\nEarnings before taxes 983.6\nShare price, SEK 5\n1) All figures are in MEUR unless otherwise stated\n2) Adjusted to fixed exchange rates and a comparable group structure, i.e.\norganic growth\n3) Reduction of acquired deferred revenue (haircut) related to acquisitions\n4) See more information on page 57\n5) The share price for 2021 reflects the share split 7:1, historic data has not\nbeen restated"},"adjusted operating margin organic growth":"Operating net sales, MEUR\nAdjusted operating margin, %\n1) Operating net sales\nEarnings per share, EUR\nSales bridge1\nStructure, Organic growth,\nCurrency, 1) Operating net sales from completed acquisitions and divestments\nduring the year are recognised as \"Structure\". Percentages are\nrounded to the nearest whole per cent","five-year overview":"1) Reduction of acquired deferred revenue (haircut) related to acquisitions\n2) IFRS 16 Leases\nwas applied from 2019 without restating comparable numbers","net sales":"Operating net sales amounted to 4,347.4 MEUR (3,770.5).\nUsing fixed exchange rates and a comparable group\nstructure (organic growth), sales increased by 12 per cent.","market demand":"Regionally, organic growth was 14 per cent in Asia, 14 per cent\nin EMEA and 9 per cent in Americas. Operating net sales in Asia\namounted to 1,237.8 MEUR (1,073.1), representing 28 per cent\n(28) of Group sales. China recorded strong growth throughout\nthe year, driven by continued strength across most verticals.\nThe rest of Asia reported moderate growth, hampered by\nweakness in power and energy and aerospace and defence.\nOperating net sales in EMEA amounted to 1,602.3 MEUR\n(1,374.9), representing 37 per cent (37) of Group sales.\nWestern Europe recovered strongly after a year that was\nsignificantly hampered by the Covid-19 pandemic related\nshutdowns. The region benefited from solid demand in all\nkey verticals, including infrastructure and construction,\nsurveying and automotive.\nOperating net sales in the Americas amounted to 1,507.4\nMEUR (1,322.6), representing 35 per cent (35) of Group\nsales. North America also recovered strongly, driven\nby good demand in the surveying, automotive and\ninfrastructure and construction markets, but hampered\nby weakness in defence. South America recorded strong\ngrowth throughout the year, driven by a solid development\nin mining and agriculture.","geospatial enterprise solutions":"Geospatial Enterprise Solutions (GES) operating net sales\namounted to 2,201.4 MEUR (1,934.0). Using fixed exchange\nrates and a comparable group structure (organic growth), net\nsales increased by 13 per cent. Regionally, organic growth\nwas 17 per cent in EMEA, 14 per cent in Asia and 9 per cent\nin the Americas. Geosystems recorded 19 per cent organic\ngrowth, driven by a strong recovery across all key industries\nafter a year hampered by the Covid-19 pandemic. Safety,\nInfrastructure & Geospatial recorded -3 per cent organic\ngrowth, hampered by weakness in defence, but continued\nto see good growth in public safety. Autonomy & Positioning\nrecorded 8 per cent organic growth, positively impacted\nby strong demand in precision agriculture markets, but\nadversely impacted by weaker demand in defence.","industrial enterprise solutions":"Industrial Enterprise Solutions (IES) operating net sales\namounted to 2,146.0 MEUR (1,836.5). Using fixed exchange\nrates and a comparable group structure (organic growth),\nnet sales increased by 11 per cent. Regionally, organic growth\nwas 14 per cent in Asia, 9 per cent in the Americas and 9 per\ncent in EMEA. Manufacturing Intelligence recorded 15 per\ncent organic growth, driven by a strong recovery following\nthe Covid-19 pandemic, especially in electronics, automotive\nand manufacturing. The software portfolio grew strongly\nthroughout the year. PPM recorded 1 per cent organic growth,\nhampered by continued weakness in oil and gas markets,\nhowever, the AIM (asset information management) software","geospatial enterprise solutions (1)":"Adjusted operating\nmargin, % Operating net sales, MEUR\nCustomer segment, %\nGeography, % Surveying, 39 Infrastructure & construction, 26\nNatural resources, 14\nAerospace & defence, 8\nPublic safety, 7\nOther, 6 Americas, 41 EMEA, 40 Asia, 19","industrial enterprise solutions (1)":"Adjusted operating\nmargin, % Operating net sales, MEUR\n1) Numbers for 2018 has not been restated according to IFRS16\nCustomer segment, %\nGeography, % Electronics & manufacturing, 34\nPower & energy, 24\nAutomotive, 18 Asia, 39 Americas, 32 EMEA, 29 Aerospace & defence, 10\nOther, 14 and the AEC (architecture, engineering and construction)\ndesign software portfolios recorded strong growth.","adjusted operating earnings":"Adjusted operating earnings (EBITDA) increased by 17 per\ncent to 1,654.1 MEUR (1,411.6), corresponding to an adjusted\nEBITDA margin of 38.0 per cent (37.4).Adjusted operating\nearnings (EBIT1), increased by 26 per cent to 1,269.6 MEUR\n(1,009.5), corresponding to an adjusted operating margin\n(EBIT1 margin) of 29.2 per cent (26.8).\nAdjusted operating earnings (EBIT1) for Geospatial Enterprise\nSolutions increased to 684.7 MEUR (537.8), corresponding to\nan adjusted operating margin of 31.1 per cent (27.8). Adjusted\noperating earnings (EBIT1) for Industrial Enterprise Solutions\nincreased to 609.1 MEUR (487.5), corresponding to an\nadjusted operating margin of 28.4 per cent (26.5).\nSegments Operating net sales\nAdjusted operating\nearnings (EBIT1)\nAdjusted gross earnings\nAdjusted gross earnings amounted to 2,806.8 MEUR\n(2,398.7). The adjusted gross margin was 64.6 per cent\nFinancial income and expenses\nThe financial net amounted to -26.2 MEUR (-27.4) in 2021.","adjustments":"During 2021 adjustments amounted to -259.8 MEUR\n(-222.5). Adjustments consist of share-based program\nexpenses (LTIP) amortisation of surplus values (PPA),\nacquired deferred revenue and non-recurring items\nrelated to transaction and integration costs and non-cash\nimpairments of overlapping technologies associated with\nthe acquisition of Infor's EAM business.","earnings before tax":"Earnings before tax, excluding adjustments, amounted\nto 1,243.4 MEUR (982.1). Including adjustments, earnings\nbefore tax were 983.6 MEUR (759.6).","effective tax rate":"Hexagon's tax expense for the year totalled -173.6 MEUR\n(-134.9), corresponding to an effective tax rate of 17.6 per\ncent (17.8). The tax rate, excluding adjustments, was 18.0\nNon-controlling interest\nThe non-controlling interest's share of net earnings was","net earnings":"Net earnings, excluding adjustments, amounted to 1,018.0\nMEUR (805.3) or 38.8 Euro cent per share (31.0).\nNet earnings, including adjustments, amounted to 810.0\nMEUR (624.7) or 30.8 Euro cent per share (24.0).\nCash flow\nCash flow from operations before changes in working\ncapital and non-recurring items amounted to 1,372.8 MEUR\n(1,153.2), corresponding to 52.8 Euro cent per share (44.8).\nIncluding changes in working capital, but excluding non-\nrecurring items, cash flow from operations was 1,351.4\nMEUR (1,374.5), corresponding to 52.0 Euro cent per share\n(53.4). Cash flow from other investment activities was\n-746.7 MEUR (-795.0). Cash flow after other investments\namounted to 157.5 MEUR (125.7). The change in borrowings\nwas 219.9 MEUR (92.7). Cash dividends to the Parent\nCompany shareholders amounted to -238.4 MEUR (-227.9),\ncorresponding to 0.09 EUR per share (0.09).","profitability":"Capital employed, defined as total assets less non-\ninterest bearing liabilities, increased to 11,777.6 MEUR\n(8,722.5). Return on average capital employed, excluding\nadjustments, for the last 12 months was 13.5 per cent (11.7).\nReturn on average shareholders' equity for the last 12\nmonths was 11.6 per cent (10.1). The capital turnover rate","financing and financial position":"Shareholders' equity, including non-controlling interest,\nincreased to 8,764.7 MEUR (5,949.2). The equity ratio\nincreased to 62.2 per cent (55.6).\nFollowing a refinancing in 2021, Hexagon's main sources of\nfinancing consist of:\n1. A multicurrency revolving credit facility (RCF) established\nin 2021. The RCF amounts to 1,500 MEUR with a tenor of\n5+1+1 years. 2 . A Swedish Medium-Term Note Programme (MTN)\nestablished during 2014. The MTN programme amounts\nto 20,000 MSEK with tenor up to 6 years. On 31 December\n2021, Hexagon had issued bonds for a total amount of\n3. A Swedish Commercial Paper Programme (CP)\nestablished in 2012. The CP programme amounts to\n15,000 MSEK with tenor up to 12 months. On 31 December\n2021, Hexagon had issued commercial paper for a total\nOn 31 December 2021, cash and unutilised credit limits\ntotalled 1,341.5 MEUR (1,764.6). Hexagon's net debt was\n2,540.8 MEUR (2,375.9). The net indebtedness was 0.27\ntimes (0.37). Interest coverage ratio was 32.4 times (23.5).","investments":"Ordinary investments consist mainly of investments in\nproduction facilities, production equipment and intangible\nassets, primarily capitalised development expenses. Of the\nordinary investments of 424.9 MEUR (394.1) during 2021,\napproximately 70 per cent (69) were capitalised expenses\nfor development work. Development work is primarily\nperformed in Hexagon's R&D centres with its primary units\nlocated in Switzerland, China, India and the USA, that results\nin products and services that are sold worldwide. The\nremaining part of the current investments, approximately\n30 per cent, comprised mostly of investments in new\nfacilities in Hongdao, China and in business equipment and\nmachines. All current investments during the year have been\nfinanced by cash flow from operating activities. Investments\ncorresponded to 10 per cent (10) of net sales. Hexagon does\nnot expect any material change to current investment levels\nas a percentage of net sales in the near future. Depreciation,\namortisation and impairment during the year amounted to\nto 566.5 MEUR (507.3), corresponding to 13 per cent (13) of\nnet sales. Development expenses are capitalised only if\nthey pertain to new products, the cost is significant and\nthe product is believed to have future economic benefits.\nThe current level of R&D costs is in line with other leading\ncompanies in the industry.\nInvestments Investments in intangible fixed assets 312.2\nInvestments in tangible fixed assets 112.7\nDivestments of tangible fixed assets -5.5\nTotal ordinary investments\nInvestments in subsidiaries\nDivestments of subsidiaries\nInvestments in financial fixed assets 4.0\nDivestments of financial fixed assets -5.4\nTotal other investments\nTotal investments","intangible fixed assets":"As of 31 December 2021, Hexagon's carrying value of\nintangible fixed assets was 10,909.4 MEUR (7,941.8).\nAmortisation of intangible fixed assets was -250.6 MEUR\n(-234.9). Impairment tests are made to determine whether\nthe value of goodwill and/or similar intangible assets is\njustifiable or whether there is any impairment need in full\nor in part. Goodwill as of 31 December 2021 amounted to\n8,205.6 MEUR (5,705.6), corresponding to 58 per cent (53)\nof total assets.\nGoodwill Geospatial Enterprise Solutions\nIndustrial Enterprise Solutions","research and development":"Hexagon places a high priority on investments in R&D. Being\none of the most innovative supplier in the industry, it is\nimportant not only to improve and adapt existing products,\nbut also to identify new applications and thereby increase\nthe total addressable market for Hexagon's products and\nservices. Total expenditure for R&D during 2021 amounted\nR&D cost\nMEUR Capitalised Expensed (excluding amortisation)\nAmortisation","environmental impact":{"data":"Hexagon seeks to have a positive impact on the environment\nby acting sustainably and addressing environmental\nchallenges in its internal operations and value chain. By\nupholding high standards of environmental sustainability\nprocesses, Hexagon supports activities that aims to\nreduce its environmental footprint, better meet customer\nrequests, attract and retain talent, generate savings,\nmitigate environmental risks and fuel innovation. The\nsolutions portfolio, which includes precision measurement\nsystems and simulation software, help customers optimise\nthe use of raw materials and components, improve energy\nefficiency and extend product life cycles. The solutions\nare also used to protect the environment and increase\nsafety by monitoring assets and predicting movements\nin structures in areas where natural disasters may have a\nserious impact on people and assets. However, Hexagon\nalso takes accountability for the environmental challenges\nin its internal operations as well as in all steps of the value\nchain. In 2021, Hexagon stipulated the goals to become\ncarbon neutral in its scope 1 and 2 emissions by 2030, and\nto become carbon neutral in the whole value chain (scope\n1, 2 and 3) by 2050. The carbon targets will be achieved by\nincreasing energy efficiency in Hexagon's facilities, reducing\nwaste in production and emissions from business travel as\nwell as in its company car fleet. Hexagon also has a goal of\nconducting sustainability audits on all of its key suppliers in\nrisk countries by 2023, a goal Hexagon expects to reach. For\nAcquisitions 2021 Hexagon's ambition is to generate profitable growth through a combination of organic growth and acquisitions.\nAcquisitions are an important part of Hexagon's long-term growth strategy. During 2021, Hexagon acquired the\nfollowing companies:","geospatial enterprise solutions":"Company Division Area Immersal Oy\nGeosystems","industrial enterprise solutions":"A provider of spatial mapping and visual positioning solutions\nCompany Division Area Mecadat Manufacturing Intelligence\nA distributor of CAD and CAM software","cadlm":"Manufacturing Intelligence\nA provider of CAE software\nZGTech Manufacturing Intelligence\nA provider of metrology-grade 3D scanners\nInfor's EAM business\nPPM A provider of EAM software\nJovix PPM A provider of material tracking software\nRead about acquisitions on page 70. →\nmore information about sustainability in Hexagon see the\ncomplete sustainability report on hexagon.com."},"share capital and ownership":"On December 31, 2021, Hexagon's share capital was 85,761,451\nEUR, represented by 2,705,477,888 shares. Total shares\noutstanding was 110,250,000 Class A shares, each carrying\nten votes and 2,585,877,888 Class B shares, each carrying one\nvote. On December 31, 2021, Melker Schörling AB, the single\nClass A shares and 466,256,440 Class B shares, representing\n42.4 per cent of the votes and 21.3 per cent of the capital.\nHexagon AB has acquired 9,350,000 of the company's own\nshares of Class B as of 31 December 2021. The purpose of the\nrepurchase is to ensure Hexagon's undertakings in respect\nof the long-term incentive programme (other than delivery of\nshares to participants in the incentive programme), including\ncovering social security costs.","significant agreements":"To the best of the Board of Director's knowledge, there\nare no shareholder agreements or similar agreements\nbetween the shareholders of Hexagon with the purpose\nof exercising joint control of the company. Neither is the\nBoard aware of any agreements that could lead to a change\nof control of the company.\nAs far as the Board knows, there is no shareholder\nagreement that could prevent the transfer of shares. Nor\nare there agreements between the company, directors or\nemployees, other than as described in Note 30 on page 72,\nwhich stipulate the right to compensation if such a person\nvoluntarily leaves the company, is dismissed without cause\nor if such a person's employment is terminated as a result\nof a public offer for shares of the company.","management of hexagon's capital":"Hexagon's reported shareholders' equity, including non-\ncontrolling interest, was 8,764.7 MEUR (5,949.2) at year-\nend. Hexagon's overall long-term objective is to increase\nearnings per share by at least 15 per cent annually and to\nachieve a return on capital employed of at least 15 per cent.\nAnother Group objective is to achieve an equity ratio of 25\nper cent as Hexagon is seeking to minimise the weighted\naverage cost of capital for the company's financing.\nHexagon has undertaken to comply with a requirement\nregarding a key financial ratio (covenant) towards lenders.\nThe key financial ratio is reported to lenders in conjunction\nwith the quarterly reports. If the requirement is not\ncomplied with, the terms and conditions are renegotiated\nand there is a risk of a temporary increase in borrowing\ncosts. In addition, lenders have a right to terminate loan\nagreements. Hexagon has never breached any covenants,\nnot in 2021 nor in prior years.\nThe company's strategy, as well as its financial position and\nother financial objectives, are considered in connection\nwith the annual decision concerning the dividend.","corporate governance":"In accordance with the Swedish Annual Accounts Act,\nHexagon has prepared a corporate governance report\nseparate from the annual report. It can be found in this\ndocument on pages 21-27. The Corporate governance report\ncontains the Board of Directors' report on internal control.","dividend and share split":"The dividend policy of Hexagon states that, over the\nlong term, the dividend should comprise 25-35 per cent\nof earnings per share after tax, assuming that Hexagon\nsatisfies its equity ratio objective.\nA dividend of 0.65 EUR per share (pre share split) for\nthe fiscal year 2020 was resolved by the Annual General\nMeeting (AGM) in April 2021. The record date was 3 May and\ndate of settlement was 10 May 2021.\nThe Annual General Meeting (AGM) 2021 resolved on a\nshare split 7:1 so that each existing share was divided into\nseven (7) shares.\nThe Hexagon Board of Directors proposes a dividend of 0.11\nEUR per share (0.09) for the fiscal year 2021, corresponding\nto 36 per cent of net earnings after tax. The proposed\nrecord date will be 3 May and expected date for settlement\nis 10 May 2022.","guidelines for remuneration of senior executives":"The Board of Directors of Hexagon AB (publ) proposed that\nthe AGM 2020 resolved on guidelines for remuneration to the\nPresident and CEO and other senior executives as follows.\nOther senior executives are defined as members of the group\nmanagement. The guidelines are applicable to remuneration\nagreed, and amendments to remuneration already agreed,\nafter adoption of the guidelines by the AGM 2020. These\nguidelines do not apply to any remuneration decided or\napproved by the general meeting.\nA prerequisite for the successful implementation of the\ncompany's business strategy and safeguarding of its\nlong-term interests, including its sustainability, is that\nthe company is able to attract and retain qualified senior\nexecutives. To this end, it is necessary that the company\noffers competitive remuneration on market terms. These\nguidelines enable the company to offer the executive\nmanagement a competitive total remuneration.\nVariable cash remuneration covered by these guidelines\nshall aim at promoting the company's business strategy and\nlong-term interests, including its sustainability.\nThe remuneration shall be on market terms and consist of\nfixed cash salary, variable remuneration, other benefits and\npension. Additionally, the general meeting may - irrespective\nof these guidelines - resolve on, among other things, share-\nrelated or share price-related incentive programmes.\nThe satisfaction of criteria for awarding variable cash\nremuneration shall be measured over a period of one year. The\nvariable cash remuneration is capped and shall be maximised\nat up to 150 per cent of the fixed annual cash salary.\nFor senior executives, pension benefits shall be paid not\nearlier than from the age of 60 years. As a general guideline,\npension benefits for the CEO, including health insurance, shall\nbe fee based. Variable cash remuneration shall not qualify for\npension benefits. The pension premiums for premium defined\npension shall amount to not more than 20 per cent of the fixed\nannual cash salary. As a general guideline, pension benefits\nfor other executives, including health insurance, shall be fee\nbased. Deviations from this general guideline may be made\nwhen appointing new senior executives whose employment\nagreements already comprise benefit-based pension plans or\nif the executive is covered by benefit pensions in accordance\nwith mandatory collective agreement provisions. Variable\ncash remuneration shall qualify for pension benefits only\nto the extent required by mandatory collective agreement\nprovisions applicable to the executive. The pension premiums\nfor premium defined pension shall amount to not more than\n25 per cent of the fixed annual cash salary. Other benefits\nmay include, for example, life insurance, medical insurance\nand company cars. Premiums and other costs relating to such\nbenefits may amount to not more than two per cent of the\nfixed annual cash salary.\nFor employments governed by rules other than Swedish, duly\nadjustments may be made for compliance with mandatory\nrules or established local practice, taking into account, to the\nextent possible, the overall purpose of these guidelines. The\nnotice period for the President and CEO is six months. Upon\ntermination by the company or in case of change of principal\nownership the President and CEO is entitled to severance pay\nequal to 18 months of salary. The period of notice for senior\nexecutives is a maximum of 24 months. During the notice\nperiod, basic salary is the only severance pay.\nThe variable cash remuneration shall be linked to\nindividualised predetermined and measurable criteria.\nThe criteria shall be designed so as to contribute to the\ncompany's business strategy and long-term interests,\nincluding its sustainability, by for example being clearly\nlinked to the business strategy or promote the executive's\nlong-term development. The variable cash remuneration\nis based on results. The design of the criteria for variable\ncash remuneration contributes to the company's business\nstrategy, long-term interests and sustainability.\nTo which extent the criteria for awarding variable cash\nremuneration has been satisfied shall be determined when\nthe measurement period has ended. The remuneration\ncommittee is responsible for the evaluation so far as it\nconcerns variable cash remuneration to the President and\nCEO. For variable cash remuneration to other executives,\nthe President and CEO is responsible for the evaluation. For\nfinancial objectives, the evaluation shall be based on the\nlatest financial information made public by the company. In\nthe preparation of the Board of Directors' proposal for these\nremuneration guidelines, salary and employment conditions\nfor employees of the company have been taken into account\nby including information on the employees' total income, the\ncomponents of the remuneration and increase and growth\nrate over time, in the remuneration committee's and the Board\nof Directors' basis of decision when evaluating whether the\nguidelines and the limitations set out herein are reasonable.\nThe Board of Directors has established a remuneration\ncommittee. Remuneration to the President and CEO\nand other senior executives shall be prepared by the\nremuneration committee and resolved by the Board of\nDirectors based on the proposal of the remuneration\ncommittee. The committee's tasks include preparing the\nBoard of Directors' decision to propose guidelines for\nexecutive remuneration. The Board of Directors shall prepare\na proposal for new guidelines at least every fourth year\nand submit it to the general meeting. The guidelines shall\nbe in force until new guidelines are adopted by the general\nmeeting. The remuneration committee shall also monitor and\nevaluate programs for variable remuneration for the executive\nmanagement, the application of the guidelines for executive\nremuneration as well as the current remuneration structures\nand compensation levels in the company. The members of\nthe remuneration committee are independent in relation to\nthe company and the company management. The President\nand CEO and other members of the executive management\ndo not participate in the Board of Directors' processing of and\nresolutions regarding remuneration-related matters in so far\nas they are affected by such matters.\nThe Board of Directors may temporarily resolve to derogate\nfrom the guidelines, in whole or in part, if in a specific case\nthere is special cause for the derogation and a derogation\nis necessary to serve the company's long-term interests,\nincluding its sustainability, or to ensure the company's financial\nviability. As set out above, the remuneration committee's\ntasks include preparing the Board of Directors' resolutions in\nremuneration-related matters. This includes any resolutions\nto derogate from the guidelines. The proposed guidelines for\nremuneration to senior executives that were proposed and\nadopted by the AGM 2020 are applicable until further notice.\nFor a description of remuneration to senior executives see\nNote 30 on page 72.","incentive programmes":"The Board of Directors proposed that the Annual General\nMeeting resolved on implementation of a performance\nbased long-term share programme for 2021 (Share\nProgramme 2021/2024), for more information on the share\nprogramme see Note 30 on page 72, and page 79.","parent company":"The Parent Company's earnings before tax were -14.4 MEUR\nratio of the Parent Company was 51 per cent (48). Liquid funds\nincluding unutilised credit limits were 916.1 MEUR (1,340.4).\nHexagon's activities are financed via equity and external\nborrowings in the Parent Company. Substantial currency\neffects arise due to Intra-Group and external lending and\nborrowing transactions in multiple currencies.","proposed appropriation of earnings":"The following earnings in the Parent Company are at\nthe disposal of the annual general meeting (KEUR):\nPremium reserve\nRetained earnings\nNet earnings\nThe board of the directors proposes that\nthese funds are allocated as follows:\nCash dividend to shareholders of 0.11 EUR per share\nBalance remaining in the premium reserve\nBalance remaining in retained earnings","significant events after the fiscal year":"On February 25 2022, Hexagon announced the acquisition\nof ETQ, a leading provider of SaaS-based QMS (quality\nmanagement system), EHS (environment, health and safety)\nand compliance management software."},"corporate governance report":{"data":"Hexagon AB is a public company listed on Nasdaq\nStockholm. The corporate governance of Hexagon is based\non Swedish legislation, primarily the Swedish Companies\nAct, Hexagon's Articles of Association, the Board of\nDirectors' internal rules, Nasdaq Stockholm's rules and\nregulations, the Swedish Code of Corporate Governance\n(the \"Code\") and regulations and recommendations issued\nby relevant organisations.\nHexagon applies the Code, which is based on the principle\n\"comply or explain\". Hexagon did not note any deviations\nfrom the Code for the 2021 financial year.\nThis corporate governance report has been prepared in\naccordance with the provisions of the Annual Accounts Act\nand the Code and has, by virtue of Section 6, paragraph 8\nof the Annual Accounts Act, been drawn up as a document\nseparate from the annual report.","ownership structure and share information":"At 31 December 2021, Hexagon's share capital was EUR\nwhich 110,250,000 are of Class A with ten votes each and\n2,595,227,888 are of Class B with one vote each. As of\n31 December 2021, Hexagon AB holds in total 9,350,000\nof the company's own shares of Class B acquired on\nNasdaq Stockholm. Repurchase of 4,828,000 shares\nwas made during 2021 pursuant to the authorisation\ngranted by the Annual General Meeting on 29 April 2021.\nThe authorisation comprises acquisitions on Nasdaq\nStockholm, on one or more occasions for the period up\nuntil the Annual General Meeting 2022, of maximum so\nmany Series B shares that the company's holding does\nnot exceed 10 per cent of all shares in the company at that\ntime. According to the authorisation any acquisitions of\nshares on Nasdaq Stockholm may only occur at a price\nwithin the share price interval registered at that time,\nwhere share price interval means the difference between\nthe highest buying price and the lowest selling price. The\nBoard of Directors was further authorised, for the period\nup until the Annual General Meeting 2022 on one or more\noccasions, to resolve on transfer of the company's own\nSeries B shares. According to the authorisation, transfer\nof Series B shares may be made at a maximum of 10 per\ncent of the total number of shares in the company from\ntime to time. A transfer may be made with deviation from\nthe shareholders' preferential rights on Nasdaq Stockholm\nas well as to third parties in connection with acquisition of\na company or a business. Compensation for transferred\nshares can be paid in cash, through an issue in kind or a\nset-off. Transfers of shares on Nasdaq Stockholm may\nonly occur at a price per share within the share price\ninterval registered at that time. Transfer in connection with\nacquisitions may be made at a market value assessed by\nthe Board of Directors. The purpose of the authorisations is\nto give the Board of Directors the opportunity to adjust the\ncompany's capital structure, to finance potential company\nacquisitions, and as a hedge for the company's share-based\nincentive programmes. The purpose of the repurchase\nduring 2021 is to ensure Hexagon's undertakings in respect\nof the long-term incentive programmes (other than delivery\nof shares to participants in the incentive programmes),\nincluding covering social security costs. The Board of\nDirectors did not exercise the authorisation to resolve on\ntransfer of own shares during 2021.\nThe Annual General Meeting held on 29 April 2021 also\nauthorised the Board of Directors to, with or without\ndeviation from the shareholders' preferential rights, and\nwith or without provisions for contribution in kind, set-\noff or other conditions, resolve to issue Series B shares,\nconvertibles and/or warrants (with rights to subscribe for\nor convert into Series B shares). The authorisation may\nbe utilised on one or more occasions during the period\nup until the Annual General Meeting 2022. By resolutions\nin accordance with the authorisation, the number of\nshares may be increased by a number corresponding to\na maximum of 10 percent of the number of outstanding\nshares in the company at the time when the Board of\nDirectors first uses the authorisation. The purpose of\nthe authorisation is to ensure financing of acquisitions\nof companies, part of companies or businesses or to\nstrengthen the company's capital base and equity/\nassets ratio. In case of deviation from the shareholders'\npreferential rights, issues by virtue of the authorisation\nshall be made on market conditions. The authorisation was\nutilised to carry out the issue in kind of 132,622,274 Series B\nshares in the company on 1 October 2021 in connection with\nHexagon's acquisition of Infor's EAM business.\nMelker Schörling AB, the single largest shareholder in\nHexagon, held a total of 110,250,000 Class A shares and\n466,256,440 Class B shares at year-end 2021, representing\n42.4 per cent of the votes and 21.3 per cent of the capital. No\nother shareholder has any direct or indirect shareholding\nrepresenting 10 per cent or more of the total votes.\nTo the best of the knowledge of the Board of Directors (the\n\"Board\"), there are no shareholder agreements or similar\nagreements between the shareholders of Hexagon with\nthe purpose of exercising joint control of the company. The\nBoard also is not aware of any agreements that could lead\nto a change in control of the company or that could prevent\nthe transfer of shares of the company.","annual general meeting":"The General Meeting is Hexagon's supreme decision-\nmaking body in which all shareholders are entitled to\nparticipate. The Articles of Association of the company\ncontain no restrictions regarding the number of votes that\nmay be cast by a shareholder at general meetings. At the\nAnnual General Meeting (AGM), the Board presents the\nannual report (including the consolidated accounts) and\nthe audit report. Hexagon issues the notice convening\nthe AGM no later than four weeks prior to the meeting. To\nattend the AGM, a shareholder must be recorded in the\nshare register and notify the company of his/her intention\nto attend the AGM within the time limit set forth in the\nnotice convening the AGM. The AGM is held in Stockholm,\nSweden, usually at the end of April or in the beginning of\nMay. The AGM provides shareholders with an opportunity\nto address a number of issues, such as the adoption of the\nincome statement and balance sheet, the appropriation\nof the company's profit or loss according to the adopted\nbalance sheet, the discharge from liability to the company\nof the Board members and the President and CEO, the\nremuneration of the Board and auditors, the principles for\nremuneration and employment terms for the President\nand CEO and other senior executives, approval of the\nremuneration report for the previous financial year, the\nelection of members and the Chair of the Board, the\nelection of the auditor, and any amendments to the Articles\nof Association.","nomination committee":"The AGM has resolved that the Nomination Committee's\nassignment shall comprise the preparation and\npresentation of proposals to the shareholders at the AGM\non the election of Board members, Chair of the Board,\nChair of the AGM, and the company's auditors. In addition,\nthe Nomination Committee presents proposals regarding\nremuneration of the Board of Directors (including for\ncommittee work) and the auditors.\nThe Nomination Committee shall consist of\nrepresentatives for major shareholders of the company\nelected by the AGM. In case a shareholder, who a member\nof the Nomination Committee represents, is no longer one\nof the major shareholders of Hexagon or if a member of\nthe Nomination Committee is no longer employed by such\nshareholder or for any other reason leaves the Committee\nbefore the next AGM, the Committee is entitled to appoint\nanother representative among the major shareholders to\nreplace such a member. No fees are paid to the members\nof the Nomination Committee.","board of directors":"In accordance with the Articles of Association, the Board of\nDirectors of Hexagon shall consist of no less than three and\nnot more than ten members, elected annually by the AGM\nfor the period until the end of the next AGM. The Articles of\nAssociation of the company contain no special provisions\nregarding the election and discharge of Board members or\nregarding changes to the Articles of Association. The EGM\nheld on 17 November 2021 resolved that the Board shall\nconsist of ten members, including the President and Chief\nExecutive Officer. The Chief Financial Officer and Executive\nVice President, the General Counsel, the Chief Operating\nOfficer and the Chief Strategy Officer participate in the\nBoard meetings. Other Hexagon employees participate in\nthe Board meetings to make presentations on particular\nmatters if requested.\nThe Nomination Committee's conclusions regarding the\nBoard members' independence in relation to the company,\nits management and major shareholders is presented\non page 30. According to the requirements set out in the\nCode, the majority of the Board members elected by the\nAGM must be independent in relation to the company and\nits management and at least two of such Board members\nshall also be independent in relation to the company's\nmajor shareholders. The criteria set forth in the Code\nand other relevant factors were considered in making\ndeterminations about independence.\nAuditor Audit Committee\nShareholders via\nAnnual General Meeting\nBoard of Directors\nNomination Committee\nRemuneration committee President and CEO Operations\nElects/appoints\nInforms/reports","key data for board members":"Committee membership\nMeeting attendance\nBoard Member1\nElected Independent\nAudit Committee\nRemuneration Committee Board of\nDirectors Audit Committee\nRemuneration Committee Gun Nilsson\nNo2 John Brandon\nYes Ulrika Francke\nYes Henrik Henriksson\nYes Erik Huggers\nYes Ola Rollén\nNo3 Märta Schörling Andreen\nNo2 Sofia Schörling Högberg\nNo2 Patrick Söderlund\nYes Brett Watson\nYes 1) A complete presentation of the Board Members is included on pages 30-31\n2) Gun Nilsson, Märta Schörling Andreen and Sofia Schörling Högberg are not deemed to be independent of the company's major shareholders\n3) Ola Rollén is not deemed to be independent of the company as a result of his position as Hexagon's President and CEO","board and committee meetings":"Board of Directors\nAudit Committee\nRemuneration Committee\nThe Board of Directors is responsible for determining\nHexagon's overall objectives, developing and monitoring\nthe overall strategy, deciding on major acquisitions,\ndivestments and investments, and ongoing monitoring\nof operations. The Board is also responsible for ongoing\nevaluation of management, as well as systems for\nmonitoring internal controls and the company's financial\nposition. The Board ensures that the company's external\ndisclosure of information is characterised by openness\nand that it is accurate, relevant and clear. Procedural\nrules and instructions for the Board and the President\nand CEO govern issues requiring Board approval and\nfinancial information and other reporting to be submitted\nto the Board.\nThe Chair directs the Board's activities to ensure that they\nare conducted pursuant to the Swedish Companies Act,\nthe prevailing regulations for listed companies and the\nBoard's internal control instruments.\nAt all scheduled Board meetings, information concerning\nHexagon's financial position and important events\naffecting the company's operations is presented.","audit committee":"The Audit Committee, which is a preparatory body in the\nBoard's contacts with the company's auditors, is appointed\nannually by the Board and regularly submits reports to\nthe Board about its work. The Audit Committee follows\nwritten instructions and is, through its activities, to meet\nthe requirements stipulated in the Swedish Companies\nAct and in the EU's audit regulation. The Committee's\ntasks include assisting the Nomination Committee in\ndrawing up proposals for AGM resolutions on the election\nof auditors and remuneration to auditors, monitoring that\nthe auditor's term of office does not exceed applicable\nrules, procuring the audit and making a recommendation\nin accordance with the EU's audit regulation. Furthermore,\nthe Audit Committee shall review and monitor the auditors'\nimpartiality and independence, paying particular attention\nto whether the auditor provides the company with other\nservices than the audit. The Audit Committee shall also\nissue guidelines for services in addition to auditing services\nprovided by the auditors and in applicable cases approve\nthese services according to the issued guidelines. The\nAudit Committee shall take part in planning auditing\nservices and related reporting and regularly meet with the\nexternal auditors to stay informed on the orientation and\nscope of the audit. The Audit Committee shall also review\nand monitor the Group's financial reporting, the activities\nof the external auditors, the company's internal controls,\nthe current risk situation and the company's financial\ninformation to the market. The Audit Committee's tasks\nalso include submitting recommendations and proposals\nto ensure the reliability of financial reporting and other\nissues that the Board assigns the Committee to consider.\nThe Committee has not, other than pursuant to written\ninstructions approved by the Board specifically for the\nAudit Committee, been authorised to make any decisions\non behalf of the Board.","remuneration committee":"The Remuneration Committee is appointed by the Board\nannually and its task is, on behalf of the Board, to consider\nissues regarding remuneration of the President and\nCEO and executives that report directly to the President\nand CEO and other similar issues that the Board assigns\nthe Committee to consider. The Committee shall also\nfollow and evaluate ongoing programmes or programmes\ncompleted during the year for variable remuneration\nto Group Management, as well as the application of\nthe guidelines for remuneration to senior executives\nas resolved by the AGM. The Committee has not been\nauthorised to make any decisions on behalf of the Board.","external auditors":"The AGM appoints the company's auditors. On behalf\nof the shareholders, the auditors' task is to examine the\ncompany's Annual Report and accounting records and\nthe administration by the Board of Directors and the\nPresident and CEO. In addition to the audit, the auditors\noccasionally have other assignments, such as work relating\nto acquisitions and tax. Hexagon's auditors normally attend\nthe first Board meeting each year, at which the auditor\nreport observations from the examination of Hexagon's\ninternal controls and the annual financial statements.\nMoreover, the auditors report to and regularly meet with\nthe Audit Committee. In addition, the auditors participate\nin the AGM to present the Auditor's report, which describes\nthe audit work and observations made.","internal control":"The responsibility of the Board for internal control is\nregulated in the Swedish Companies Act and in the\nCode. It is the duty of the Board to ascertain that the\ninternal control and formalised routines of the company\nensure that the principles for internal control and\nfinancial reporting are adhered to and that the financial\nreports comply with the law and other requirements\napplicable to listed companies. The Board bears the\noverall responsibility for internal control of the financial\nreporting. The Board has established written formal rules\nof procedure that clarify the Board's responsibilities and\nregulate the internal distribution of work between the\nBoard and its committees.","president and ceo and group management":"The President and CEO is responsible for leading and\ncontrolling Hexagon's operations in accordance with the\nSwedish Companies Act, other legislation and regulations,\napplicable rules for listed companies, as well as the Code,\nthe Articles of Association and the instructions and\nstrategies determined by the Board. The President and\nCEO shall ensure that the Board is provided with objective,\ndetailed and relevant information required in order for\nthe Board to make well-informed decisions. Furthermore,\nthe President and CEO is responsible for keeping the\nBoard informed of the company's development between\nBoard meetings.\nThe Group Management, comprising the President\nand CEO, divisional presidents, heads of geographical\nregions and certain specific Group staff functions, totals\n13 persons. Group Management is responsible for the\noverall business development and the apportioning of\nfinancial resources between the business areas, as well as\nmatters involving financing and capital structure. Regular\nmanagement meetings constitute Hexagon's forum\nfor implementing overall controls down to a particular\nbusiness operation and in turn, down to the individual\ncompany level.","operations":"In financial terms, Hexagon's business operations are\ncontrolled on the basis of the return on capital employed.\nThis requires focus on maximising operating earnings\nand minimising working capital. Hexagon's organisational\nstructure is decentralised with central oversight and\ncoordination. Targets, guidelines and strategies are\nset centrally in collaboration with the business units.\nManagers assume overall responsibility for their respective\nbusiness and pursue the clearly stated objectives.\nACTIVITIES DURING THE YEAR\nAnnual General Meeting 2021\nThe AGM, held on 29 April 2021 in Stockholm, Sweden, was\nattended by shareholders representing 63 per cent of the\ntotal number of shares and 73 per cent of the total number\nof votes. The AGM was carried out solely through advance\nvoting (postal voting) pursuant to temporary legislation due\nto the Covid-19 pandemic. Gun Nilsson was elected Chair of\nthe AGM.\nThe following main resolutions were passed at the\n- Re-election of Directors Gun Nilsson, John Brandon,\nUlrika Francke, Henrik Henriksson, Ola Rollén, Märta\nSchörling Andreen, Sofia Schörling Högberg and Patrick\nSöderlund\n- Re-election of Gun Nilsson as Chair of the Board\n- Election of the accounting firm PricewaterhouseCoopers\nAB (PwC) for a one-year period of mandate. PwC has\nappointed the authorised public accountant Bo Karlsson\nas auditor in charge\n- Dividend of 0.65 EUR per share for 2020 as per the Board's\nproposal - Resolution on approval of remuneration report for 2020\n- Approval of a performance based long term incentive\nprogramme (Share Programme 2021/2024)\n- Authorisation for the Board of Directors on acquisition\nand transfer of Hexagon shares\n- Authorisation for the Board of Directors to issue shares,\nconvertibles and/or warrants\n- Approval of share split 7:1 and amendment of the Articles\nof Association due to changes in number of shares\nExtraordinary General Meeting 2021\nThe Extraordinary General Meeting (EGM), held on 17\nNovember 2021 in Stockholm, Sweden, was attended by\nshareholders representing 56 per cent of the total number\nof shares and 68 per cent of the total number of votes. The\nEGM was carried out solely through advance voting (postal\nvoting) pursuant to temporary legislation due to the Covid-19\npandemic. Gun Nilsson was elected Chair of the EGM.\nThe following main resolutions were passed at the\n- Amendment of the Articles of Association regarding the\nnumber of board members\n- Election of board members Erik Huggers and Brett\nWatson","nomination committee (1)":"For the proposal for the AGM 2021, the Nomination\nCommittee applied rule 4.1 of the Code as the diversity\npolicy related to the Committee's nomination work. The\nNomination Committee confirmed that the Board of\nHexagon has an equal gender balance and an appropriate\ncomposition in general. Additional criteria, such as\nbackground, experience, previous leadership roles,\nrelevant insights into Hexagon's industries and other\ncustomary attributes were considered when nominating\nthe directors.\nIn respect of the 2022 AGM, the Nomination Committee\ncomprises: - Mikael Ekdahl, Melker Schörling AB (Chair)\n- Jan Dworsky, Swedbank Robur fonder\n- Caroline Forsberg, SEB Investment Management\n- Anders Oscarsson, AMF and AMF Fonder\nDuring 2021, the Nomination Committee held two minuted\nmeetings at which the Chair gave an account of the\nprocess of evaluation of the Board's work. The Committee\ndiscussed and decided on proposals to submit to the EGM\n2021 and AGM 2022 concerning the election of Chair of\nthe EGM and the AGM, respectively, the election of Chair\nand other Board Members, remuneration to the Board,\nincluding remuneration for committee work, and fees to\nthe auditors. Shareholders wishing to submit proposals\nhave been able to do so by contacting the Nomination\nCommittee via mail or email. Addresses have been made\navailable on Hexagon's website.","board of directors' activities":"In 2021, the Board held 15 minuted meetings, including\nthe statutory Board meeting. At the Board meetings, the\nPresident and CEO presented the financial and market\nposition of Hexagon and important events affecting\nthe company's operations. On different occasions,\nHexagon senior executives presented their operations\nand business strategies to the Board. In addition, items\nsuch as the approval of the interim reports, the annual\nreport, acquisitions, cyber security and sustainability are\npart of the Board's work plan and the company's auditors\npresented a report on their audit work during the year. At\nthe Board meeting in January 2021 the board approved\nthe new sustainability targets and in December 2021, the\nBoard approved the operational strategy and the financial\nplan for 2022.","evaluation of the board's work":"The Board continuously evaluates its work and the format\nof its activities. This evaluation considers factors such\nas how the Board's work can be improved, whether the\ncharacter of meetings stimulates open discussion and\nwhether each Board member participates actively and\ncontributes to discussions. The evaluation is coordinated\nby the Chair of the Board. In 2021, the Chair conducted\na written survey with all the Board members. The result\nof the evaluation has been reported to and discussed by\nthe Board and the Nomination Committee. The Board is\nalso evaluated within the framework of the Nomination\nCommittee's activities.","audit committee (1)":"During 2021, the Audit Committee comprised:\n- Ulrika Francke (Chair) - Sofia Schörling Högberg\n- Gun Nilsson\nIn 2021, the Committee held six minuted meetings\nwhere the financial reporting and risks of Hexagon were\nmonitored and discussed. The Committee dealt with\nrelevant accounting issues, audit work and reviews, new\nfinancing, and testing for impairment of goodwill.","remuneration committee (1)":"During 2021, the Remuneration Committee comprised:\n- Gun Nilsson (Chair) - Sofia Schörling Högberg\nIn 2021, the Committee held two minuted meetings where\nremuneration and other employment terms and conditions\nfor the President and CEO and other Group Management\nwere discussed. The Remuneration Committee also\nmonitored and evaluated the ongoing programmes for\nvariable remuneration to senior executives as well as the\napplication of the guidelines for remuneration to senior\nmanagers and the structure and levels of remuneration in\nthe company.","external auditors (1)":"The AGM 2021 elected the accounting firm\nPricewaterhouseCoopers AB (PwC) as auditor for a one-\nyear period of mandate. PwC replaced Ernst & Young\nAB and has appointed authorised public accountant Bo\nKarlsson as auditor in charge. In addition to Hexagon, he\nconducts auditing assignment on I.A Hedin Bil AB (publ)\nwith recent auditing assignments for such companies as\nASSA ABLOY AB (publ), SKF AB (publ) and Investment AB\nLatour (publ).\nHexagon's auditors attended the first Board meeting of\nthe year, at which they reported observations from their\nexamination of Hexagon's internal controls and the annual\nfinancial statements. The auditors met with the Audit\nCommittee on seven occasions during 2021. The address\nStockholm, Sweden.","remuneration principles":"The following principles for remuneration to senior\nexecutives in Hexagon were adopted by the AGM 2020.\nRemuneration shall consist of a basic salary, variable\nremuneration, pension and other benefits and all\nremuneration shall be competitive and in accordance\nwith market practice. The variable remuneration shall\nbe maximised at up to 150 per cent in relation to the\nbasic remuneration, related to the earnings trend which\nthe relevant individual may influence and based on the\noutcome in relation to individual targets.\nThe Board annually considers whether a share or share-\nbased incentive programme shall be proposed to the AGM.\nThe notice period shall normally be six months when notice\nof termination of employment is delivered by the employee.\nIn case of notice of termination of employment delivered\nby the company, the notice period and the period during\nwhich severance payment is paid shall, all in all, not exceed\n24 months. Pension benefits shall, as a main rule, be\ndefined contribution. Deviation from this main rule may be\npermitted when appointing new senior executives whose\nprevious employment agreement included a defined-\nbenefit pension plan. The pension age for senior executives\nis individually determined, although not less than 60 years\nof age.\nThe guidelines for remuneration are applicable until\nfurther notice and the Board will not propose any changes\nin the guidelines to the AGM 2022. The complete guidelines\nare presented on pages 19-20.","remuneration of group management":"Remuneration of the President and CEO and other senior\nexecutives is presented in Note 30 on page 72. The Board\nhas prepared a remuneration report for approval by the\nThere are no agreements between the company and its\ndirectors or employees, other than as described in Note 30,\nwhich stipulate the right to compensation if such person\nvoluntarily leaves the company, such person is dismissed\nwith cause or if such person's employment is terminated as\na result of a public offer for shares in the company.","incentive programmes":"Details of the Share Programme 2020/2023 and the Share\nProgramme 2021/2024 are presented on page 79 (The\nShare section) and in Note 30 on page 72.","remuneration of board of directors":"Remuneration of the Board of Directors is resolved by\nthe AGM upon proposal from the Nomination Committee.\nDuring 2021, the Chair of the Board and other Board\nMembers received remuneration totalling\nKEUR (603.9). Remuneration of the Board of Directors is\npresented in Note 30 on page 72.","remuneration of external auditors":"Remuneration for services in addition to auditing services\nprimarily refers to work related to acquisitions and tax.\nRemuneration of the external auditors is presented in Note\n31 on page 73.\nFor more details about principles practised →\n- The Swedish Companies Act, regeringen.se\n- The Swedish Code of Corporate Governance,\ncorporategovernanceboard.se\nMore information is available at hexagon.com →\n- Articles of Association\n- Information from earlier General Meetings\n- Information about the members of the Board of Directors, the\nPresident and CEO and the auditor\n- Information about the Nomination Committee, including the\ncompany's instructions for the Nomination Committee\n- Information ahead of the Annual General Meeting 2022","internal control pertaining to financial reporting":{"data":"The Annual Accounts Act and the Code stipulate that the\nBoard of Directors must submit a report on the key aspects\nof the company's systems for internal controls and risk\nmanagement regarding financial reports. Internal control\npertaining to financial reporting is a process that involves\nthe Board, company management and other personnel.\nThe process has been designed so that it provides\nassurance of the reliability of the external reporting.\nAccording to a generally accepted framework that has\nbeen established for this purpose, internal control is\nusually described from five different perspectives:","1. control environment":"Hexagon's organisation is designed to facilitate rapid\ndecision making. Accordingly, operational decisions are\ntaken at the business area or subsidiary level, while decisions\nconcerning strategies, acquisitions and company-wide\nfinancial matters are taken by the company's Board and\nGroup Management. The organisation is characterised by\nwell-defined allocation of responsibility and well-functioning\nand well-established governance and control systems,\nwhich apply to all Hexagon units. The basis for the internal\ncontrol pertaining to financial reporting is comprised of\nan overall control environment in which the organisation,\ndecision-making routes, authorities and responsibilities\nhave been documented and communicated in control\ndocuments, such as Hexagon's finance policy and\nreporting instructions and in accordance with the\nauthorisation arrangements established by the President\nand CEO.\nHexagon's functions for financial control are integrated\nby means of a group-wide reporting system. Hexagon's\nfinancial control unit engages in close and well-functioning\ncooperation with the subsidiaries' controllers in terms of\nthe financial statements and the reporting process. The\nBoard's monitoring of the company's assessment of its\ninternal control includes contacts with the company's\nauditor. Hexagon has no internal audit function, since the\nfunctions described above satisfy this need. All of Hexagon's\nsubsidiaries report complete financial statements on\na monthly basis. This reporting provides the basis for\nHexagon's consolidated financial reporting. Each legal entity\nhas a controller responsible for the financial control and for\nensuring that the financial reports are correct, complete\nand delivered in time for consolidated financial reporting.","2. risk assessment":"The significant risks affecting the internal control of\nfinancial reporting are identified and managed at group,\nbusiness area, subsidiary and unit level. Within the Board,\nthe Audit Committee is responsible for ensuring that\nsignificant financial risks and the risk of error in financial\nreporting is identified and managed in a manner that\nensures correct financial reporting. Special priority has\nbeen assigned to identifying processes that, to some\nextent, give rise to a higher risk of significant error due to\nthe complexity of the process or of the contexts in which\nmajor values are involved.","3. control activities":"The risks identified with respect to the financial reporting\nprocess are managed via the company's control activities.\nThe control activities are designed to prevent, uncover and\ncorrect errors and non-conformities. Their management\nis conducted by means of manual controls in the form of,\nfor example, reconciliations, automatic controls using IT\nsystems and general controls conducted in the underlying\nIT environment. Detailed analyses of financial results and\nevaluation in relation to budget and forecasts supplement\nthe business-specific controls and provide general\nconfirmation of the quality of the financial reporting.","4. information and communication":"To ensure the completeness and correctness of financial\nreporting, Hexagon has formulated information and\ncommunication guidelines designed to ensure that\nrelevant and significant information is exchanged within\nthe business, within the particular unit and to and from\nmanagement and the Board. Guidelines, handbooks and\njob descriptions pertaining to the financial process are\ncommunicated between management and personnel and\nare accessible electronically and/or in a printed format.\nThe Board receives regular feedback in respect of the\ninternal control process from the Audit Committee. To\nensure that the external communication of information\nis correct and complete, Hexagon complies with a Board\napproved information policy that stipulates what may be\ncommunicated, by whom and in what manner.","5. monitoring activities":"The efficiency of the process for risk assessment and\nthe implementation of control activities are reviewed\ncontinuously. The follow-up pertains to both formal and\ninformal procedures used by the officers responsible\nat each level. The procedures incorporate the review of\nfinancial results in relation to budget and plans, analyses\nand key figures. The Board obtains current and regular\nreports on Hexagon's financial position and performance.\nAt each Board meeting, the company's financial position is\naddressed and, on a monthly basis, management analyses\nthe company's financial reporting at a detailed level. The\nAudit Committee follows up the financial reporting at its\nmeetings and receives reports from the auditors describing\ntheir observations."},"auditor's report on the corporate governance statement":{"data":"To the general meeting of the shareholders of Hexagon AB (publ), corporate\nidentity number 556190-4771","engagement and responsibility":"It is the board of directors who is responsible for the corporate governance\nstatement for the year 2021 on pages 21-27 and that it has been prepared in\naccordance with the Annual Accounts Act.","the scope of the audit":"Our examination has been conducted in accordance with FAR's auditing standard\nRevR 16 The auditor's examination of the corporate governance statement. This\nmeans that our examination of the corporate governance statement is different\nand substantially less in scope than an audit conducted in accordance with\nInternational Standards on Auditing and generally accepted auditing standards in\nSweden. We believe that the examination has provided us with sufficient basis for\nour opinions.","opinions":"A corporate governance statement has been prepared. Disclosures in\naccordance with chapter 6 section 6 the second paragraph points 2-6 the\nAnnual Accounts Act and chapter 7 section 31 the second paragraph the same\nlaw are consistent with the annual accounts and the consolidated accounts and\nare in accordance with the Annual Accounts Act.\nStockholm 30 March 2022\nPricewaterhouseCoopers AB\nBo Karlsson\nAuthorised Public Accountant\nPartner in charge\nHelena Kaiser de Carolis\nAuthorised Public Accountant"}},"letter from the chair of the board":{"data":"\"By empowering an\nautonomous, sustainable\nfuture, Hexagon will\ncontinue driving growth\nand shareholder value.\"","dear shareholders,":"It is once again time to look back at the year past, a year where\nwe finally got back to a semblance of normalcy. Industry freed\nitself from the shackles of a global pandemic to start growing\nagain. Hexagon was no different, showcasing record-breaking\nresults, transformative acquisitions, and revolutionary\nproduct launches that made 2021 an extraordinary year.\nIn last year's letter, I conveyed the Board's firm belief that\nsuccessful companies must stay focused and stick to game\nplans, which we remained deeply committed to in 2021. We\ncontinued to invest in R&D, corresponding to 566.5 MEUR\nand 13 per cent of total revenue, to further our long-term\nstrategy: to empower an autonomous, sustainable future.\nThis investment led to the successful launch of revolutionary\nproducts such as the Leica BLK ARC-an autonomous laser\nscanning module that can be integrated with robotic carriers\nto enable autonomous mobile laser scanning, and the Leica\nBLK2FLY-the world's first autonomous flying laser scanner\nwith advanced obstacle avoidance for easy reality capture\nfrom the sky.\nAcquisitions have always been a strategic part of Hexagon's\ngrowth and success, and 2021 did not disappoint in this\nregard. We made our biggest acquisition yet with the carve-\nout of Infor's EAM business and entered into a strategic\npartnership with Infor and Koch Equity Development. In\ntotal, we made six acquisitions during the year, welcoming an\nabundance of innovation and new talent to Hexagon.\n2021 was also a year in which Hexagon accelerated its\nsustainability journey. We've long said that sustainability is\nthe biggest business opportunity of the 21st century, and\nin 2021 we began leading by example with the launch of\nR-evolution. Intent on reinventing how industry addresses\ncomplex environmental challenges, R-evolution is one\nhundred percent focused on running profit-driven\ninvestments in green-tech projects where Hexagon's\ntechnology can be applied. We also set several ambitious\nsustainability goals in 2021, including becoming carbon\nneutral in our entire value chain by 2050, conducting\nsustainability supplier audits on 100 per cent of our direct\nsuppliers in key risk areas by 2023 and achieving at least 30\nper cent women in leadership positions by 2025.\nBy empowering an autonomous, sustainable future, Hexagon\nwill continue driving growth and shareholder value. Our\nprimary function as the Board of Directors is to be the pillar\nthat ensures management has the support and freedom\nto continue building upon Hexagon's success. For us, that\nmeans trusting Hexagon's leadership and supporting\ntheir ability to make fast-paced decisions while providing\nadvice and help where and when we are needed. We remain\nconfident in this strategy, supported by our new five-year\nfinancial targets launched at our 2021 Capital Markets Day.\nOn behalf of the Board of Directors, I want to thank all the\nemployees at Hexagon for their outstanding work and all\nshareholders for their continued trust in us. It is our pleasure\nand privilege to serve on Hexagon's Board of Directors and\ncontinue to execute Hexagon's long-term strategy and further\nits future success.\nGun Nilsson\nChair of the Board"},"board of directors":{"gun nilsson":"Born in 1955\nMember of the Board since 2008\nChair of the Board since 2017\nChair of the Remuneration Committee and\nMember of the Audit Committee\nEducation: B.Sc. (Economics)\nWork experience:\nPresident of Melker\nSchörling AB, CFO of IP-Only Group, Sanitec\nGroup and Nobia Group, CEO of Gambro\nHolding AB, Deputy CEO and CFO of Duni AB\nOther assignments:\nBoard Member of\nHexpol AB, AAK AB, Absolent Air Care Group\nAB, Bonnier Group AB and Einar Mattsson\nAB, Chair of The Swedish Corporate\nGovernance Board\nPrevious assignments in the past five years:\nBoard Member of Capio AB, Loomis AB and\nDometic Group\nShareholding 88,662 shares of series B\nIndependent of the company and its\nmanagement","john brandon":"Born in 1956\nMember of the Board since 2017\nEducation: B.A. (History)\nWork experience:\nAdvisor at Conductive\nVentures, Vice President International of\nApple Inc., CEO Academic Systems Inc., Vice\nPresident and General Manager at North\nAmerica of Adobe Systems Inc.\nOther assignments:\nBoard Member of\nSecuritas AB\nPrevious assignments in the past five years: -\nShareholding 21,000 shares of series B\nIndependent of the company, its\nmanagement and major shareholders","ulrika francke":"Born in 1956\nMember of the Board since 2010\nChair of the Audit Committee\nEducation: University studies\nWork experience:\nPresident and CEO of\nTyréns AB, City Planning Director and Street\nand Property Director at City of Stockholm\nand CEO of SBC AB\nOther assignments:\nChair of Vasakronan,\nKnightec AB and Swedish Green Building\nCouncil, Vice Chair of Swedish Standards\nInstitute (SIS), and Board Member of Liquid\nWind, Circura, Sven Tyréns Foundation and\nVREF (Volvo Research and Educational\nFoundation) and ISO President\nPrevious assignments in the past five\nyears: Vice Chair of Swedbank AB, Chair\nof BIM Alliance Sweden and Stockholm\nStadsteater AB, Board Member of Tyréns\nAB, Almega - the Employer's Organisation\nfor the Swedish Service Sector and Wåhlin\nFastighets AB\nShareholding 42,000 shares of series B\nIndependent of the company, its\nmanagement and major shareholders","henrik henriksson":"Born in 1970\nMember of the Board since 2017\nEducation: B.Sc. (Business Administration)\nWork experience:\nPresident H2GreenSteel\nAB, President and CEO of Scania AB,\nExecutive Vice President of Sales and\nMarketing Scania, Senior Vice President of\nScania Trucks, Export Director of Scania\nSouth Africa\nOther assignments:\nBoard Member\nElectrolux AN, Saab AB, Creades AB\nPrevious assignments in the past five years:\nBoard Member of Scania AB, the Association\nof Swedish Engineering Industries and The\nConfederation of Swedish Enterprise\nShareholding 56,819 shares of series B\nIndependent of the company, its\nmanagement and major shareholders","erik huggers":"Born in 1973\nMember of the Board since 2021\nEducation: B.Sc. (Business Economics &\nMarketing) Work experience:\nPresident & CEO VEVO\nLLC, SVP Verizon Communications,\nPresident Intel Media Inc., Executive Director\nBritish Broadcasting Corporation, Senior\nDirector Microsoft Corporation\nOther assignments:\nSupervisory Board\nmember at ProsiebenSat.1 Media SE,\nSupervisory Board Member at Wetransfer\nB.V.\nPrevious assignments in the past five years: -\nShareholding Independent of the company, its\nmanagement and major shareholders","ola rollén":"Born in 1965\nPresident and Chief Executive Officer since\nMember of the Board since 2000\nEducation: B.Sc. (Economics)\nWork experience:\nPresident of Sandvik\nMaterials Technology and Kanthal,\nExecutive Vice President of Avesta-Sheffield\nOther assignments:\nBoard Member of\nGreenbridge Investment Partners Ltd.\nPrevious assignments in the past five years: -\nShareholding 502,075 shares of series B\nIndependent of major shareholders","märta schörling andreen":"Born in 1984\nMember of the Board since 2017\nEducation: B.Sc. (Economics)\nWork experience:\nBrand and innovation\nconsultant at Pond Innovation & Design\nOther assignments:\nBoard Member of\nMelker Schörling AB, Hexpol AB, AAK AB and\nAbsolent Group\nPrevious assignments in the past five years: -\nShareholding series A and 466,256,440 shares of series B\nthrough Melker Schörling AB\nIndependent of the company and its\nmanagement","sofia schörling högberg":"Born in 1978\nMember of the Board since 2017\nMember of the Audit Committee and the\nRemuneration Committee\nEducation: B.Sc. (Economics)\nWork experience:\nTrademark consultant at\nEssen International\nOther assignments:\nVice Chair of Melker\nSchörling AB, Board Member of Securitas AB\nand Assa Abloy AB\nPrevious assignments in the past five years:\nShareholding series A and 466,256,440 shares of series B\nthrough Melker Schörling AB\nIndependent of the company and its\nmanagement","patrick söderlund":"Member of the Board since 2020\nEducation: - Work experience:\nPresident of Embark\nStudios AB, DICE AB, various positions at\nElectronic Arts\nOther assignments:\nChair of Embark\nStudios AB, Board Member of Market Art\nFair Intressenter AB, Fractal Gaming Group\nAB, Ortalis Group AB and Nexon Co. Ltd.\nPrevious assignments in the past five years:\nBoard Member of BIMobjects AB, Peltarion\nAB and DICE AB\nShareholding 34,615 shares of series B\nIndependent of the company, its\nmanagement and major shareholders","brett watson":"Born in 1980\nMember of the Board since 2021\nEducation: B.Sc., MBA (Finance)\nWork experience:\nPresident of Koch Equity\nDevelopment (KED), Senior Managing\nDirector KED's Principal Investment Team,\nvarious positions in investment banking,\nprincipal investment and private equity\nOther assignments:\nBoard Member at Infor,\nHexagon AB, Getty Images, Transaction\nNetwork Services, Globus Group, MI\nWindows and Doors and the Flint Group\nPrevious assignments in the past five years:\nBoard Member ADT Inc. and Solera Holdings\nInc. Shareholding Independent of the company, its\nmanagement and major shareholders\n1) Shareholdings based on information per 25\nMarch 2022 and also include related-party\nholdings John Brandon\nUlrika Francke\nHenrik Henriksson\nOla Rollén\nMärta Schörling Andreen\nSofia Schörling Högberg\nGun Nilsson\nErik Huggers\nPatrick Söderlund\nBrett Watson"},"group management":{"ola rollén":"Born in 1965\nPresident and Chief Executive Officer\nsince 2000 Employed since 2000\nEducation: B.Sc. (Economics)\nWork experience:\nPresident at\nSandvik Materials Technology and\nKanthal, Executive Vice President at\nAvesta-Sheffield Other assignments:\nBoard Member of\nGreenbridge Investment Partners Ltd.\nPrevious assignments in the past five years: -\nShareholding 502,075 shares of series B","robert belkic":"Born in 1970\nChief Financial Officer and Executive Vice\nPresident Employed since 2009\nEducation: B.Sc. (Business Administration\nand Economics)\nWork experience:\nGroup Treasurer at\nHexagon AB, Group Treasurer at EF\nEducation First Ltd. and Assistant Group\nTreasurer at Autoliv Inc.\nOther assignments:\nPrevious assignments in the past five years:\nShareholding","burkhard böckem":"Born in 1971\nChief Technology Officer\nEmployed since 2001\nEducation: Ph.D. (Technology), M.Sc.\n(Geodesy) Work experience:\nCTO Geosystems division,\nvarious R&D manager positions within\nManufacturing Intelligence division\nOther assignments:\nPrevious assignments in the past five years:\nShareholding","kristin christensen":"Born in 1971\nChief Marketing Officer\nEmployed since 2004\nEducation: B.Sc., MBA (Marketing)\nWork experience:\nVice President of\nCorporate Communications Hexagon AB,\nvarious marketing management positions\nat Intergraph Corporation, Solution 6 North\nAmerica and other software companies\nOther assignments:\nPrevious assignments in the past five years:\nShareholding","jürgen dold":"Born in 1962\nPresident, GSI\nEmployed since 1995\nEducation: Ph.D., M.Sc. (Engineering)\nWork experience:\nPresident Hexagon\nGeosystems, Academic Counsel and\nAssistant Professor at the Technical\nUniversity of Braunschweig in Germany\nand various management positions within\nLeica Geosystems AG\nOther assignments: Member of the Board\nof UTZ Group\nPrevious assignments in the past five years:\nShareholding 210,000 shares of series B","paolo guglielmini":"Born in 1977\nPresident, Manufacturing Intelligence\ndivision Employed since 2010\nEducation: M.Sc., MBA (Engineering)\nWork experience:\nChief Executive Officer\nMSC Software, Executive Vice President\nGlobal Business Development at\nManufacturing Intelligence, Project Lead\nCERN, Business Analyst Accenture\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 13,231 shares of series B","norbert hanke":"Born in 1962\nChief Operating Officer\nEmployed since 2001\nEducation: Diploma of Business\nAdministration Work experience:\nPresident Manufacturing\nIntelligence division, Chief Financial\nOfficer at Brown & Sharpe and various\npositions within the Kloeckner Group\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 158,424 shares of series B","li hongquan":"Born in 1966\nVice President and President of China\nRegion Employed since 2001.\nEducation: M.Sc. (Engineering)\nWork experience:\nPresident of Qingdao\nBrown & Sharpe and Qianshao Technology\nCo. Ltd. Various positions in the Chinese\nmanufacturing industry\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 840,000 shares of series B","maria luthström":"Born in 1982\nHead of Sustainability and Investor\nRelations Employed since 2015\nEducation: M.Sc. (Business & Economics)\nWork experience:\nHead of Investor relations\nat Hexagon, various managing positions in\nInvestor Relations and communications at\nAxel Johnson AB and Axfood AB\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 665 shares of series B","ben maslen":"Born in 1972\nChief Strategy Officer\nEmployed since 2017\nEducation: B.Sc. (Economics & Politics) and\nChartered Accountant\nWork experience:\nCo-head of European\ncapital goods equity research Morgan\nStanley and equity analyst at BoAML\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 7,000 shares of series B","michael ritter":"Born in 1963\nPresident, Autonomy & Positioning\ndivision Employed since 2009\nEducation: M.Sc. (Engineering)\nWork experience:\nStaff and management\npositions at Schlumberger Oilfield\nServices and Trimble Inc.\nOther assignments:\nPrevious assignments in the past five years:\nShareholding","mattias stenberg":"Born in 1977\nPresident, PPM division\nEmployed since 2009\nEducation: B.Sc. (Economics)\nWork experience:\nChief Strategy Officer\nand Vice President of Strategy and\nCommunications at Hexagon AB, various\nInvestor Relations positions at Teleca AB\nand Autoliv Inc.\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 42,000 shares of series B\nTony Zana\nBorn in 1979\nGeneral Counsel and Chief Compliance\nOfficer Employed since 2008\nEducation: D.Jur. (Law), B.Sc.\n(Management Information Systems)\nWork experience:\nDeputy General Counsel\nat Hexagon, Vice President, General\nCounsel and Corporate Secretary at\nIntergraph Corporation, Attorney at\nMaynard, Cooper & Gale, Law Clerk at U.S.\nDistrict Court\nOther assignments:\nPrevious assignments in the past five years:\nShareholding 1) Shareholdings based on information per 25\nMarch 2022 and also include related-party\nholdings Ola Rollén\nRobert Belkic\nBurkhard Böckem\nKristin Christensen\nJürgen Dold\nPaolo Guglielmini\nNorbert Hanke\nLi Hongquan\nMaria Luthström\nBen Maslen\nMichael Ritter\nMattias Stenberg\nTony Zana"},"managing risks":{"data":"Hexagon's risk management activities are designed to identify, control and reduce risks\nassociated with its business. The majority of these activities are managed within each\nsubsidiary of Hexagon. However, certain legal, strategic, sustainability and financial risks\nare managed at the Group level.","market risk management":{"data":"Market risks concern risks such as economic trends, competition and risks related to\nacquisitions and integration. Market risks are primarily managed within each subsidiary\nof Hexagon.\nRisk","acquisitions and integration":"Risk management\nAn important part of Hexagon's current and future growth\nstrategy is to actively pursue strategic acquisitions of companies\nand businesses. It cannot be guaranteed, however, that Hexagon\nwill be able to find suitable acquisition targets, nor can it be\nguaranteed that the necessary financing for future acquisition\ntargets can be obtained on terms acceptable to Hexagon, or at all.\nA lack of acquisition financing or suitable acquisition targets may\nlead to a decreasing growth rate for Hexagon.\nAcquisitions entail risk. The acquired entities' relations with\ncustomers, suppliers and key personnel may be negatively\naffected by the acquisition. There is also a risk that integration\nprocesses may prove more costly or more time consuming than\nestimated and that anticipated synergies in whole or in part fail\nto materialise. An acquisition of a company that is not conducting\nits business in a sustainable way or in compliance with Hexagon's\nCode of Business Conduct and Ethics may have a negative impact\non Hexagon's reputation.","impact of the economy and financial markets":"Hexagon monitors many companies to find acquisitions that\ncan strengthen the Group's product portfolio or improve its\ndistribution network. Potential targets are regularly evaluated\nbased on financial, technology and commercial grounds. Every\nacquisition candidate's potential place in the Group is determined\nbased on synergy simulations and implementation strategies.\nEvery effort to complete a thorough due diligence is made in order\nto evaluate potential risks.\nFrom 2000 to date, Hexagon completed more than 170\nacquisitions. Based on its extensive experience in acquisitions\nand integration and clear strategies and goals, Hexagon is\nstrongly positioned to successfully integrate acquired companies\ninto the Group. In Hexagon's standard due diligence process, a\nnumber of sustainability elements are included, such as detailed\nconsideration about the internal controls of the target company,\nquality business practices, environmental matters, employee\nmatters, ISO (International Organisation for Standardisation),\nLEED (Leadership in Energy and Environmental Design) or other\nindustry certifications, and anti-corruption/FCPA (Foreign Corrupt\nPractices Act) and export controls. Hexagon also evaluates\nwhether target companies are following a robust code of conduct\nand whether the target companies' corporate responsibility and\nsustainability programmes are effective.\nHexagon engages in worldwide operations that are dependent\non global economic and financial market conditions, as well\nas conditions that are unique to certain countries or regions.\nGeneral economic and financial market conditions affect the\ninclination and the capabilities of Hexagon's existing and potential\ncustomers to invest in design, measurement and visualisation\ntechnologies. Weak macroeconomic conditions globally or in part\nof the world may therefore result in lower market growth that falls\nbelow expectations and lower revenues for Hexagon.\nThe ongoing Covid-19 pandemic has caused significant disruption to\nthe global economy, including in all of the regions in which Hexagon,\nits suppliers, distributors, business partners and customers do\nbusiness and in which Hexagon's workforce is located. The Covid-19\npandemic and efforts to manage it, including those by governmental\nauthorities, have had, and could continue to have, significant\nimpacts on global markets. New variants, uncertainty about the\nlong-term consequences of the Covid-19 pandemic for important\nHexagon customer industries, and an increase of raw material and\nintermediate goods costs could impact Hexagon's sales potential\nand cost structure. While the duration and severity of those impacts\non Hexagon's business are highly uncertain, they have had, and\ncould continue to have, an adverse effect on the business, financial\ncondition and results of operations in many ways.\nHexagon's business is widely spread geographically, with a broad\ncustomer base within numerous market segments. Potential\nnegative effects of a downturn in the developed world may, for\nexample, be partially off-set by growth in emerging markets and\nvice-versa. While Hexagon have developed and continue to develop plans\nintended to help mitigate the negative impact of the pandemic\non the business, a protracted economic downturn may limit the\neffectiveness of those mitigation efforts.\nRisk","geopolitical risks":"Risk management\nUnderstanding geopolitical risk, how geography and economics\ninfluence politics and the relations between countries, is\nimportant in a world that has become more closely intertwined\ndue to the rise of globalisation.\nCurrent geopolitical risks include the current crisis in Ukraine\nresulting from the invasion of the region by Russian forces and\nthe corresponding global sanctions now facing Russian business,\npolitical and economic uncertainty surrounding the vulnerability\nof the interconnected global economy to pandemics and the\npotential for further escalation of the trade issues between the\nUS and China.\nUnderstanding how these geopolitical risks may affect Hexagon's\norganisation, operating results and strategies is critical to\nmaking accurate projections about Hexagon's future growth and\nprofitability. However, what impact the Ukraine crisis, pandemics\nand/or an escalating trade war between the US and China will\nhave on world trade and the global markets, and the demand for\nHexagon's products, over the coming years is still fairly uncertain\nand will to some extent depend upon resolution of any crises and\nwhether agreements regarding access to the markets can be\nsettled.","competition and price pressure":"In order to eliminate risks that may occur due to geopolitics, such as\nsanctions and/or global perception and reputational risk resulting\nfrom doing business in Russia in response to the Ukraine crisis,\ndisruption to international commerce or the global economy,\nHexagon is following developments closely while evaluating\ndifferent strategies in order to prepare for and handle possible\nscenarios that may affect Hexagon's organisation and the ability to\ndo business in different parts of the world in the near term and over\nthe coming years.\nParts of Hexagon's operation are carried out in sectors which\nare subject to price pressure and rapid technological change.\nHexagon's ability to compete in the market by introducing new\nand successful products with enhanced functionality while\nsimultaneously cutting costs on new and existing products is of\nthe utmost importance in order to avoid erosion of market share.\nOther inherent risks exist with competitors, such as consolidation\nor entry into Hexagon's markets by companies with significant\nresources. R&D efforts are costly and new product development\nalways entails a risk of unsuccessful product launches\nor commercialisation, which could have material adverse\nconsequences on Hexagon. Further, technological innovation and\nchanging trends, such as disruptive technologies, supply chains,\nnew market entrants or novel business models, creates inherent\nrisks that are difficult to foresee.\nHexagon invests annually approximately 10-13 per cent of its net\nsales in R&D. In total almost 5,000 employees are engaged in\nR&D at Hexagon. The objectives for Hexagon's R&D division are\nto transform customer needs into products and services and to\ndetect market and technology opportunities early on. Introducing\nnew products and technologies requires active intellectual\nproperty management to secure Hexagon's technological\nposition."},"operational risk management":{"data":"Operational risks concern risks related to reception of new products and services,\ndependence on suppliers and risks related to human capital. Since the majority of\noperational risks are attributable to Hexagon's customer and supplier relations, ongoing\nrisk analyses of customers and suppliers are conducted to assess business risks.\nOperational risks are primarily managed within each subsidiary of Hexagon.\nRisk","customers":"Risk management\nHexagon's business activities are conducted in a large number\nof markets with multiple customer categories. In 2021, Surveying\nwas the single largest customer category and accounted for\n20 per cent of net sales. For Hexagon, this customer category\nmay involve certain risks as a downturn or weak development in\nthe surveying sector can have a negative impact on Hexagon's\nbusiness. Surveying is followed by customer categories\nElectronics and Manufacturing with 17 per cent, Infrastructure\nand Construction with 15 per cent and 10 per cent and Power\nand Energy with 12. Changing demand of Hexagon's customers is\npossible as technology needs and consumption change over time.\nHexagon may face risks, including reputational risks, of expending\ncapital and resources in generating new business in Russia while\nthe Ukraine crisis is ongoing and/or if customers are misusing the\ncompany's products in ways that negatively impact human rights.\nFurther, due to the Covid-19 pandemic, delays, cancellations, or\nchanges to user and industry conferences and other marketing\nevents relating to Hexagon's solutions, including its own customer\nand partner events, may negatively impact the ability to obtain\nnew and retain existing customers, and effectively market\nHexagon's solutions.","suppliers":"Hexagon has a favourable risk diversification in products and\ngeographical areas, and no single customer or customer category\nis decisive for the Group's performance. The largest customer\nrepresents approximately 1 per cent of the Group's total net\nsales. Credit risk in customer receivables accounts for the\nmajority of Hexagon's counterparty risk. Hexagon believes there\nis no significant concentration of counterparty risk. Further,\nin response to the Ukraine crisis, Hexagon has suspended\nnew business in Russia. If any services are required to support\nand maintain those Russian customers who are not subject to\nsanctions, Hexagon will continue to provide such minimal support\nactivities. Hexagon's compliance programme addresses all principles\ncontained in the Code of Business Conduct and Ethics, including\nexport controls. Hexagon is committed to complying with\nappropriate export controls, and the company's compliance\nefforts aim to safeguard peace and security by preventing the\nunlawful trading of items (i.e., goods, software or technology)\nor diversion to destinations where they may be used for illegal\npurposes. Hexagon's hardware products consist of components from\nseveral different suppliers. To be in a position to sell and deliver\nsolutions to customers, Hexagon is dependent upon deliveries\nfrom third parties in accordance with agreed requirements\nrelating to, for example, quantity, quality and delivery times.\nErroneous or default deliveries by suppliers can cause delay\nor default in Hexagon's deliveries, which can result in reduced\nsales. Supply chain, transportation and logistics availability\nare increasingly difficult and costly due primarily to Covid-19\npandemic related factors and shortages. Further, Hexagon uses\nsubcontractors, distributors, resellers and other representatives.\nHexagon may face risks, including reputational risks, if suppliers\nare operating in ways that negatively impact human rights. The\nCovid-19 pandemic temporarily resulted in an inability to meet\nin person or otherwise effectively communicate with current or\npotential vendors, suppliers, and partners, which may negatively\naffect current and future relationships with such vendors,\nsuppliers, and partners and Hexagon's ability to generate demand\nfor solutions.\nIf there were to be unmanaged negative impacts following a\nsupplier's noncompliance with Hexagon's Code of Business\nConduct and Ethics and/or Hexagon's Supplier Code of Conduct,\nit may result in reputational risks for Hexagon.","production and distribution units":"Hexagon has a favourable risk diversification, and no single\nsupplier is decisive for the Group's performance. The largest\nsupplier accounted for approximately 1 per cent of Hexagon's\ntotal net sales in 2021. To minimise the risk of supply shortages\nor of excessive price variations among suppliers, Hexagon works\nactively to coordinate sourcing within the Group and to identify\nalternative suppliers for strategic components. Supplier risk\nsurveys are performed (by Hexagon's external partner) in order\nto identify and mitigate risks associated with the suppliers'\noperations. Hexagon also has a sustainability risk assessment and supplier\naudit process in place, including handling the risk of breaches in\nhuman rights. Hexagon has a compliance programme in place for\nsuppliers to manage social and ethical risks. Hexagon regularly\nconducts supplier audits to ensure suppliers are compliant\nwith the Hexagon's Code of Business Conduct and Ethics and\nHexagon's Supplier Code of Conduct.\nHexagon's production and distribution units are exposed to risks\n(fire, explosion, natural hazards, machinery damages, cyber\nthreats, infrastructure failures, power outages, etc.) that could\nlead to property damage and business interruption. This risk is\nfurther accentuated by climate change, which has a direct impact\non the frequency and severity of these events.\nRisk grading surveys are performed (by Hexagon's external\npartner) in order to identify and mitigate risks as well as support\nlocal management in their loss prevention work. Surveys are\nconducted with each subsidiary in accordance with a long-term\nplan. Hexagon has implemented ISO 9001 at the majority of the\nlargest production sites.\nRisk","human capital":"Risk management\nThe resignation of key employees or Hexagon's failure to attract\nskilled and diverse personnel to all different levels within\nthe organisation may have an adverse impact on the Group's\noperations. Further, maintaining Hexagon's company culture is\ncritical to attracting and retaining top talent.\nHexagon's workforce was and continues to be in various parts\nof its organisation, unable or unwilling to work on-site or travel\nas a result of event cancellations, facility closures, shelter-in-\nplace, travel and other restrictions and changes in industry\npractice due to the Covid-19 pandemic, or if they, their co-workers\nor their family members become ill or otherwise require care\narrangements. These workforce disruptions have adversely\naffected and could continue to adversely affect Hexagon's\nability to operate, including to develop, manufacture, generate\nsales of, promote, market and deliver hardware and software\nproducts, solutions and services, and provide customer support.\nAdoption of new laws or regulations, or changes to existing laws\nor regulations, that may be imposed as a result of the Covid-19\npandemic, may cause risks in the company's ability to hire and\nretain skilled professionals.","environment":"Since future success is largely dependent on the capacity to\nretain, recruit and develop skilled staff, being an attractive\nemployer to both potential and existing employees is an\nimportant success factor for Hexagon. Group and business\narea management jointly handle risks associated with human\ncapital. Hexagon works with a structured approach to HR and\nmarket-based remuneration to ensure employee satisfaction.\nHexagon uses employee engagement as the overall measure in\nthe employee survey.\nIn order to attract skilled employees, Hexagon cooperates with\nmultiple universities and colleges around the world, aiming at\ntraining and hiring students with industry-ready skills.\nHexagon provides sensors, software and data to its customers.\n60 per cent of the revenues are from software and services.\nHexagon does not operate any business that require carbon\ncredits. However, stricter regulation of environmental matters\ncan result in increased costs or further investments for the\ncompanies within Hexagon which are subject to such regulation.\nClimate change can result in natural disasters and increase the\nrisk of physical damage on assets and supply shortages. Hexagon\nis impacted by such legislation in a manner similar to other\ncompanies operating in these fields.","business ethics and corruption":"Hexagon believes that it is in material compliance with all\napplicable laws and obligations and obtains relevant approvals\nwhere needed. Hexagon continuously monitors anticipated and\nimplemented changes in legislation in the countries in which\nit operates. Hexagon routinely assesses the risk of climate\nchange on its operations as part of its Insurance Programme.\nHexagon has implemented ISO 14001 at the majority of the\nlargest production sites and has implemented a sustainability\nprogramme to reduce its carbon impact in its own operations and\nin its value chain.\nCorruption negatively impacts communities and overall global\neconomic development and erodes the trust necessary to build\na stable business environment. Additionally, businesses such\nas Hexagon may be held liable for the corrupt actions taken by\nemployees, strategic or local partners or other representatives. If\nHexagon or its intermediaries fail to comply with anti-corruption\nlaws, governmental authorities could seek to impose civil and/or\ncriminal fines and penalties which could have an adverse effect\non Hexagon's business. For Hexagon, anti-corruption compliance\nis of utmost importance, as it helps Hexagon advance its financial\ninterests and brand value.","cyber risks and data protection":"Hexagon has a robust Code of Business Conduct and Ethics and\nAnti-Corruption Compliance Programme in place, covering the\nentire Group, including policies, processes and training. The anti-\ncorruption compliance documents include policies in such areas\nas gifts and entertainment (both to and from third parties), hiring\ncandidates with government connections and engaging in and\ntransacting business with third parties.\nHexagon relies on IT systems in its operations. Disruptions or\nfaults in critical systems may have a negative impact on Hexagon's\noperations, including impact on production, Hexagon's tangible\nand intellectual property and, in some cases, the intellectual\nproperty and operations of external parties. The Covid-19\npandemic has presented security challenges as employees and\nthose of Hexagon's partners, customers and service providers\nwork remotely from non-corporate managed networks during the\nongoing Covid-19 pandemic and potentially beyond.\nIncidents may also lead to data privacy infringements such as\nunauthorised access, leakage or loss of data. Data security and\nintegrity are critical issues for the Hexagon Group. Under the\nGDPR, and other analogous legislation in various jurisdictions,\nand ePrivacy regulations, Hexagon has firm legal requirements\nto protect against personal information (PI) data breaches. The\nregulations extend to all vendors that Hexagon uses to collect,\nstore and process PI data on its behalf. In China, there is a similar\nlaw recently adopted to protect various data types, including PI\ndata. It is critical for Hexagon to protect and secure all data as the\ncosts of remediating a serious breach are high and can also be\ndamaging to Hexagon's reputation.\nCyber security risks are increasing in society in general and\nHexagon works continuously to keep the company's IT systems\nprotected. In addition, Hexagon invests in enhanced disaster\nrecovery and data storage capabilities, cyber security expertise,\nand adequate insurance protection. Hexagon also mitigates\nIT-related risks through contracts with external parties.\nHexagon has mandated that all divisions must implement a\nrecognised cybersecurity framework. Hexagon has set the\nminimum standard of implementing the NIST-800171 framework\nas the entry-level approach. Divisions will assess their needs as\nthey relate to customer requirements and may need to implement\nmore stringent frameworks such as ISO27001/NIST-800-53."},"financial risk management":{"data":"Financial risks are managed at the Group level. The Group Treasury Policy, which is\nupdated and approved annually by the Board of Directors, stipulates the rules and\nlimitations for the management of financial risks throughout the Group. Hexagon's\ninternal bank coordinates the management of financial risks and is also responsible for\nthe Group's external borrowing and internal financing. Additional financial risks include,\nbut are not limited to, the risks of varying business results, seasonal variation, and\nchanges to accounting principles (or application thereof).\nRisk","currency":"Risk management\nHexagon's operations are mainly conducted internationally.\nDuring 2021, total operating earnings, excluding non-recurring\nitems, from operations in currencies other than EUR amounted\nto an equivalent of 975.1 MEUR (808.2). Of these currencies, CHF,\nCNY and USD have the biggest impact on Hexagon's earnings and\nnet assets. Currency risk is the risk that currency exchange rate\nfluctuations will have an adverse effect on the income statement,\nbalance sheet or cash flow.\nSales and purchases of goods and services in currencies other\nthan the subsidiary's functional currency give rise to transaction\nexposure. Translation exposure arises when the income statement and\nbalance sheet are translated into EUR. The balance sheet\ntranslation exposure might substantially affect other compre-\nhensive income negatively. Furthermore, the comparability of\nHexagon's earnings between periods is affected by changes in\ncurrency exchange rates. The income statement translation\nexposure is described in the table below for the currencies\nhaving the largest impact on Hexagon's earnings and net assets,\nincluding the effect on Hexagon's operating earnings in 2021.\nNet of income\nMovement1 and cost\nProfit impact\nCHF Weakened -1%\nNegative Positive USD Weakened -4%\nPositive Negative CNY Strengthened 3% Positive EBIT1, MEUR\n1) Compared to EUR and 2020","interest":"Hexagon's reporting currency is EUR, which has a stabilising\neffect on certain key ratios that are of importance to Hexagon's\ncost of capital.\nAs much as possible, currency transaction exposure is\nconcentrated in the countries where the manufacturing entities\nare located. This is achieved by invoicing the sales entities in their\nrespective functional currency by the manufacturing entities.\nAccording to the Group's financial policy, currency transaction\nexposure should not be hedged using external financial\ninstruments. The rationale for this is that the vast majority of\ntransactions entail a short period of time from order to payment.\nMoreover, a transaction hedge only postpones the effect of a\nchange in currency rates.\nThe translation exposure can be mitigated by denominating\nborrowings in the same currency as the corresponding net assets.\nBut in order to have the volatility in net debt at an acceptable\nlevel, currently the majority of the borrowings is denominated\nin EUR.\nThe interest rate risk is the risk that changes in market interest\nrates will adversely affect the Group's net interest expense\nand/or cash flow. Interest rate exposure arises primarily from\noutstanding loans. The impact on the Group's net interest\nexpense depends, among other things, on the average interest\nrate for borrowings.\nIn accordance with the Group Treasury Policy, the average interest\nrate duration of the external debt is to be between 6 months and\n3 years. During the year, interest rate derivatives were used to\nmanage the interest rate risk.\nRisk","credit":"Risk management\nCredit risk, i.e., the risk that customers may be unable to fulfil\ntheir payment obligations, accounts for the majority of Hexagon's\ncounterparty risk.\nFinancial credit risk is the exposure to default of counterparties\nwith which Hexagon has invested cash or with which it has entered\ninto forward exchange contracts or other financial instruments.","liquidity":"Through a combination of geographical and industry diversification\nof customers, the risk for significant credit losses is reduced.\nTo reduce Hexagon's financial credit risk, surplus cash is only\ninvested with a limited number of approved banks and derivative\ntransactions are only conducted with counterparties where an\nISDA (International Swaps and Derivatives Association) netting\nagreement has been established. As Hexagon is a net borrower,\nexcess liquidity is primarily used to repay external debt and\ntherefore the average surplus cash invested with banks is kept as\nlow as possible.\nLiquidity risk is the risk of not being able to meet payment\nobligations in full as they become due or only being able to do so at\nmaterially disadvantageous terms due to lack of cash resources.","refinancing":"The Group Treasury Policy states that the total liquidity reserve\nshall at all times be at least 10 per cent of forecasted annual net\nsales. At year-end 2021, cash and unutilised credit limits totalled\nRefinancing risk refers to the risk that Hexagon does not have\nsufficient financing available when needed to refinance maturing\ndebt, because existing lenders decline to provide additional credit\nor difficulties arise in procuring new lines of credit at a given point\nin time. Hexagon's ability to satisfy future capital needs is to a\nlarge degree dependent on successful sales of the company's\nproducts and services. There is no guarantee that Hexagon will be\nable to generate necessary capital from sales or from third party\nfinancing arrangements. In this regard, the general development\nof the capital and credit markets is also of major importance.\nHexagon, moreover, requires sufficient financing in order to\nrefinance maturing debt. Securing these requirements demands\na strong financial position of the Group, combined with active\nmeasures to ensure access to credit. There is no guarantee that\nHexagon will be able to raise sufficient funds in order to refinance\nmaturing debt.","insurable risk":"In order to ensure that appropriate financing is in place and to\ndecrease refinancing risk, no more than 20 per cent of the Group's\ngross debt, including committed credit facilities, is allowed to\nmature within the succeeding 12 months unless replacement\nfacilities have been entered into.\nHexagon's main sources of financing consist of:\n- A multicurrency revolving credit facility (RCF) established during\n2021. The RCF amounts to 1,500 MEUR with a tenor of 5+1+1\nyears. - A Swedish Medium-Term Note Programme (MTN) established\nduring 2014. The MTN programme amounts to 20,000 MSEK\nand gives Hexagon the option to issue bonds with tenors of up\nto 6 years.\n- A Swedish Commercial Paper Programme (CP) established\nduring 2012. The CP programme gives Hexagon the option to\nissue commercial paper for a total amount of 15,000 MSEK with\ntenor up to 12 months.\nHexagon's operations, assets and staff are to a certain degree\nexposed to various risks of damages, losses and injuries which\ncould tentatively threaten the Group's business continuity,\nearnings, financial assets and personnel.\nTo ensure a well-balanced insurance coverage and financial\neconomies of scale, Hexagon's insurance programme includes,\namong other things, group-wide property and liability insurance,\ntravel insurance, errors and omissions insurance and transport\ninsurance, combined with local insurance coverage wherever\nneeded. The insurance programme is periodically amended so\nthat owned risk and insured risk are optimally balanced."},"legal risk management":{"data":"Legal risks are primarily managed within each subsidiary of Hexagon. The Group legal\nfunction supports the subsidiaries and manages certain legal risks at the Group level.\nRisk","legislation and regulation":"Risk management\nHexagon's main markets are subject to extensive regulation.\nHexagon's operations may be affected by regulatory changes,\nchanges to customs duties and other trading obstacles, and\npricing and currency controls, as well as other government\nlegislation and restrictions in the countries where Hexagon is\nactive. For example, more stringent regulations have been passed\nor are being developed in several jurisdictions, causing increased\nresponsibilities for companies regarding the privacy and\nprocessing of personal data. These changing requirements and\nmore stringent rules impose a risk of non-compliance with these\ndata protection regulations, which could result in substantial\nlegal fees and damage to Hexagon's reputation. Additional areas\nof regulatory uncertainty include laws and regulations related\nto environmental sustainability (including climate change). For\nexample, new laws and regulations in response to climate change\ncould result in increased energy efficiency for Hexagon's products\nand increased compliance and energy costs.","intellectual property rights":"Hexagon closely monitors legislation, regulations and applicable\nordinances in each market and seeks to adapt the business to\nidentified future changes in each market. To manage country-\nspecific risks, Hexagon observes local legislation and monitors\npolitical developments in the countries where the Group conducts\noperations. To this effect, Hexagon has adopted a worldwide\ncompliance programme across the Group to ensure that its\nsubsidiaries at all times comply with all applicable legislation,\nrules and ordinances. Further, with respect to the Ukraine crisis,\nHexagon will continue complying with all applicable export control\nrestrictions and sanctions laws relevant to our operations and\nwith the rules of ethics and international standards.\nIntellectual property infringement and plagiarism by third parties\nare risks to which Hexagon is exposed. There is no guarantee that\nHexagon will be able to protect obtained patents, trademarks and\nother intellectual property rights or that submitted applications\nfor registration will be granted. Furthermore, there is a risk\nthat new technologies and products are developed which\ncircumvent or replace Hexagon's intellectual property rights.\nInfringement disputes can, like disputes in general, be costly and\ntime consuming and may therefore adversely affect Hexagon's\nbusiness. Additionally, third parties may assert that Hexagon's\nproducts infringe their intellectual property rights.\nTax Hexagon seeks to protect its technology innovations to safeguard\nthe returns on the resources that Hexagon assigns to R&D.\nThe Group strives to protect its technical innovations through\npatents and protects its intellectual property rights through legal\nproceedings when warranted. Such intellectual property rights\ncan generally only be enforced in jurisdictions that have granted\nsuch protections or recognise these rights.\nHexagon operates through subsidiaries in a number of jurisdictions\nand all cross-border transactions are normally a tax risk because\nthere are no global transfer pricing rules. Local tax authorities\nfollow their own local transfer pricing rules and authorities interpret\ntransfer pricing guidelines differently. Hexagon frequently interacts\nwith local taxing authorities and frequently has several ongoing tax\naudits in progress.\nHexagon's interpretation of prevailing tax law, tax treaties,\nOECD guidelines and agreements entered into with foreign\ntax authorities may be challenged by tax authorities in some\ncountries. Rules and guidelines may also be subject to future\nchanges which can have an adverse effect on the Group's tax\nposition. Furthermore, a change in the business or part of the\nbusiness can have an impact on agreements entered into with\ntax authorities in some tax jurisdictions.\nThe tax rate may increase if large acquisitions are made in high\ntax jurisdictions or if the corporate tax rates change in countries\nwhere Hexagon carries out substantial business.\nTransactions between Group companies are carried out in\naccordance with Hexagon's interpretation of prevailing tax laws,\ntax treaties, OECD's guidelines and agreements entered into\nwith foreign tax authorities. Risks are also presented by new\naccounting rules or interpretations by the applicable governing\nbodies."}},"financial reports":"","consolidated income statement":"MEUR Note Gross earnings\nCapital gain from sale of shares in group companies\nFinancial income and expenses\nNet earnings\nAttributable to:\nParent company shareholders\nNon-controlling interest\nEarnings include depreciation, amortisation and impairment of\n-of which amortisation of surplus values\nAverage number of shares after dilution, thousands\nEarnings per share, Euro cent\nEarnings per share after dilution, Euro cent","consolidated statement of comprehensive income":"MEUR Note Net earnings\nOther comprehensive income:\nItems that will not be reclassified to income statement\nTax attributable to items that will not be reclassified to income statement\nTotal items that will not be reclassified to income statement, net of tax\nItems that may be reclassified subsequently to income statement\nExchange rate differences\nTax attributable to items that may be reclassified subsequently to income statement:\nTax attributable to effect of translation differences\nTotal items that may be reclassified subsequently to income statement, net of tax\nOther comprehensive income, net of tax\nTotal comprehensive income\nAttributable to:\nParent company shareholders\nNon-controlling interest","consolidated balance sheet":{"assets":"Fixed assets\nTangible fixed assets\nDeferred tax assets\nTotal fixed assets\nCurrent assets\nInventories Other receivables - interest bearing\nTotal current assets","total assets shareholders' equity and liabilities":"Shareholders' equity\nOther capital contributions\nRevaluation reserve\nTranslation reserve\nRetained earnings\nShareholders' equity attributable to Parent company shareholders\nNon-controlling interest\nTotal shareholders' equity\nLong-term liabilities\nOther provisions\nDeferred tax liabilities\nTotal long-term liabilities\nCurrent liabilities\nAccounts payable\nOther provisions\nTotal current liabilities\nTOTAL SHAREHOLDERS' EQUITY AND LIABILITIES"},"consolidated statement of changes in equity":"Share capital Other capital\ncontributions Revaluation reserve Translation Retained earnings Shareholders' equity\nattributable to parent\ncompany shareholders\nNon- controlling interest Total share-\nholders' equity\nOpening shareholders'\nequity, 2020-01-01\nTransactions with non-controlling\nClosing shareholders'\nTransactions with non-controlling\nAcquisition of non-controlling\nClosing shareholders'\nShare capital\nis described in detail in Note 21.\nOther contributed capital\nincludes, among others, premium reserves and statutory reserves.\nThe revaluation reserve\nrelates to fair value adjustments related to financial assets measured at fair value through other comprehen-\nsive income\nThe translation reserve\nis the net of currency translation differences related to foreign subsidiaries and the effect after tax of the cur-\nrency hedging of net assets made in foreign subsidiaries.\nRetained earnings\ninclude all historical net earnings after tax excluding non-controlling interest less dividends paid, including remea-\nsurements of pensions posted in other comprehensive income.\nNon-controlling interest\nare the shares of equity that pertain to non-controlling interest (minority) in certain subsidiaries.","consolidated statement of cash flows":"Note Cash flow from operating activities\nOperating earnings\nAdjustments for items in operating earnings not affecting cash flow:\nDepreciation, amortisation and impairment\nChange in provisions\nCapital gain/loss on divestments of fixed assets\nCapital gain from sale of shares in group companies\nShare program expenses\nOther Interest received\nInterest paid\nTax paid\nCash flow from operating activities before changes in working capital\nCash flow from changes in working capital\nChange in inventories\nChange in current receivables\nChange in current liabilities\nCash flow from changes in working capital\nCash flow from operating activities1\nCash flow from ordinary investing activities\nCash flow from ordinary investing activities\nOperating cash flow\nCash flow from other investing activities\nDivestments of subsidiaries\nDivestments of financial fixed assets\nCash flow from other investing activities\nCash flow from financing activities\nDividend to parent company shareholders\nDividend to non-controlling interests in subsidiaries\nCash flow from financing activities\nCash flow for the year\nCash and cash equivalents, beginning of year\nEffect of translation differences on cash and cash equivalents\nCash flow for the year\nCash and cash equivalents, end of year2\n1) Of which non-recurring cash flow\n2) Cash and cash equivalents include short-term investments and cash and bank balances","parent company income statement":"Note Operating earnings\nFinancial income and expense\nEarnings before tax and appropriations\nAppropriations Group contribution, net\nChange in profit equalisation reserves\nEarnings before tax\nTax on earnings for the year\nNet earnings","parent company statement of comprehensive income":"Net earnings\nOther comprehensive income\nTotal comprehensive income","parent company balance sheet":{"assets":"Fixed assets\nIntangible fixed assets\nTangible fixed assets\nTotal intangible and tangible assets\nFinancial fixed assets\nOther financial fixed assets\nDeferred tax assets\nTotal financial fixed assets\nTotal fixed assets\nCurrent assets\nCurrent receivables\nReceivables from group companies\nTax receivables\nOther receivables\nPrepaid expenses and accrued income\nTotal current receivables\nCash and bank balances\nTotal current assets","total assets shareholders' equity and liabilities":"Shareholders' equity\nRestricted equity\nReserve for capitalised development expenses\nStatutory reserve\nTotal restricted equity\nNon-restricted equity\nPremium reserve\nRetained earnings\nTotal non-restricted equity\nTotal shareholders' equity\nUntaxed reserves\nTotal untaxed reserves\nProvisions Other provisions\nTotal provisions\nLong-term liabilities\nTotal long-term liabilities\nCurrent liabilities\nAccounts payable\nLiabilities to group companies\nOther liabilities\nAccrued expenses and deferred income\nTotal current liabilities\nTOTAL SHAREHOLDERS' EQUITY AND LIABILITIES"},"parent company statement of changes in equity":"Unrestricted shareholders'\nRestricted shareholders' equity\nequity Total share-\nholders' equity\nMEUR Share capital\nPaid-in, non-registered share capital\nReserve for\ncapitalised development expenses Statutory reserve Premium reserve Retained earnings Opening balance 2020-01-01\nCapitalisation of development\nCapitalisation of development","parent company statement of cash flows":"MEUR Note Cash flow from operating activities\nOperating earnings\nAdjustment for operating earnings items not affecting cash flow:\nDepreciation, amortisation and impairment\nUnrealised exchange rate gains and losses\nDividends received\nFinancial income received\nFinancial expense paid\nTax paid\nCash flow from operating activities before changes in working capital\nCash flow from changes in working capital\nChange in current receivables\nChange in current liabilities\nCash flow from changes in working capital\nCash flow from operating activities\nCash flow from investing activities\nInvestments in intangible fixed assets\nInvestments in tangible fixed assets\nChange in long-term receivables, group companies\nCash flow from investing activities\nCash flow from financing activities\nBorrowings Repayment of debt\nProvisions Dividend to shareholders\nCash flow from financing activities\nCash flow for the year\nCash and cash equivalents, beginning of year\nEffect of translation differences on cash and bank\nCash flow for the year\nCash and cash equivalents, end of year\n1) Cash and cash equivalents include cash and bank balance","notes":{"accounting policies":{"data":"The consolidated accounts of Hexagon have been prepared in accor-\ndance with the International Financial Reporting Standards (IFRS)\nissued by the International Accounting Standards Board (IASB) and\ninterpretation statements by the International IFRS Interpretation\nCommittee (IFRIC), which have been approved by the European\nCommission for application within the EU.\nFurthermore, the recommendation RFR 1 Supplementary account-\ning rules for corporate groups issued by the Swedish Financial\nReporting Board have been applied.\nThe Parent Company applies the Annual Accounts Act and the rec-\nommendation RFR 2 Accounting for legal entities. The recommenda-\ntion means that the Parent Company applies the same accounting\npolicies as the Group, except in those cases when the Annual\nAccounts Act or current tax rules limits the opportunities to apply\nIFRS. Differences between the accounting principles applied by the\nParent Company and the Group are outlined under Accounting\nPolicies in the Parent Company on the next page.\nThe accounting policies and calculation methods applied by the\nGroup are consistent with those of the previous financial year except\nas below.\nOn 29 March 2022, the Board of Directors and the President and CEO\napproved this annual report and consolidated accounts for publica-\ntion and they will be presented to the Annual General Meeting on 29\nApril 2022 for adoption.\nApplication of new and amended standards from 2021\nNew changes in standards and interpretations that entered into\nforce from 1 January 2021 are not expected to have had any mate-\nrial impact on the financial statements of Hexagon.\nApplication of new standards from 2022\nNew standards, amended standards and interpretations that\nhave not entered into force, have not been applied in advance in\nthe financial reports of Hexagon and are not expected to have any\nmaterial impact on the financial statements of Hexagon.","basis of reporting for the parent company and the group":"The functional currency of the Parent Company is EUR as is the\npresentation currency for the Parent Company and the Group.\nThe financial reports are presented in EUR. All amounts, unless\nindicated otherwise, are rounded off to the nearest million with\none decimal.\nAssets and liabilities are reported at historical cost except for\ncertain financial instruments which are reported at fair value.\nReceivables and liabilities or income and expenses are only off-\nset if required or explicitly permitted by an accounting standard.\nPreparing the financial statements in compliance with IFRS\nrequires that Management make judgements and estimates as\nwell as make assumptions that affect the application of account-\ning principles and the amounts recognised as assets, liabilities,\nincome and expenses. The actual outcome may diverge from\nthese estimates and assumptions. Estimates and assumptions\nare reviewed continuously. Changes of estimates are recognised\nin the period when the change is made if the change only affects\ncurrent period or in that period when the change is made and\ncoming periods if the change affects both current period and\ncoming periods.\nJudgements made by Management for the application of IFRS\nthat have a substantial impact on the financial reports and esti-\nmates made that may lead to significant adjustments in coming\nyears' financial reports are described in more detail in Note 2.","classification":"Fixed assets and long-term liabilities essentially consist of\namounts expected to be realised or settled after twelve months\nfrom the balance sheet date. Current assets and short-term liabil-\nities essentially consist only of amounts expected to be realised\nor settled within twelve months from the balance sheet date. The\nGroup's operating cycle is assessed to be less than one year.","consolidated financial statements":"The consolidated financial statements consolidate the Parent\nCompany and the other companies in which the Parent Company\nhas a controlling influence, that is, is exposed or has right to\nvariable returns from its involvement and has the ability to affect\nthose returns through its involvement.\nCompanies or businesses acquired (acquisitions) are accounted for\nunder the purchase method. The method involves a business combi-\nnation to be regarded as a transaction in which the Group indirectly\nacquires the assets of the business and assumes its liabilities. The\nGroup's acquisition cost is determined through a purchase price allo-\ncation in connection with the acquisition. The acquisition cost is the\nsum of the fair value at the acquisition date of what is paid in cash,\nassumed liabilities or issue of own shares.\nContingent considerations are often conditional by future goals on\nsales or performance. At acquisition date, an estimation of the fulfil-\nment of the goals is made. The contingent consideration is measured\nat fair value and included in the acquisition cost and recognised as a\nfinancial liability in accordance with IFRS. Long-term contingent con-\nsiderations are discounted to present value. The measurement to\nfair value is initially based on the expected outcome of the acquired\ncompany's sales or performance. Contingent considerations are\nsubsequently measured at fair value and essential effects of remea-\nsurements are recognised in the income statement in accordance\nwith IFRS. If a revenue is recognised as a consequence of a change\nin estimation, the surplus values from the acquisition will be tested\nfor impairment. If the impairment test results in an impairment, the\nexpense will meet the revenue from the remeasurement of the con-\ntingent consideration. Transaction costs are expensed in the income\nstatement when incurred.\nIdentifiable assets acquired and liabilities assumed are rec-\nognised initially at their fair values at the acquisition date. Excep-\ntions are made for acquired tax assets and liabilities, employee\nbenefits, stock-based compensation and assets held for sale,\nvalued in accordance with the principles described for each item\nin in each standard.\nGoodwill recorded represents the difference between the acqui-\nsition cost of group companies' shares, the value of non-con-\ntrolling interest in the acquired business and the fair value of\npreviously owned shares and on the other hand, the purchase\nprice allocation of the assets acquired and liabilities assumed.\nFor goodwill disclosures, see Note 14 Intangible fixed assets.\nNon-controlling interests are recognised at the acquisition date,\neither at its fair value or at its proportionate share of the carrying\nvalue of the acquires identifiable assets and liabilities. Acquisition\nof non-controlling interest is reported as transactions between\nshareholders, i.e. within equity.\nGroup companies' financial statements are included in the con-\nsolidated accounts as of the date when control occurs (acqui-\nsition date) until the control ceases. When control of the Group\ncompany ceases, but the Group retains shares in the company,\nremaining shares are initially reported at fair value. The gain or\nloss from remeasurement is recorded in the income statement.","translation of financial reports to eur":"Assets and liabilities in operations with a functional currency\nother than EUR are translated at the closing day exchange rate\nand income statements are translated at average exchange\nrates for the period. The resulting translation differences are\nrecognised directly in other comprehensive income. The amount\nis recognised separately as a translation reserve in equity. In case\nof divestment of an operation with a functional currency other\nthan EUR the accumulated translation differences related to the\ndivested operation are reclassified from equity to income state-\nment at the time of recognition of capital gain or loss from the\ndivestment. Monetary long-term items towards businesses with a functional\ncurrency other than EUR, for which settlement is not planned or\nwill probably not occur within the foreseeable future, are part\nof the company's net investment. Translation differences on\nsuch monetary items, which comprise part of the company's net\ninvestment are recognised in other comprehensive income and\naccumulated in the translation reserve in equity.","transactions, assets and liabilities other currencies than eur":"Transactions in non-EUR currencies are recognised in the func-\ntional currency at the exchange rate on the transaction day.\nMonetary assets and liabilities are translated to the functional\ncurrency on the closing day at the exchange rate then in effect.\nExchange rate differences that arise through these translations\nare recognised in the income statement.","eliminated transactions":"Intra-Group receivables and liabilities, revenue or expenses and\ngains or losses that arise from transactions between group com-\npanies are eliminated in their entirety in the preparation of the\nconsolidated accounts. Losses are eliminated in the same way as\ngains, but only to the extent that there is no impairment loss.","earnings per share":"The calculation of earnings per share is based on net earnings\nattributable to the Parent Company shareholders and on the\nweighted number of shares outstanding during the year. The cal-\nculation of earnings per share after dilution takes into account the\nquarterly calculated dilutive effect from any potential common\nshares.","government grants":"Government grants have been recognised in accordance with IAS\n20. Receivables and revenue are recognised when there is reason-\nble assurance that the terms and conditions will be met, and it is\nreasonably certain that the grant will be received.","share programme":"Hexagon's share programme is accounted for according to IFRS 2\nand is classified as an equity-settled share-based payment trans-\naction, which means the programme is reported within equity.\nSocial fees are reported as a liability in the balance sheet.","accounting policies in the parent company":"The Parent Company applies the same accounting principles as\nthe Group with the following deviations:\n- In the Parent Company, the exemption in RFR 2 for IFRS 9 Finan-\ncial Instruments is applied. This means, among other things, that\nfinancial instruments are valued based on acquisition value and\nthe principles of impairment testing of loss risk provisions in\nIFRS 9 are applied to the Parent Company's short-term receiv-\nables and financial fixed assets.\n- In the Parent Company, the exemption in RFR 2 for IFRS 16 Leasing\nAgreements is applied and the costs for all leasing agreements\nare reported on a straight-line basis over the leasing period.\n- In the Parent Company participations in Group Companies are\nreported at acquisition value less any impairment.\n- Acquisition value of shares in subsidiaries includes transaction\ncosts and contingent consideration.\n- Non-monetary assets acquired in a currency other than EUR are\nreported at historical exchange rates. Other assets and liabilities\nin currencies other than EUR are reported at the exchange rate on\nthe balance sheet date.\n- The Parent Company applies the alternative rule for group contri-\nbutions and reports both submitted and received group contribu-\ntions and appropriations in the income statement.","dividends":"The dividend proposed by the Board of Directors reduces earnings\navailable for distribution and is recognised as a liability when the\nAnnual General Meeting has approved the dividend.","approval of accounts":"The Parent Company's and the consolidated financial statements\nwill be presented to the Annual General Meeting for adoption on\n29 April 2022."},"critical accounting estimates and assumptions":{"data":"The critical accounting estimates and assumptions that are\naddressed in this section are those that Company Management\nand the Board of Directors regard as the most important for\nunderstanding Hexagon's financial reporting. The information\nis limited to areas that are significant considering the degree\nof impact and underlying uncertainty. Hexagon's accounting\nestimates and assumptions are based on historical experience\nand assumptions that company management and the Board of\nDirectors regard as reasonable under the current circumstances.\nThe conclusions based on these accounting estimates constitute\nthe foundation for the carrying amounts of assets and liabilities,\nin the event that they cannot be established through information\nfrom other sources. The actual outcome may differ from these\naccounting estimates and assumptions.","customer contracts":"Parts of Hexagon's sales derive from major and complex customer\ncontracts. The critical estimates of customer contracts include\nestablishing the amounts that are to be recognised as income and\nwhen the income should be recognised. For example, company\nmanagement makes estimates of completed performance in\nrelation to the contractual terms and conditions, the estimated\ntotal contractual costs and the proportion of the contract that\nhas been completed at a certain point in time. The degree of com-\npletion is established by setting incurred cost in relation to total\ncosts required to complete the contract. The estimations are also\nbase for any loss provision, if any.\nHexagon also enters into revenue agreements that contain mul-\ntiple elements, such as hardware, software and/or services. For\nthese agreements, Hexagon need to assess if revenue should\nbe allocated to each element as different accounting principles\napply for these elements.","intangible assets":"Intangible assets within Hexagon concern essentially pertain to\ngoodwill, trademarks and other assets as a result of acquisition,\nsuch as customer relationships and technology. Goodwill and\nother acquired intangible assets with an indefinite life are not\nsubject to annual amortisation, while other intangible assets are\namortised. Insofar as the underlying operations develop nega-\ntively, an impairment requirement may arise. Impairment test is\nimplemented if necessary, but at least once a year. Such intan-\ngible assets are subject to annual impairment testing, which is\nessentially based on the value in use, making assumptions about\nthe sales trend, the Group's profit margins, on-going investments,\nchanges in working capital and discount interest rate. Company\nmanagement considers the assumptions applied to be compat-\nible with the data received from external sources of information\nor from previous experience. Hexagon's goodwill on 31 December\namounted to 8,205.6MEUR (5,705.6). Other intangible assets not\nsubject to amortisation amount to 1,035.5 MEUR (991.8) as of this\ndate. Performed impairment tests demonstrate that reported\nvalues are defendable.","tax assets and liabilities":"The Board of Directors and Company Management continuously\nassess the carrying amount of both current and deferred tax\nassets and liabilities. For deferred tax assets, Hexagon has to\nassess the probability of whether it will be possible to utilise\nthe deductible temporary differences that give rise to deferred\ntax assets to offset future taxable profits. In addition, in certain\nsituations, the value of the deferred tax assets and liabilities\nmay be uncertain due to ongoing tax processes, for example.\nAccordingly, the value of deferred tax assets and liabilities may\ndeviate from these estimates due to a change in future earning\ncapacity, changed tax regulations or the outcome of examinations\nby authorities or tax courts of issued or not yet issued tax returns.\nWhen assessing the value of deferred tax assets and liabilities,\nHexagon has to form an opinion of the tax rate that will apply at\nthe time of the reversal of the temporary differences. Hexagon\nrecognised deferred tax liabilities, net in an amount of 372.1 MEUR\n(358.1) net, at the end of 2021. At the same date, the Group had\ntax-loss carry-forwards with a value of 49.3 MEUR (45.5) that were\nnot recognised as assets. These assets could not be capitalised\nbased on assessments of the opportunity to utilise the tax defi-\ncits. In comparison with the final outcome, the estimates made\nconcerning both deferred tax assets and liabilities could have\neither a positive or a negative impact on earnings.","pension obligations":"Within Hexagon, there are defined-benefit pension schemes\nbased on significant assumptions concerning future benefits\npertaining to either the current or prior workforce. Pension obli-\ngations amounted to 69.3 MEUR (124.3) at the end of 2021. When\ncalculating the pension liability, a number of actuarial assump-\ntions are of major significance to the outcome of the calculation.\nThe most critical pertain to the discount interest rate on the\nobligation, the rate of pay increases, employee turnover and esti-\nmated length of life. A reduced discount interest rate increases\nthe recognised pension liability. The actual outcome could deviate\nfrom the recognised amount if the applied assumptions prove to\nbe wrong.","business combination":"Hexagon acquire companies on a continuous basis. In connection\nwith the acquisitions, acquired assets and assumed liabilities are\nvalued to fair value in a purchase price allocation analysis. The val-\nuation is to a certain extent based on management assessment of\nthe future earnings of the acquired company. Many of the acquisi-\ntion deals contain contingent consideration which is based on the\noutcome of the acquired company earnings for a predetermined\nperiod. The fair value of contingent considerations recognised as\na liability is reviewed on a regular basis, which requires manage-\nment to assess the future performance of the acquired company.\nAn inaccurate assessment of this might result in overstated\nacquired assets or liabilities for contingent considerations."},"segment reporting":{"data":"Hexagon's Board of Directors is responsible for determining the\nGroup's overall objectives, developing and monitoring the overall\nstrategy, decisions on major acquisitions, divestments and invest-\nments and ongoing monitoring of operations.\nThe President is responsible for leading and controlling Hexagon's\noperations in accordance with the strategy determined by the\nBoard. The President is therefore the Group's chief operating\ndecision maker (CODM) and is the function that internally within\nthe Hexagon Group allocates resources and evaluates results. The\nGroup's chief operating decision maker assesses the performance\nin the operating segments based on earnings before financial items\nand adjustments. Financial items and taxes are reported for the\nGroup as a whole.\nHexagon's operations are organised, governed and reported\nbased on the two operating segments Geospatial Enterprise Solu-\ntions and Industrial Enterprise solutions. The operating segment\nGeospatial Enterprise Solutions has sensors for capturing data\nfrom land and air as well as sensors for positioning via satellites.\nThe sensors are complemented by software (GIS) for creation\nof 3D maps and models, which are used for decision-making in a\nrange of software applications, covering areas such as surveying,\nconstruction, public safety and agriculture. The operating seg-\nment Industrial Enterprise Solutions provides metrology systems\nthat incorporate the latest in sensor technology for fast and accu-\nrate measurements, as well as CAD (computer aided design) and\nCAM (computer aided manufacturing) software. The solutions\nwithin this segment optimise design, processes and throughput in\nmanufacturing facilities and create and leverage asset manage-\nment information critical to the planning, construction and opera-\ntion of plants and process facilities in a number of industries such\nas automotive, aerospace and oil and gas.\nThe two segments have separate product offerings and customer\ngroups and hence differentiated risk composition. There is marginal\nsales between the two operating segments. Both segments are\napplying the same accounting principles as the Group. Hexagon's\ninternal reporting, representing the base for detailed review and\nanalysis, is designed in alignment with the described division into\noperating segments. Sales within each operating segment are addi-\ntionally analysed geographically.\nIES GES","total segments group expenses and eliminations group":"Financial income and expenses\nEarnings before tax\nIES GES","total segments group expenses and eliminations group (1)":"Financial income and expenses\nEarnings before tax\nGeographical markets","operating assets fixed assets net sales by country4 assets liabilities":"Net Elimination of intra-group\n1) Sweden is included in EMEA with net sales of 72.9 MEUR (63.0) and fixed assets of 36.5 MEUR (31.5)\n2) USA is included in Americas with net sales of 1,135.2 MEUR (1,016.1)\n3) China is included in Asia with net sales of 642.0 MEUR (500.5)\n4) Relates to the country where the customer has its residence. No single customer represented more than 1.2 per cent (1.1) of net sales"},"parent company intra-group purchases and sales":"Of the Parent Company's net sales, 100 per cent (100) refers to\nsales to other group companies. Of the year's purchases in the\nParent Company, 81 per cent (82) refers to purchases from group\ncompanies. ","Revenue from contracts with customers":{"data":"Hexagon sells information technology solutions in which hard-\nware and software are integrated as well as services, licenses and\nother assignments. Revenue from agreements with customers is\nreported in the income statement as Net sales.","sale of goods":"Revenue is recognised when control of the good is transferred to\nthe customer, which coincide with the good being delivered to the\ncustomer and Hexagon has objective evidence that the customer\nwill approve the good. The amount of the revenue will equal the\nconsideration stated in the contract minus rebates. There is no\nfinancing component in the contract as the expected credit do\nnot exceed one year. The Group's obligation to offer a repayment\nfor defected goods in accordance with standard warranty terms,\nis accounted for as a provision, see Note 23.","sale of services, licenses and other assignments":"Parts of contracts with customers not being sale of goods com-\npose sale of installations, service, training, licenses and software\nsubscriptions. Revenue from sale of services such as installations, services and\ntraining are recognised in the period when the services are per-\nformed. Licenses are classified either as a license that gives right\nto use the underlying immaterial asset as it is constituted at the\nissuing of the license (right-to-use) or as a license that gives right\nto access the underlying intangible asset during the license period\n(right-to-access). Revenue from sale of right-to-use licenses is\nrecognised when the license is transferred to the customer. Rev-\nenue from sale of right-to-access licenses is recognised during\nthe license period. Revenue from sale of software subscriptions is\nrecognised straight-line as the performance obligation is fulfilled,\nduring the subscription period.\nRevenue from contracts where there is no alternative use of\nHexagon's performance and where Hexagon has right to cost\ncompensation if the customer cancels the contract is recognised\nover time. The degree of completion is determined by comparing\nthe expenditure that has arisen in relation to the total estimated\nexpenditure for the assignment. If the degree of completion can-\nnot be reliably determined, only those amounts corresponding to\nthe expenditure that has arisen are recognised as revenue, but\nonly to the extent that it is likely that they will be remunerated by\nthe buyer. If it appears likely that all the expenditure for an assign-\nment will exceed total revenue, the probable loss is accounted\nimmediately and fully, as an expense.\nSome contracts contain several performance obligations. A per-\nformance obligation that does not contain an integration service\nwith the other obligations in the contract, does not lead to a sig-\nnificant modification or adaptation of the other obligations in the\ncontract and that is not strongly dependent on or integrated with\nthe other obligations in the contract is distinct and represents a\nseparate performance obligation. The transaction price of the\ncontract is allocated to the separate performance obligations\naccording to their stand-alone selling prices. Revenue from\neach performance obligation is recognised as the obligation\nhas been fulfilled.\nEstimation of revenue, cost and degree of completion is being\nrevised if conditions change. Changes in estimations is recognised\nin the income statement in the period when the group manage-\nment has knowledge of the circumstances causing the change.\nIn fixed price contracts, the customers pay a fixed price according\nto an agreed payment plan. If the value of the services performed\nby Hexagon exceeds the payments, a contract asset will be\nrecognised. If the payments exceed the value of the performed\nservices, a contract liability will be recognised.\nIf the contract contains a fee per hour, revenue is recognised to\nthe extent Hexagon has right to invoice the customer. Customers\nare invoiced on a monthly basis and right to consideration exists\nwhen the invoice has been generated.\nMain part of recognised revenue reflects performance obligations\nfulfilled during current year. The performance obligations are\nusually fulfilled within 12 months, why disclosure about transac-\ntion price allocated to the remaining performance obligations is\nexempted.","contract costs":"Additional costs to obtain a contract are recognised as an asset if\nthe Group expects to recover those costs. If time of depreciation\nof the asset that would have been recognised is below one year,\nthe additional costs are recognised as cost when they occur.","financing component":"The Group does not have any contracts with customers where\nthe period between transferring of goods and services to the\ncustomer and payment from the customer exceeds one year. As a\nconsequence of this, the Group does not adjust transaction prices\nfor time value of money.","disaggregation of revenue from contracts with customers":"No other revenue than revenue from contracts with customers is recognised in Net sales. The Group derives revenue from the transfer\nof goods and services in the following operating and customer segment.\nSurveying Power & energy Infrastructure & construction Auto- motive Public safety Electronics & manufacturing Aerospace & defence Natural resources Other Group Industrial Enterprise\nGeospatial Enterprise\nSurveying Power & energy Infrastructure & construction Auto- motive Public safety Electronics & manufacturing Aerospace & defence Natural resources Other Group Industrial Enterprise\nGeospatial Enterprise\n1) Reduction of acquired deferred revenue (haircut) related to acquisitions","contract balances":"Customer receivables\nContract assets\nContract liabilities"},"operating expenses":"Group Parent company\nCost of goods sold\nSales expenses\nGeneral and administrative cost\nResearch and\ndevelopment cost\nFor information on impairment of receivables and contract assets,\nsee Note 18.\nContract assets include accrued income from fulfilling perfor-\nmance obligations over time. Contract liabilities include advance\npayments and deferred income. Deferred income relates to rev-\nenue from service, installation and training. Main portion of con-\ntract liabilities at the beginning of the year has been recognised as\nrevenue during 2021.","other operating income/ expenses":"Other operating income and operating expenses consist of\nexchange rate gains and exchange rate losses of an operating\nnature. In addition, items that do not belong to the primary busi-\nness are reported in this function, such as impairments and fair\nvalue changes.\nOther operating income\nCapital gain on divestment of fixed assets\nGain on divestment of assets\nExchange rate gains\nGovernment grants\nReversal of unutilised amounts supplementary\npayments for acquired companies\nRental income\nOther Other operating expenses\nCapital loss on divestment of fixed assets\nExchange rate losses\nRental related expenses\nImpairment 1 Acquisition related expenses\nOther 1) For more information about impairment, see Note 14","impairment":{"cash-generating units":"Goodwill and other intangible assets with indefinite lives acquired through business combinations has been allocated to\nthe five (five) cash generating units (CGU) below, which complies with the Group's organisation: Geosystems, Manufacturing\nIntelligence, Autonomy & Positioning, PPM, and Safety, Infrastructure & Geospatial.\nCarrying amount of goodwill and other intangible assets allocated to each of the CGUs:\nGeosystems Manufacturing Intelligence Autonomy & Positioning PPM Safety, Infrastruc-\nture & Geospatial\nTotal Other intangible assets\nwith indefinite useful\nIntangible assets\n1) Comprises brands\n2) Comprises capitalised development costs, patents, technology and other intangible assets\nHexagon performed its annual impairment test during the fourth\nquarter 2021 and tested if the carrying value of the CGU's exceed\ntheir recoverable value. The recoverable value is the higher of the\nunits net realisable value and value in use, which is the discounted\npresent value of future cash flows.","calculation of recoverable value":"The recoverable values of the cash-generating units consist of its\nvalue in use. The utilisation values are calculated using cash flow\nforecasts based on budgets approved by the management that\nextend over a period of five years. The after-tax discount rates\napplied to cash flow forecasts are shown in the table below. The\nannual growth rate for extrapolating cash flows beyond the five-\nyear period was 2.0 per cent (2.0) for all cash-generating units.\nAnnual growth is a conservative assessment and is set equal to\nexpected inflation. The result of a write-down test has resulted\nin the management not identifying any write-down need for any\ncash-generating unit.\nDiscount rate\nafter tax\nGeosystems Manufacturing Intelligence\nAutonomy & Positioning\nSafety, Infrastructure & Geospatial\nPPM","key assumptions":"The calculation of value in use for all CGU is most sensitive to the\nfollowing assumptions:\n- Forecasts, including operating margins and sales growth\n- Discount rates\n- Growth rates used to extrapolate cash flow beyond the forecast\nperiod","forecasts":"Projected cash flows, approved by management, is based on\nan analysis of historic performance as well as a best estimation\nregarding the future. Hexagon has since 2001 mainly shown rising\noperating margins and virtually continuous good organic growth.\nThe operating margins are based on average values achieved\nhistorically. The margins are increased over the period to reflect\nanticipated efficiency improvements. The organic growth is\nbased on an analysis of how the competition situation is judged to\ndevelop over time.","discount rates":"Discount rates represent the current market assessment of the\nrisks specific to respective CGU, taking into consideration the\ntime value of money as well as individual risks. The discount rate\ncalculation is based on the specific circumstances of respective\nCGU and is derived from its weighted average cost of capital\n(WACC). The WACC considers both debt and equity. The cost of\nequity is derived from the expected return on investment by the\nGroup investors. The cost of debt is based on the interest bearing\nborrowings. Specific risks are incorporated by applying individ-\nual beta factors. The beta factors are evaluated annually based\non publicly available market data. Discount rate before tax is","growth rates used to extrapolate cash flow":"To extrapolate cash flows over the forecast period, growth figures\nstart based on published research of each respective industry.\nThe long-term rate is conservatively estimated as equal to the\nexpected long-term inflation rate.","sensitivity to changes in assumptions":"A sensitivity analysis including all key assumptions is performed\nand management believe that no reasonably possible change in\nany of the above key assumptions would cause the carrying value\nto materially exceed the recoverable value. For all cash generat-\ning units there is a significant headroom before any changes in\nkey assumptions would cause a valuation adjustment, since the\nrecoverable value totally is nearly double the book value. The per-\nformed sensitivity analysis demonstrates that the value of good-\nwill and other intangible assets with indefinite useful life is more\nthan defendable even if the discount rate is increased with one\npercentage point or if the growth rate after the forecast period\nis decreased with one percentage point for all cash generating\nunits. Even forecasts for sales growth and operating margin are\nincluded in the sensitivity analysis and no reasonable changes in\nthese would cause a need of impairment."},"earnings from shares in group companies":"Group Parent company\nEarnings from shares\nin group companies\nCapital gain/loss from sale of","financial income and expenses":"Group Parent company\nFinancial income\nInterest income\nInterest income,\nFinancial expenses\nInterest expenses,\nlease liabilities\nInterest expenses, intercom-\npany liabilities\nNet interest on pensions\nOther financial expenses\n1) Mainly bank costs","income taxes":{"data":"Income taxes comprise of:\n- Current tax, meaning the tax calculated on taxable earnings for\nthe period and adjustments regarding prior periods and;\n- Deferred tax, meaning the tax attributable to taxable temporary\ndifferences to be paid in the future and the tax that represents\na reduction of future tax attributable to deductible tempo-\nrary differences, deductible loss carry-forwards and other tax\ndeductions. The income tax expenses for the year consist of current and\ndeferred tax. Transactions recognised in other comprehensive\nincome are including tax effects, i.e. tax related to these transac-\ntions are also posted in other comprehensive income. Tax related\nto transactions directly recognised in equity, is posted in equity.\nGROUP","tax on earnings for the year":"Current tax\nDeferred tax\nTotal tax on earnings for the year","specification of deferred tax":"Deferred tax assets (liabilities) comprise:\nFixed assets\nInventories Receivables Provisions Other Unutilised loss carry-forwards and\nsimilar deductions\nLess items not satisfying criteria for being\nrecognised as assets\nAccording to the balance sheet:\nDeferred tax assets\nDeferred tax liabilities\nTotal, net\nUnutilised loss carry-forwards and similar deductions not sat-\nisfying criteria for being recognised as assets have not been\nrecognised. Deferred tax assets that depend on future taxable\nsurpluses have been valued on the basis of both historical and\nforecast future taxable earnings. Hexagon is striving for a corpo-\nrate structure that enables tax exemption when companies are\ndivested and favourable taxation of dividends within the Group.\nCertain potential tax on dividends and divestments remains\nwithin the Group.","reconciliation of the year's change in current and deferred tax assets/liabilities":"Deferred tax\nOpening balance, net\nChange via income statement\nDeferred tax on earnings\nChange in reserve for deductions not satisfying\ncriteria for being recognised as assets\nChange in tax rates and tax reforms -5.9\nItems pertaining to prior years\nTotal Change via other comprehensive income\nDeferred tax on other comprehensive income\nTotal Change via equity\nChange via acquisitions and divestments\nDeferred tax on share program\nReclassification Translation difference\nClosing balance, net\nCurrent tax\nOpening balance, net\nChange via income statement\nCurrent tax on earnings\nItems pertaining to prior years\nChange via acquisitions and divestments\nPayments, net\nReclassification Translation difference\nClosing balance, net\nThe Group's unutilised loss carry-forwards and similar\ndeductions mature as follows:\n2026 and later\nIndefinitely Total","the difference between nominal swedish tax rate and effective tax rate arises as follows":"Earnings before tax\nTax pursuant to Swedish nominal tax rate 20.6%\nDifference in tax rates between Swedish and\nforeign tax rate\nRevaluation of loss carry-forwards, etc.\nIncome not subject for tax\nExpenses not tax-deductible\nChange in tax rates and tax reforms\nItems not included in the booked result\nItems pertaining to prior years\nTax, income statement\nPARENT COMPANY","tax on earnings for the year (1)":"Current tax\nDeferred tax\nTotal tax on earnings for the year","reconciliation of the year's change in current and deferred tax assets/liabilities (1)":"Deferred tax\nOpening balance, net\nChange via income statement\nDeferred tax on earnings\nTotal Closing balance, net\nCurrent tax\nOpening balance, net\nChange via income statement\nCurrent tax on earnings\nTotal Payments, net\nTranslation difference\nClosing balance, net\nThe Parent Company has unutilised loss carry-forwards of 14.3\nMEUR (-). The maturity of these is indefinitely."},"adjustments":"Adjustments refer to non-recurring items that relate to income\nand expenses that are not expected to arise regularly and that\naffect comparisons between periods. Below are the items\nadjusted for 2021 and 2020, respectively.\nAcquired deferred revenue\nCost nature\nPersonnel costs\nTransaction costs\nImpairments Integration costs\nAmortisation of surplus values\nShare based program\nOther Total cost nature\nTotal adjustments\nFunction Net sales\nCost of goods sold\nSales expenses\nAdministration expenses\nResearch and development expenses\nOther operating expenses\nTotal adjustments","government grants":"During the year some of the subsidiaries within the Group have\nreceived government grants. Government grants are recognised\nwhen it is reasonable assurance that the conditions will be com-\nplied with. The government grants received during the year mainly\nconsist of furlough compensations, education of employees and\nR&D funding. The table below shows how the grants are allocated\nto functions.\nFunction Cost of goods sold\nSales expenses\nAdministration expenses\nResearch and development expenses\nOther operating income\nTotal ","intangible fixed assets":{"data":"Intangible fixed assets could be acquired separately, as part\nof a business combination or internally generated. The Group's\nintangible fixed assets include mainly capitalised development\nexpenses, trademarks and goodwill. Trademarks, goodwill, tech-\nnology and customer relations are often acquired as part of a\nbusiness combination, while capitalised development expenses\nare internally generated.Any impairments are reported as other\noperating expenses in the income statement.\nThe impairment for the year relates to overlapping technologies\nassociated with acquisitions and impairment of other intangible\nassets related to releases of earn-out provisions. See Note 8 for\nfurther disclosures about impairment.","capitalised development expenses":"An internally generated intangible asset that will generate\nexpected future economic benefit and whose cost could be deter-\nmined reliably must, according to IAS 38, be recognised as an\nasset in the balance sheet. To assess if those criteria are fulfilled,\nthe generation of the asset is classified into a research phase\nand a development phase. The research phase includes activi-\nties such as obtaining new knowledge, new products, systems,\nmethods or materials. At a certain point in time, the activities\nchange and include design, construction and testing of chosen\nalternatives. This point in time differs between different projects\nand constitutes the inflection point between research phase and\ndevelopment phase. Hexagon expenses expenditure on research\nin the income statement and expenditures arising in the deve-\nlopment phase must be recognised as an intangible asset in the\nbalance sheet. If the research phase could not be distinguished\nfrom the development phase, all expenditures will be expenses in\nthe income statement.\nCapitalised development expenses are measured at cost less\naccumulated amortisations and impairment. Amortisation\nis accounted for linearly based on estimated useful life and\nexpensed as a research and development expense. Useful life\nfor capitalised development expenses is 2-10 years. The assets'\nresidual value and useful life are tested on each closing date and\nare adjusted if necessary.","trademarks":"Separately acquired trademarks are measured at cost. Trade-\nmarks acquired as part of a business combination are measured\nat fair value at acquisition date. In cases where the assets have\na limited useful life, amortisation is estimated to 5 years. If the\ntrademark can be used without any time limitations, it is not sub-\nject to amortisation according to plan. A new assessment is done\nyearly. The right to use the name Leica derives from a contractual\nuseful life under an agreement that expires in 82 years' time. The\nagreement contains clauses stipulating extension opportunities.\nSince Hexagon is of the opinion that there is reason to believe that\nit will be possible to extend the agreement without considerable\nexpenditure, the value of the right to use the name Leica is not\nsubject to amortisation.","goodwill":"Goodwill comprises the difference between the acquisition cost\nand fair value of the Group's share of acquired business' identifi-\nable net assets on the date of acquisition. Goodwill is not amor-\ntised, but an impairment test is performed annually or more often\nif events or changes in circumstances indicate a possible need for\nimpairment. Goodwill is recognised at acquisition value less accu-\nmulated impairment losses.","other intangible assets":"Both acquisition-related and separately acquired intangible\nassets are reported at acquisition value less accumulated amor-\ntisation and impairment losses, if any. Other intangible assets\nconsist of patents, customer relations and technology identified\nupon acquisitions. Amortisation is linear and is calculated on the\noriginal acquisition value and based on the asset's estimated use-\nful life. For other intangible assets, the estimated useful life varies\nbetween 2 and 20 years. Both the residual value of the assets\nand the useful life are tested each closing date and adjusted if\nnecessary. Group 2021 Capitalised development expenses\nTrademarks Goodwill Other intangible\nfixed assets\nTotal Group 2020 Capitalised development expenses\nTrademarks Goodwill Other intangible\nfixed assets\nTotal","amortisation of intangible fixed assets allocated by function":"Cost of goods sold\nSales expenses\nAdministration expenses\nResearch and development expenses\nOther operating expenses","other intangible fixed assets":"Parent company\nAcquisition value, opening balance\nInvestments Acquisition value, closing balance\nAmortisation, opening balance\nAmortisation for the year\nAmortisation, closing balance\nCarrying value"},"tangible fixed assets":{"data":"Tangible fixed assets are recognised at acquisition value less\naccumulated depreciation and impairment losses. Acquisition\nvalue includes expenditure that is directly attributable to acquisi-\ntion of the asset.\nGains and losses on the divestment of a tangible fixed asset are\nrecognised in the income statement as other operating income or\nexpenses and comprise the difference between the sales revenue\nand the carrying amount. Amounts that can be depreciated com-\nprise acquisition value less estimated residual value. The assets'\ncarrying value and useful life are impairment tested on every\nbalance sheet date and adjusted if necessary.","depreciation and amortisation":"Depreciation and amortisation is calculated on the original acqui-\nsition value and based on the asset's estimated useful life. The\ndepreciation terms for various asset classes are:\n- Computers 3-8 years\n- Machinery and equipment\n3-15 years\n- Office buildings\n- Industrial buildings\n- Land improvements\n5-25 years\nConstruction in\nGroup 2021 Buildings Land and other\nreal estate\nMachinery and\nother technical\nplants Equipment, tools and\ninstallation progress and\nadvances to\nsuppliers Total Group 2020 Buildings Land and other\nreal estate\nMachinery and\nother technical\nplants Equipment, tools and\ninstallation Construction in\nprogress and\nadvances to\nsuppliers Total Impairment, opening balance","depreciation of tangible fixed assets allocated by function":"Cost of goods sold\nSales expenses\nAdministration expenses\nResearch and development expenses\nOther operating expenses\nTotal","equipment":"Parent company\nAcquisition value, opening balance\nInvestments Acquisition value, closing balance\nDepreciation, opening balance\nDepreciation for the year\nDepreciation, closing balance\nCarrying value"},"leasing":{"hexagon as lessee":"Hexagon has the role of lessee mainly in contracts regarding real\nestate, vehicles and office equipment. The leases are recognised\nas a right-of-use asset and a corresponding liability at the date at\nwhich the leased asset is available for use. Lease payments are\nallocated to interest payments and repayment of debt. The inte-\nrest part is presented as paid interest in the cash flow analysis.\nThe right-of-use asset is depreciated on a linear basis over the\nshorter of the asset's useful life and the lease period.\nAssets and liabilities arising from lease contracts are measured\non a present value basis. Lease liabilities include the net present\nvalue of fixed payments, variable payments based on an index or\na rate, amounts expected to be paid under residual value guaran-\ntees, exercise price of purchase options that will reasonably cer-\ntainly be exercised and payments of penalties for terminating the\nlease, if such option will be exercised.\nThe future payments are discounted using the implicit interest\nrate in the contract. If that rate could not be determined, the\ngroup's incremental borrowing rate could be used. The discount\nrate is updated semi-annually.\nThe right-of-use asset is measured and cost and comprises,\nbesides the amount of the initial measurement of the lease liability,\nof payments (less incentives received) made before the date of\ncommencement, initial indirect costs and restoration costs.\nPayments of lease contracts with a lease period below 12 months\nand lease contracts of low value assets are expensed straight-line\nin the income statement. Low value assets are mainly IT-equipment,\noffice furniture and other office equipment.\nRent discounts as a direct consequence of the Covid-19 pandemic\nare recognised as a variable lease fee in the income statement. No\nmaterial rent discounts have been received during the year.\nGroup 2021 Real estate\nVehicles Machinery Office equipment\nTotal Group 2020 Real estate\nVehicles Machinery Office equipment\nTotal","depreciation of right-of-use assets allocated by function":"Cost of goods sold\nSales expenses\nAdministration expenses\nResearch and development expenses\nOther operating expenses\nTotal","set out below are the carrying amounts of the lease liabilities and the movements during the period.":"At the beginning of the year\nAdditions Interest Payments Translation difference\nClosing balance\nOf which current liabilities\nOf which non-current liabilities\nThe maturity structure of the lease liabilities is presented in the\ntable Group's maturity structure of interest bearing financial lia-\nbilities - undiscounted cashflows in Note 24.\nThe Group had total cash outflows for leasing of 79.1 MEUR (77.2)\nExpenses regarding short-term leases and leases of low value are\ninsignificant in relation to the Group as a whole.\nHexagon as lessor\nThere are a few contracts in which Hexagon is the lessor and","agreements where a group entity is lessor":"Machinery, equipment, etc.\nLease payments due in\nTotal Machinery, equipment, etc.\nLease payments due in\nwhich are classified as finance lease contracts. The revenue of\nsuch contracts is allocated to sale of hard- and software and\nservice. Revenue from sale is recognised at the commencement\ndate. Revenue from service is recognised during the lease term."},"financial fixed assets":"Other long-term securities holdings\nOther long-term receivables\nAcquired as subsidiary\nSales Impairments Reclassification Shares in group companies\nReceivables from group companies\nOther financial fixed assets\nOther long-term securities holdings\nClothing Tech LLC\nEucliedon PTY\nCICV Co Ltd\nHuixin Quanzhi Gongye Hulian Keji Co Ltd\nOther Total Subsidiaries of Hexagon AB\nCorp ID. No.\nReg. Office/ Country\nNo. of shares\nPortion of share capital\nand voting rights, %\nCarrying amount\nStockholm, Sweden\n1) The remaining part of share capital and voting rights in the company are owned by wholly owned subsidiaries in the Group","receivables":"Group Not due\nDue less\nthan 30 days\nDue between\nDue between\nOlder than\n120 days Total Aging analysis of receivables,\n31 December 2021, net of impairment losses\nAging analysis of receivables,\n31 December 2020, net of impairment losses\nThe Group applies the simplified approach to measuring expected\ncredit losses. The method uses a lifetime expected loss allowance\nfor all trade receivables.\nTo measure the expected credit losses, trade receivables have been\ngrouped based on shared credit risk characteristics and the days\npast due. The expected loss rates for trade receivables are a reason-\nable approximation of the loss rates for the contract assets too, as\nthe contract assets have substantially the same risk characteristics\nas the trade receivables for the same types of contracts.\nThe expected loss rates are based on the payments profiles of\nsales and the corresponding historical credit losses. The histori-\ncal loss rates are adjusted to reflect current and forward-looking\ninformation on macroeconomic factors affecting the ability of the\nconsumers to settle the receivables.\nTrade receivables are written off when there is no reasonable\nexpectation of recovery. Impairment losses are presented within\noperating profit. Any recoveries of amounts previously written off\nare credited against the same line item.\nThe closing loss allowances for trade receivables reconcile to the\nopening loss allowances as follows:\nReserve for expected credit loss","inventories":"Inventories are accounted according to the FIFO (first-in first-out)\nprinciple. Raw materials and purchased finished and semifinished\ngoods are recognised at the lower of cost and net realisable value.\nManufactured finished and semi-finished goods are recognised at\nthe lower of manufacturing cost (including a reasonable portion\nof indirect manufacturing costs) and fair value. Market terms are\napplied for intra-group transactions. The necessary provisions\nand eliminations are made for obsolescence and intra-group gains\nrespectively. Raw materials and supplies\nWork in progress\nFinished goods and goods for sale 180.1\nValue adjustment reserve includes\nprovisions for obsolescence of -71.1\nOpening balance\nReserve for anticipated losses\nAdjustment for actual losses\nReclaimed expected losses\nIncrease through acquisition\nTranslation differences\nClosing balance","prepaid expenses and accrued income/accrued expenses and deferred income":"Prepaid expenses and accrued income\nGroup Parent company\nAccrued interest income\nAccrued expenses and deferred income\nGroup Parent company\nAccrued installation and training expenses\nAccrued R&D expenses\nAccrued royalties","share capital and number of shares":"Parent company\nNumber of shares\nOutstanding Repurchased Total issued\nQuota value per share, EUR Class A\nClass B\nTotal Class B\nClass A\nClass B\nTotal Share capital, MEUR Acquisition of\nAcquisition of\nAcquisition of\nEach series A share entitles the holder to 10 votes and each series B share to 1 vote. All shares entail the same right to share of profits in\nHexagon. Dividend per share paid in 2021 regarding the financial year of 2020 amounted to 0 .65 EUR (0.62) pre share split.\nAverage number of shares before and after dilution, thousands\nAverage number of shares before dilution\nEstimated average number of potential shares pertaining to warrants plans\nAverage number of shares after dilution","pension provisions":{"data":"Within the Group there are defined contribution plans as well as\ndefined benefit plans.\nFor the defined contribution plans, Hexagon pays a fixed amount.\nExpenditure for defined contribution plans is expensed as incurred.\nExpected expenditure under defined benefit plans are recognised\nas a liability calculated in accordance with actuarial models,\nconsisting of an estimate of future benefits that employees have\nearned through their employment during the current and prior peri-\nods. This benefit is discounted to its present value. The discount\nrate is the yield on high-quality corporate bonds or if there is no\ndeep market for such bonds, government bonds - that have matu-\nrity dates approximating the terms of the Group's obligations.\nChanges of the defined benefit obligation related to changed\nactuarial assumptions including currency revaluation on defined\nbenefit obligation in another currency than functional currency\nand experience-based adjustment are reported in other compre-\nhensive income. Pension expense for the year consists of pen-\nsions earned in the current period and pensions earned from prior\nperiods resulting from any changes in the plan. Pension liabilities,\n-assets net is multiplied with discount rate and accounted for as a\nfinancial expense. Obligations related to defined benefit plans are\nrecognised net in the balance sheet as a provision, meaning after\na deduction of the value of any plan assets.\nDefined benefit plans for which the insurer (Alecta) cannot\nspecify Hexagon's share of the total plan assets and pension\nobligations, pending this information becoming available, are\nrecognised as defined contribution plans. This only exist in limited\nextent in Sweden.\nGROUP","provisions - defined-benefit plans":"Pension obligations\nFair value of plan assets\nPension obligations less plan assets\nUnrecognised assets\nPension obligations, net","pension expenses - defined-benefit plans":"Current service cost\nInterest expense\nCalculated interest income\nChange in terms and conditions\nTotal","total pension expenses impact on the income statement":"Operating expenses\n- defined benefit plans\nOperating expenses\n- defined contribution plans\nOperating earnings impact\nNet interest expenses\n- defined benefit plans\nEarnings before tax impact","defined-benefit obligations":"Plan assets\nPension obligations Net Other countries\nOf which:\nReported as asset (other\nnon-current receivables)\nReported as liability\nPlan assets\nPension obligations Net Total (fair/present value)\nUnrecognised assets\nOf which:\nReported as asset (other\nnon-current receivables)\nReported as liability\nThree-year summary\nUnrecognised assets","pension obligations":"Opening balance\nChange in terms and conditions\nCurrent service cost\nInterest expense\nBenefits paid\nAcquired/divested subsidiaries\nSettlement of pension obligations\nActuarial gains/losses\n- Financial assumptions\nActuarial gains/losses\n- Demographic assumptions\nActuarial gains/losses\n- Experience adjustments\nCurrency translation differences\nClosing balance","plan assets":"Opening balance\nChange in terms and conditions\nCalculated interest income\nContributions - employer\nContributions - employee\nBenefits paid\nAcquired/divested subsidiaries\nReturn on plan assets excluding calculated\ninterest income as above\nCurrency translation differences\nClosing balance","fair value of plan assets":"Equities and similar financial instruments 256.9\nInterest bearing securities, etc.\nReal estate\nFor 2022, the contributions to defined benefit plans are estimated\nat 34.1 MEUR, of which employer's contribution 19.5 MEUR.","characteristics of the pension obligations":"The following applies for the Swiss plans which represent 85 per cent\nof the total pension obligations. The Swiss plans include the follow-\ning sub-plans: retirement pension (main plan), disability pension,\nmanagement plan, early retirement plan and jubilee plan. The main\nplan, retirement pension, is financed through an individual savings\naccount. The plan defines a retirement credit in per cent of insured\nsalary depending on the age of the plan member and it guarantees an\ninterest rate, which is annually determined by the Pension Fund. The\nminimum legal rate as fixed by the Swiss government has to be cred-\nited to the minimum savings account. The interest is not allowed to\nnegative, even if the actual return on assets is negative (capital pro-\ntection). The other kind of plans in Switzerland are of similar nature.\nShortfall in the schemes in Switzerland must be covered by the\nemployer, while surpluses can only become due to the beneficia-\nries. The value of plan assets has been reduced accordingly.\nRemaining duration is in average 20 year.","actuarial assumptions for the defined-benefit pension schemes":"(weighted average, where applicable)\nDiscount interest rate, %\nInflation, % Future salary increase, %\nFor 85 per cent of the defined benefit obligation, the Swiss BVG\n2015 tables have been used for the actuarial assumptions regard-\ning employee turnover and life expectancy."},"other provisions":{"data":"A provision is recognised in the balance sheet when the Group has\na legal or constructive obligation as a result of a past event and it\nis probable that an outflow of resources will be required to settle\nthe obligation and a reliable estimate of the amount can be made.\nIf the effect is material, the provision is determined by discount-\ning the expected future cash flows at a pre-tax rate that reflects\nthe current market assessments of the time value of money and,\nwhere appropriate, the risks specific to the liability.\nWarranties A provision for warranties is recognised when the underlying\nproducts or services are sold. The provision is based on historical","sensitivity analysis":"The table below describes the effect on the value of the defined\nbenefit obligations of an isolated change in assumptions as\ndescribed. Change in\nassumption, % Effect, MEUR Change in\nassumption, % Effect, MEUR Change in\nassumption, no.\nof years\nEffect, MEUR Change in\nassumption, no.\nof years\nEffect, MEUR warranty data and a weighing of all possible outcomes with their\nassociated probabilities.","restructuring":"A provision for restructuring is recognised when the Group\nhas approved a detailed and formal restructuring plan and\nthe restructuring has either commenced or has been publicly\nannounced. No provision is posted for future operating losses.","onerous contracts":"A provision for onerous contracts is recognised when the\nexpected benefits to be derived by the Group are lower than the\nunavoidable cost of meeting its obligations under the contract.","group":"Restructuring provisions\nWarranty provisions\nOther provisions\nTotal Opening balance 2020-01-01","restructuring provisions other provisions":"Restructuring provisions primarily relates to transaction and\nintegration costs during the fourth quarter 2021 and a savings pro-\ngramme during the second quarter of 2020. The remaining part of\nrestructuring provisions are mainly related to personnel and are\nexpected to become due within 12 months.","warranty provisions":"Warranty provisions are estimated based on previous years statis-\ntical data and are evaluated on a regular basis. Since the warranty\nprovisions are based on historical statistical data, the provided\namount has a low uncertainty regarding the amount and timing of\noutflow. The majority of warranty provisions run over a period of\n1 - 3 years. Estimated costs for product warranties are recognised\nwhen the products are sold.\nOther provisions primarily consist of provisions for buildings, tax\nand legal disputes and also legally required personnel related\nprovisions. The personnel related provisions are considered as\nlong-term. "},"financial risk management":{"risk management":"Hexagon is a net borrower and has extensive international oper-\nations and is therefore exposed to various financial risks. The\nGroup Treasury Policy, approved by the Board, stipulates the rules\nand limitations for the management of the different financial risks\nwithin the Group. Hexagon's treasury operations are centralised\nto the Group's internal bank, which is in charge of coordinating the\nfinancial risk management. The internal bank is also responsible\nfor the Group's external borrowing and its internal financing. Cen-\ntralisation entails substantial economies of scale, lower financing\ncost and better control and management of the Group's financial\nrisks. The internal bank has no mandate to conduct independent\ntrading in currencies and interest rate instruments. All relevant\nexposures are monitored continuously and are reported to the\nGroup Management and the Board of Directors on a regular basis.","currency risk":"Currency risk is the risk that exchange rate fluctuations will have\nan adverse effect on income statement, balance sheet and\ncash flow. Furthermore, the comparability of Hexagon's earn-\nings between periods will be affected by changes in currency\nexchange rates. Hexagon's operations are mainly conducted\ninternationally and sales, costs and net assets are therefore\ndenominated in a number of currencies. As of 1 January 2011\nthe presentation currency is EUR for the Group. The change\ndecreases the currency exposure in both the income statement\nand balance sheet as well as in other comprehensive income. It\nalso allows the Hexagon Group to better match debt to net assets.\nCurrency exposure originates both from transactions in non-do-\nmestic currencies in the individual operating entities, i.e. transac-\ntion exposure and from translation of earnings and net assets into\nEUR upon consolidation of the Group, translation exposure.","transaction exposure":"Sales and purchase of goods and services in currencies other than\nrespective subsidiary's functional currency give rise to transaction\nexposure. Transaction exposure is, as far as possible, concentrated\nto the countries where manufacturing entities are located. This\nis achieved by invoicing the sales entities in their respective func-\ntional currency.\nIn accordance with the Group Treasury Policy the transaction\nexposure should not be hedged.","translation exposure - balance sheet":"Translation exposure arises when the net assets are translated\ninto EUR upon consolidation. Translation differences from net\nassets in other currencies than EUR reported in other compre-\nhensive income during 2021 were 503.5 MEUR (-468.5).","net exposure per currency":"Hedging rate\nUSD GBP CAD CNY AUD BRL CHF Other Total","translation exposure - income statement":"The consolidated operating income and expense is mainly gener-\nated in subsidiaries outside the Euro-area. Changes in exchange\nrates therefore have a significant impact on the Group's earnings\nwhen the income statements are translated into EUR. Translation\nexposure related to actual and forecasted earnings is not hedged.\nNet sales per currency\nOther Total","interest rate risk":"The interest rate risk is the risk that changes in interest rates will\nadversely affect the Group's net interest expense and/or cash\nflow negatively. Interest rate exposure arises primarily from the\nexternal interest bearing debt. In accordance with the Group Trea-\nsury Policy the average interest rate duration for the external debt\nshould be in a range from 6 months to 3 years.\nDuring 2021 interest rate derivatives were used in order to manage\nthe interest rate risk.","financial income and expenses":"Interest income\nInterest expense\nOther financial income and expense\nNet","credit risk":"Credit risk is the risk that counterparts may be unable to fulfil their\npayment obligations. Financial credit risk arises when investing\ncash and cash equivalents and when trading in financial instru-\nments. To reduce the Group's financial credit risk, surplus cash\nis only invested with a limited number by the company approved\nbanks and derivative transactions are only conducted with coun-\nterparts where an ISDA netting agreement has been established.\nAs the Group is a net borrower, excess liquidity is primarily used\nto amortise external debt and therefore the average surplus cash\ninvested with banks is kept as low as possible.\nCredit risk also includes the risk that customers will not pay\nreceivables that the company has invoiced or intends to invoice.\nThrough a combination of geographical and business segmental\ndiversification of the customers the risk for significant customer\ncredit losses is reduced. An aging analysis of the receivables can\nbe found in Note 18.","liquidity risk":"Liquidity risk is the risk of not being able to meet the Group's pay-\nment obligations in full as they fall due or can only do so at mate-\nrially disadvantageous terms due to lack of cash resources. To\nminimise the liquidity risk, the Group Treasury Policy states that\ntotal liquidity reserves should at all times be at least 10 per cent of\nthe Group's forecasted annual net sales.\nOn 31 December 2021, cash and unutilised credit limits totalled","the group's maturity structure of interest bearing financial liabilities - undiscounted cash flows":"The table below presents the undiscounted cash flows of the Group's interest bearing liabilities related to financial instruments based\non the remaining period at the balance sheet to the contractual maturity date. Floating interest cash flows with future fixing dates\nare based on the actual interest rates at year-end. Any cash flow in foreign currency is translated to EUR using the exchange rate at\nyear-end. 2025 and later\nTotal Capital Interest Capital Interest Capital Interest Capital Interest Liabilities to credit institutions\n1) The Commercial Paper Programme is supported by the long-term revolving credit facilities as back-up and therefore classified as long-term\n2) Interest bearing liabilities in the Parent Company, 2,566.2 MEUR\nThere were interest rate derivatives pertaining to borrowing on 31\nDecember 2021. The agreement governing the Revolving Credit\nFacility include a financial covenant for Net debt/EBITDA to be\nfulfilled to avoid additional financing costs.\nCurrency composition pertaining to interest bearing liabilities\nEUR INR CHF USD Other Total","refinancing risk":"Refinancing risk refers to the risk that Hexagon does not have\nsufficient financing available when needed to refinance maturing\ndebt, due to existing lenders do not extend or Hexagon has difficul-\nties in procuring new lines of credit at a given point in time. Secur-\ning these requirements demands a strong financial position in the\nGroup, combined with active measures to ensure access to credit.\nIn order to ensure that appropriate financing is in place and to\ndecrease the refinancing risk, no more than 20 per cent of the\nGroup's gross debt, including unutilised credit facilities, is allowed\nto mature within the next 12 months without replacing facilities\nagreed. Following a refinancing in 2021, Hexagon's main sources of financ-\ning consist of:\n1) A multicurrency revolving credit facility (RCF) established during\nQ4 2021. The RCF amounts to 1,500 MEUR with a tenor of 5+1+1\nyears. 2) A Swedish Medium Term Note Programme (MTN) established\nduring Q2 2014. The MTN programme enables Hexagon to issue\nbonds up to a total amount of 20,000 MSEK. On 31 December\n2021, Hexagon had issued bonds of a total amount of 11,650 MSEK\n3) A Swedish Commercial Paper Program (CP) established during\n2012. The CP programme enables Hexagon to issue commercial\npaper up to a total amount of 15,000 MSEK. Commercial paper\nwith tenor up to 12 months can be issued under the programme.\nOn 31 December 2021, Hexagon had issued commercial paper of a\nMEUR multicurrency revolving facility support the commercial\npaper programme.\nDuring Q2 2016 Hexagon issued a private placement bond to SEK\n(Swedish Export Agency) of 1,500 MSEK with a tenor of 6 years.\nA two-year term loan of 250 MEUR was established during Q4\n2020, of which 250 MEUR was utilised as per 31 December 2021.\nA two-year term loan of 150 MEUR was established during Q3 2021,\nof which 150 MEUR was utilised as per 31 December 2021.\nA term loan of 200 MEUR with a tenor of 2+1+1 years was estab-\nlished during Q3 2021, of which 200 MEUR was utilised as per 31\nDecember 2021.","group's capital structure":"Interest bearing liabilities and provisions\nCash, bank and short-term investments\nNet debt\nShareholders' equity","sensitivity analysis":"The Group's earnings are affected by changes in certain key\nfactors, as described below. The calculations proceed from the\nconditions prevailing in 2021 and the effects are expressed on an\nannualised basis. Earnings in non-EUR subsidiaries are converted\ninto EUR based on average exchange rates for the period when the\nearnings arise.\nDuring the year there have been significant changes to the exchange\nrates of currencies that have the biggest impact on Hexagon's earn-\nings and net assets, namely CHF, CNY and USD. Compared to last\nyear the EUR has strenghtened against CHF and USD and weakened\nagainst CNY. Since Hexagon has a majority of the operating earn-\nings denominated in CNY and USD, this had a negative impact on\noperating earnings. The weakening of the CHF had a positive impact\nsince a considerable part of the costs are denominated in CHF. An\nisolated strengthening in the exchange rate for EUR by 5 per cent for\nall assets and liabilities denominated in non-EUR currencies would\nhave had an immaterial effect on net income but a negative effect\non equity of 441.8 MEUR (281.5) net, and vice versa, after the impact\nof hedging.\nDuring 2021, total operating earnings, excluding non-recurring items,\nfrom operations in other currencies than EUR amounted to an equiv-\nalent of 975.1 MEUR (808.2). An isolated change in the exchange rate\nfor EUR by 5 per cent against all other currencies would have a net\neffect on operating earnings of approximately 48.8 MEUR (40.4).\nThe average interest fixing period in the Group's total loan portfolio\nas of year-end 2021 was less than one year. A simultaneous 1 per-\ncentage point change in interest rates in all of Hexagon's funding\ncurrencies would entail a pre-tax impact of about 16.6 MEUR (11.1) in\nthe coming 12 months earnings."},"financial instruments":{"data":"Financial instruments mainly comprise customer accounts\nreceivable, loans, cash and cash equivalents and accounts\npayable.","classification":"The Group classifies financial assets in the following categories:\n- Financial assets measured at fair value (through other compre-\nhensive income or profit or loss)\n- Financial assets measured at amortised cost\nClassification depends on the Group's business model and on the\ncontractual cash flows the Group will obtain from the financial\nGains and losses from assets measured at fair value will be rec-\nognised either through comprehensive income or through profit\nor loss. For debt instruments, this depends on the Group's busi-\nness model. For equity instruments not available for sale, rec-\nognition depends on if the Group initially has chosen to measure\nthe equity instrument at fair value through other comprehensive\nincome. Reclassification does only occur if the business model is\nchanged.","measurement":"Financial assets are initially measured at fair value plus, if finan-\ncial assets not measured at fair value through profit or loss,\ntransaction costs directly attributable to the acquisition of the\nfinancial assets. Transaction cost for financial assets measured\nat fair value through profit or loss is recognised in the income\nstatement. Purchases and sales of financial assets are rec-\nognised on settlement date.\nSubsequent measurement of debt instruments depends on the\nGroup's business model and the cash flows generated by the\nfinancial asset. Financial instruments are classified in three dif-\nferent measurement categories:\n- Amortised cost: assets held for obtaining contractual cash flows\nand those cash flows consist of compensation for capital and\ninterest, are measured at amortised cost. Gains or losses when\ndebt instruments are derecognised or impaired are recognised\nin profit or loss. Interest income is classified as financial income\naccording to the effective rate method.\n- Fair value through other comprehensive income: assets held for\nobtaining contractual cash flows and for sale and where the con-\ntractual cash flows exclusively are compensation for capital and\ninterest on outstanding capital is measured at fair value through\nother comprehensive income. Changes in recognised value is\nrecognised in other comprehensive income except from impair-\nments, interest income and currency effects recognised in profit\nor loss. When the financial asset is derecognised the accumulated\nprofit or loss is reclassified from other comprehensive income in\nequity to the income statement. Interest income is recognised as\nfinancial income according to the effective rate method. Currency\neffects are recognised as other operating income or other oper-\nating cost and any impairment is recognised as other operating\ncost. - Fair value through profit or loss: assets that do not meet the criteria\nfor being measured at amortised cost or fair value through other\ncomprehensive income is measured at fair value through profit or\nloss. Assets measured at fair value through profit or loss consist of\nother long-term security holdings. Financial liabilities at fair value\nthrough profit or loss include financial liabilities held for trading and\nfinancial liabilities designated upon initial recognition as at fair value\nthrough profit or loss. Financial instruments held for trading consist\nof short term and long-term swap contracts. Gain or loss from a debt\ninstrument measured at fair value through profit or loss is recognised\nin the income statement at net value, together with other profits and\nlosses in the period they arise.\nDerivatives are initially measured at fair value at the day of enter-\ning the contract and are subsequently measured at fair value at\nthe end of every reporting period.","impairment":"The Group estimates on a forward-looking basis expected loss from\ndebt instruments measured at amortised cost and fair value through\nother comprehensive income. The applied methodology for impair-\nment depends on if there is a significant increase in credit risk.\nFor customer receivables, the Group applies the simplified meth-\nodology according to IFRS 9, which requires an initial provision for\nexpected losses.","financial instruments - fair value":"Carrying amount Fair value Carrying amount Fair value Assets measured at fair\nvalue through profit or loss\nOther long-term\nAssets measured at\namortised cost\nAccrued interest\nShort-term investments\nCarrying amount Fair value Carrying amount Fair value Financial liabilities\nmeasured at fair value\nthrough profit or loss\nEstimated supplementary\npayments for acquired\nCurrency forward and swap\nCurrency forward and swap\nFinancial liabilities\nmeasured at\namortised cost Long-term liabilities\nOther long-term liabilities\nCurrent liabilities\n- interest bearing1\nOther current non-interest\nAccrued interest\nTotal 1) Commercial papers and bonds have with currency forward and swap contract\nbeing swapped from SEK to EUR. The fair value of the derivatives is in the bal-\nance sheet included in current and long-term interest bearing liabilities","financial instruments valued at fair value":"Level 1 Level 2 Level 3 Level 1 Level 2 Level 3 - Currency for-\nward and swap\n- Estimated supplementary payments for acquired\n- Other long-\nterm securities\nThe Group uses the following hierarchy for determining and disclos-\ning the fair value of financial instruments by valuation technique:\nLevel 1: Quoted (unadjusted) prices in active markets for identical\nassets or liabilities\nLevel 2: Other techniques for which all inputs which have a sig-\nnificant effect on the recorded fair value are observable, either\ndirectly or indirectly.\nLevel 3: Techniques which use inputs that have a significant effect on\nthe recorded fair value that are not based on observable market data.\nFor further information about estimated supplementary pay-\nments for acquired companies see below.\nDuring the reporting period ending 31 December 2021, there were\nno transfers between levels.","estimated supplementary payments for acquired companies":"Opening balance\nPresent value adjustment\nIncrease through acquisition of businesses\nAdjustment of preliminary PPA\nPayment of supplementary acquisition\nconsiderations Reversal of unutilised amounts\nTranslation difference\nClosing balance\nThe fair value of the estimated supplementary payments for acqui-\nsitions are evaluated regularly and includes management's assess-\nment of future financial performance of the acquired companies.\nEstimated supplementary payments for acquired companies have\nbeen discounted to present value using an interest rate that is\njudged to be in line with the market rate at the time of acquisition.\nAdjustments for changes in market interest rates are not made on a\nregular basis, as this effect is considered to be immaterial.\nThe valuation method is unchanged compared to the previous\nperiod. In connection with the valuation of contingent consider-\nations the assets acquired and liabilities assumed in the purchase\nprice allocation are reviewed. Any indication of impairment due\nto the revaluation of contingent considerations is considered and\nadjustments are made to off-set the impact from revaluation.","changes in liabilities arising from financing activities":"Group Parent company\nOpening balance 2020-01-01\nCash flow\nLease liabilities\nAcquisitions Translation differences\nCash flow\nLease liabilities\nAcquisitions Translation differences"},"assets pledged and contingent liabilities":"Pledged assets to credit institutions for loans,\nbank overdrafts and guarantees\nGroup Parent company\nPledged assets\nTotal Contingent liabilities\nGroup Parent company\nGuarantees in favour of\nOther contingent liabilities","net assets in acquired and divested businesses":{"data":"The fair values of assets and liabilities in businesses acquired and\ntotal cash flow from acquisitions is divided as follows:\nEAM Other Intangible fixed assets\nOther fixed assets\nCurrent receivables, inven-\nIdentifiable net assets\nNon-controlling interest in\nTotal purchase\nLess cash and cash equiv-\nalents in acquired group\ncompanies Payment of unpaid portion of\nacquisition price from prior\nCash flow from acquisitions\nGroup companies/\nDuring 2021, Hexagon acquired the following companies:\n- Mecadat, a distributor of CAD and CAM software\n- CADLM, a provider of CAE software\n- ZGTech, a provider of metrology-grade 3D scanners\n- Immersal Oy, a provider of spatial mapping and visual positioning\nsolutions - Infor's EAM business, a provider of EAM software\n- Jovix, a provider of material tracking software\nFurther information related to the acquisitions of Infor's EAM busi-\nness is presented below. The other acquisitions are individually\nassessed as immaterial from a group perspective which is why only\naggregated information is presented. The analysis of the acquired\nnet assets is preliminary and the fair value might be subject to change.\nContingent considerations are recognised to fair value (level 3 accord-\ning to definition in IFRS 13) each reporting period and based on the lat-\nest relevant forecast for the acquired company. The valuation method\nis unchanged compared to the previous period. The estimated liability\nfor contingent considerations amounted to 136.2 MEUR (131.6) as of\n31 December, whereof the fair value adjustment in 2021 amounted\nto 54.3 MEUR (69.2). In connection with the valuation of contingent\nconsiderations the assets acquired and liabilities assumed in the\npurchase price allocation are reviewed. Any indication of impairment\ndue to the revaluation of contingent considerations is considered and\nadjustments are made to off-set the impact from revaluation.","acquisitions analysis acquisition of infor's eam business":"In July 2021, Hexagon acquired Infor's global EAM business\n(enterprise asset management), a best-in-class, SaaS-based asset\nmanagement solution - Infor EAM - which is used to track assets,\ndigitalise maintenance operations and enable customers in nearly\nany industry to reach optimum operational efficiency.\nBackground and reasons for the transaction\nEAM solutions provide the foundation of digital innovation in\nasset-intensive industries where digital realities, or digital opera-\ntional twins, are increasingly leveraged to provide a single source of\ntruth and complete line-of-sight to ever-changing situations. This\nincludes the condition and performance of fixed assets - from cap-\nital and process equipment (machines, trucks, valves, turbines, and\npumps) to critical infrastructure (road, railway, pipeline and commu-\nnications networks) to entire buildings and facilities. By combining\nenterprise asset management system with Hexagon's portfolio puts\nHexagon in a unique position to drive further digital transformation\nacross the customer base. By integrating Infor EAM's built-in, indus-\ntry-specific asset management capabilities with Hexagon's digital\nreality solutions and platforms, Hexagon can improve capital asset\nperformance in ways beyond what EAM can achieve standalone.\nFrom the date of consolidation (1 October), Infor's EAM business\nhas contributed 38.1 MEUR of net sales in 2021. If the acquisition\nhad taken place at the beginning of the year, the contribution to\nnet sales would have been 150.9 MEUR. The contribution to the\ngroup operating margin has been accretive.\nAcquisitions analysis 2020","acquisition of blast movement technologies":"In January 2020, Hexagon acquired Blast Movement Technol-\nogy (BMT), a pioneer in blast movement monitoring and analysis\nsolutions for open pit mines. Through a combination of sensors\nand software, BMT's solutions provide customers with accurate\nblast information that is used to improve the recovery of a mine's\nresources. In 2019 BMT generated revenues of 19 MEUR.\nBackground and reasons for the transaction\nThe ability to accurately track blast movement is a huge benefit\nfor mines striving to be smarter and more sustainable. It's a highly\nvariable process that can cost mines millions of dollars in lost reve-\nnue per year from ore loss - where valuable ore is sent to the waste\npile, and dilution - where waste is sent to the mill. BMT comple-\nments Hexagon's Smart Mine portfolio, further closing the drill and\nblast loop for customers, and ultimately, improving their ability to\nmeasure, manage and improve mining operations from pit to plant.\nFrom the date of acquisition, BMT has contributed 20.7 MEUR of\nnet sales in 2020. The contribution to the group operating margin\nhas been accretive.","acquisition of cowi's mapping business":"In June 2020, Hexagon acquired COWI's mapping business, which\nprovides airborne surveying and spatial data processing. Revenues\nin 2019 amounted to 14 MEUR.\nBackground and reasons for the transaction\nThe acquisition brings valuable expertise in capturing and selling\nContent as a Service (CaaS) and accelerates Hexagon's mission to\nprovide customers with access to the largest on-demand library\nof professional-grade and quality controlled geospatial data for\napplications such as asset management, public safety, utility\nmapping, insurance claims, and more.\nFrom the date of acquisition, the business has contributed 8.7\nMEUR of net sales in 2020. If the acquisition had taken place at\nthe beginning of the year, the contribution to net sales would have\nbeen 12.8 MEUR. The contribution to the group operating margin\nhas been accretive.","acquisition of romax technology":"In June 2020, Hexagon acquired Romax Technology, a provider of\nCAE software for electromechanical simulation and multi-physics\ndesign optimisation. Revenues in 2019 amounted to 27 MEUR.\nBackground and reasons for the transaction\nA greater focus on energy efficiency and an accelerating shift\ntowards electrification brings new engineering challenges that\nrequire increased use of simulation tools earlier in the design\nlifecycle. The acquisition of Romax Technology enables Hexagon\nto meet the growing need for electrification, providing customers\nwith integrated tools that empower engineering teams to develop\nthe next generation of energy-efficient electric vehicles and\ndevelop renewable energy systems.\nFrom the date of acquisition, Romax Technology has contributed\n13.2 MEUR of net sales in 2020. If the acquisition had taken place\nat the beginning of the year, the contribution to net sales would\nhave been 23.6 MEUR. The contribution to the group operating\nmargin has been accretive.","acquisition of d.p. technology":"In December 2020, Hexagon acquired D.P. Technology (DPT), a pro-\nvider of CAM technology. Revenues in 2019 amounted to 35 MEUR.\nBackground and reasons for the transaction\nDPT provides high-performance CNC machine programming,\noptimisation, and simulation for a broad range of precision manu-\nfacturing applications. DPT's solutions leverage a digital twin simu-\nlation platform to model the finished part, tools and CNC machine.\nAI-based algorithms eliminate manual data input and provide\nmachine operators with greater assurance of what will happen on\nthe shop floor. The result - simplified programming, increased tool\nlife and utilisation, reduced cycle times and improved productivity.\nWhen combined with Hexagon's production software portfolio, the\nacquisition strengthens its market- leading position in CAM.\nFrom the date of acquisition, the business has contributed\n3.5 MEUR of net sales in 2020. If the acquisition had taken place at\nthe beginning of the year, the contribution to net sales would have\nbeen 35.0 MEUR. The contribution to the group operating margin\nhas been accretive.","acquisition of pas global":"In December 2020, Hexagon acquired PAS Global, a leading pro-\nvider of Operational Technology (OT) integrity solutions. Revenues\nin 2020 amounted to 28.1 MEUR.\nBackground and reasons for the transaction\nPAS' solutions help prevent, detect and remediate cyber threats,\nreduce process safety risks and enable trusted data for decision-\nmaking in asset-intensive industries like manufacturing, oil and\ngas, utilities and more. This is critical to managing the perfor-\nmance of physical devices, machines and essential processes.\nCombining PAS' OT expertise with Hexagon's PPM division's digital\ntwin and data integrity capabilities creates a powerful offering for\nindustrial lifecycle management.\nFrom the date of acquisition, the business has contributed\n0.0 MEUR of net sales in 2020. If the acquisition had taken place at\nthe beginning of the year, the contribution to net sales would have\nbeen 28.1 MEUR.","acquisition of oxblue":"In December 2020, Hexagon acquired OxBlue, a leader in con-\nstruction visualisation technology. Revenues in 2020 amounted to\nBackground and reasons for the transaction\nOxBlue's construction visualisation solution improves the man-\nagement of everything from material shipments and site visits\nto contractor schedules, progress updates and construction\nsite security, ensuring that projects stay on schedule and under\nbudget. The acquisition of OxBlue strengthens Hexagon's capa-\nbilities to serve the rapidly evolving architecture, engineering, and\nconstruction (AEC) ecosystem. By integrating OxBlue's portfolio\nwith Hexagon's 3D surveillance technology, BLK247, and its con-\nstruction software solution, HxGN SMART Build, the company will\nprovide invaluable data and insights on construction job site activ-\nities. The acquisition represents another step in Hexagon's vision\nto provide market-leading, data-centric solutions that introduce\nsmarter ways to build.\nFrom the date of acquisition, the business has contributed 2.9\nMEUR of net sales in 2020. If the acquisition had taken place at\nthe beginning of the year, the contribution to net sales would have\nbeen 36.9 MEUR. The contribution to the group operating margin\nhas been accretive."},"average number of employees":"Men Women Total Men Women Total Parent company\nAverage number\nof employees\nby country\nAustralia and New","employee benefits":"Salaries and remuneration\nParent company\n(of which performance related pay and bonus)\nSubsidiaries (of which performance related pay and bonus)\nTotal, Group\nSocial security expenses\nParent company\n(of which pension expenses)\nSubsidiaries (of which pension expenses)\nTotal, Group\n(of which pension expenses)\nAt year-end, the board consists of ten board members of which\nfour are women and six are men. The President and Chief Exec-\nutive Officer and other senior executives are 11 men and two\nwomen.","remuneration to senior executives":{"data":"Pursuant to resolutions by the Annual General Meeting, the Chair\nof the Board and Board members were paid remuneration totalling\n672.7 KEUR (603.9). The Chair of the Board received 189.7 KEUR and\nother Board members 63.6 KEUR each. The President and Chief\nExecutive Officer of Hexagon AB did not receive any director fees. In\naddition to ordinary director fees, remuneration is paid for work on\ncommittees. The Chair of the Remuneration Committee received\n8.4 KEUR and each member received 5.9 KEUR. The Chair of the\nAudit Committee received 27.1 KEUR and each member received 22.2\nKEUR. No board member received any remuneration in addition to\ndirector fees or remuneration for committee work. Remuneration to\nthe President and Chief Executive Officer, as well as the Other senior\nexecutives, comprises basic salary, variable remuneration, other\nbenefits and pension. The President and Chief Executive Officer\ntotal remuneration is recognised in Note 29 in Parent company. Ola\nRollén has received remuneration as President of the Parent Com-\npany and as Chief Executive Officer of the Group according to a sepa-\nrate employment contract with a group company.\nOther senior executives are Robert Belkic, Chief Financial Officer\nand Executive Vice President Hexagon AB, Tony Zana, General Coun-\nsel, Burkhard Böckem, Chief Technology Officer, Ben Maslen, Chief\nStrategy Officer, Maria Luthström, Head of Sustainability and IR,\nKristin Christensen, Chief Marketing Officer, Norbert Hanke, Chief\nOperating Officer, Li Hongquan, President Hexagon China, Jürgen\nDold, President Geosystems, Geospatial, Safety & Infrastructure,\nPaolo Guglielmini, President Manufacturing Intelligence, Mattias\nStenberg, President PPM and Michael Ritter, President Autonomy &\nPositioning. Variable remuneration is based on operational performance.\nPensions and other benefits received by the president and other\nsenior executives are paid as part of their total remuneration.","pension":"Pension expense comprises defined-contribution pension\nschemes and is the expense affecting earnings for the year.\nThe President's and CEO's pensionable age is 65 years. Pension\npremiums are payable at 20 per cent of pensionable salary. The\npensionable age of the Other senior executives is 65 years, except\nfor one person where the pensionable age is 60 years. Pension\npremiums for the Other senior executives are not higher than 25\nper cent of pensionable salary. Pensionable salary means basic\nsalary.","severance pay":"The notice period for the president and CEO is six months. Upon\ntermination by the Company or in case of change of principal\nowner ship the President and CEO is entitled to severance pay\nequal to 18 months of salary. The period of notice for senior exec-\nutives is a maximum of 24 months. During the notice period, basic\nsalary is the only severance pay.","advisory and resolution model":"Remuneration and other benefits to the Group's senior executives\nis regulated by the Remuneration Committee, which is appointed\nby the Board of Directors, comprising the Chair of the Board and\none additional Board member.","remuneration and other benefits":"Basic salary/\nDirector fees\nVariable remuneration Other benefits1 Pension expenses Total Ola Rollén, President and\n1) Other benefits comprise company car and insurance (excluding pension insurance). Expenses for Share programme amounts to 0.9 MEUR for the President\nand CEO and to 2.2 MEUR for Other senior executives\n2) Elected 17 November 2021\n3) Executive Vice President is included in Other senior executives, more detailed information on remuneration to the Executive Vice President can be found in\nthe Remuneration Report 2021","share programme":"At the Extraordinary General Meeting on 1 December 2020, it was\ndecided to implement the Share Programme 2020/2023 and at\nthe Annual General Meeting on 29 April 2021 it was decided to\nimplement the Share Programme 2021/2024 for key employees in\nthe company. Participants in the share programmes are offered to\nbe granted, free of charge, performance awards which may entitle\nto shares of Class B if performance conditions are met during the\nmeasurement periods 1 January 2020 to 31 December 2023 and\n1 January 2021 to 31 December 2024. The purpose of the share\nprogramme is to strengthen Hexagon's ability to retain and recruit\ncompetent employees, provide competitive renumeration and\nto align the interest of the shareholders with the interest of the\nemployees concerned. The total cost of the share-based incen-\ntive programmes is estimated at 60 MEUR each and is recognised\nas a personnel expense in profit or loss during the vesting period.\nAllocated performance awards in Share Programme 2020/20231\nNumber of\nawards1 Market value,\nEUR President and Chief Executive Officer\nOther senior executives (12 people)\nOther employees\n1) Relates to allocated performance awards, restated after share split 7:1, which\nmay entitle to shares of Class B to be received during year 2024 if the perfor-\nmance conditions are met\nAllocated performance awards in Share Programme 2021/20241\nNumber of\nawards1 Market value,\nEUR President and Chief Executive Officer\nOther senior executives (12 people)\nOther employees\n1) Relates to allocated performance awards which may entitle to shares of Class\nB to be received during year 2025 if the performance conditions are met"},"remuneration of the group's auditors":"Group Parent company\nAudit assignment, PwC(EY)\nAdditional audit assign-\nments, PwC\n(EY) Tax assignments, PwC (EY)\nTotal, PwC (EY)\nOther auditors assignment\nTotal 1) Whereof 1.3 MEUR to PwC Sweden\n2)Whereof 0.03 MEUR to PwC Sverige\n3) Whereof 0.0 MEUR to PwC Sverige. Tax assignments mainly relates to tax\nreturn compliance, transfer pricing and questions relating to tax\nlegislation and compliance","related-party disclosures":"Remuneration of senior executives, meaning both the Board of\nDirectors and management, is presented in Note 30. The Group's\nholdings in associated companies and receivables from and liabili-\nties to associated companies are immaterial. There were no signifi-\ncant transactions between Hexagon and its associated companies.\nSimilarly, there were no significant transactions between Hexagon\nGroup and Schörling Group.","subsequent events after the financial year's end":"On February 25 2022, Hexagon announced the acquisition of ETQ,\na leading provider of SaaS-based QMS (quality management sys-\ntem), EHS (environment, health and safety) and compliance man-\nagement software.","appropriation of earnings":"The following earnings in the Parent Company are at\nthe disposal of the annual general meeting (KEUR):\nPremium reserve\nRetained earnings\nNet earnings\nThe board of the directors proposes that\nthese funds are allocated as follows:\nCash dividend to shareholders of 0.11 EUR per share\nBalance remaining in the premium reserve\nBalance remaining in retained earnings"},"signing of the annual report":"The undersigned certify that the consolidated accounts and the\nannual report have been prepared in accordance with Interna-\ntional Financial Reporting Standards (IFRS), as adopted by the\nEuropean Union and generally accepted accounting principles,\nrespectively and give a true and fair view of the financial position\nand earnings of the Group and the Company and that the Board of\nDirectors' Report for the Group and the Company give a fair review\nof the development of the operations, financial position and earn-\nings of the Group and the Company and describes substantial\nrisks and uncertainties that the Group companies face.\nStockholm, Sweden 29 March 2022\nGun Nilsson\nChair of the Board\nJohn Brandon\nMember of the Board\nUlrika Francke\nMember of the Board\nHenrik Henriksson\nMember of the Board\nErik Huggers\nMember of the Board\nOla Rollén\nMember of the Board\nPresident and CEO\nMärta Schörling Andreen\nMember of the Board\nSofia Schörling Högberg\nMember of the Board\nPatrick Söderlund\nMember of the Board\nBrett Watson\nMember of the Board\nOur Audit Report was submitted on 30 March 2022\nPricewaterhouseCoopers AB\nBo Karlsson\nAuthorised Public Accountant\nPartner in charge\nHelena Kaiser de Carolis\nAuthorised Public Accountant","auditor's report":{"data":"To the general meeting of the shareholders of Hexagon AB (publ),\ncorporate identity number 556190-4771.","report on the annual accounts and consolidated accounts opinions":"We have audited the annual accounts and consolidated accounts\nof Hexagon AB (publ) for the year 2021. The annual accounts and\nconsolidated accounts of the company are included on pages\n14-20, 34-74 in this document.\nIn our opinion, the annual accounts have been prepared in accor-\ndance with the Annual Accounts Act and present fairly, in all mate-\nrial respects, the financial position of parent company and the\ngroup as of 31 December 2021 and its financial performance and\ncash flow for the year then ended in accordance with the Annual\nAccounts Act. The consolidated accounts have been prepared in\naccordance with the Annual Accounts Act and present fairly, in all\nmaterial respects, the financial position of the group as of 31\nDecember 2021 and their financial performance and cash flow for\nthe year then ended in accordance with International Financial\nReporting Standards (IFRS), as adopted by the EU, and the Annual\nAccounts Act. The statutory administration report is consistent\nwith the other parts of the annual accounts and consolidated\naccounts. We therefore recommend that the general meeting of sharehold-\ners adopts the income statement and balance sheet for the par-\nent company and the group.\nOur opinions in this report on the annual accounts and consoli-\ndated accounts are consistent with the content of the additional\nreport that has been submitted to the parent company's audit\ncommittee in accordance with the Audit Regulation (537/2014)\nArticle 11.","basis of opinions":"We conducted our audit in accordance with International Stan-\ndards on Auditing (ISA) and generally accepted auditing standards\nin Sweden. Our responsibilities under those standards are fur-\nther described in the Auditor's Responsibilities section. We are\nindependent of the parent company and the group in accordance\nwith professional ethics for accountants in Sweden and have\notherwise fulfilled our ethical responsibilities in accordance with\nthese requirements. This includes that, based on the best of our\nknowledge and belief, no prohibited services referred to in the\nAudit Regulation (537/2014) Article 5.1 have been provided to the\naudited company or, where applicable, its parent company or its\ncontrolled companies within the EU.\nWe believe that the audit evidence we have obtained is sufficient\nand appropriate to provide a basis for our opinions.","other matter":"The audit of the annual accounts and consolidated accounts for\nyear 2021 was performed by another auditor who submitted an\nauditor´s report dated 1 April 2021, with unmodified opinions in the\nReport on the annual accounts and consolidated accounts.","our audit approach":"Audit scope\nWe designed our audit by determining materiality and assessing\nthe risks of material misstatement in the consolidated financial\nstatements. In particular, we considered where management\nmade subjective judgements; for example, in respect of signifi-\ncant accounting estimates that involved making assumptions and\nconsidering future events that are inherently uncertain. As in all\nof our audits, we also addressed the risk of management override\nof internal controls, including among other matters consideration\nof whether there was evidence of bias that represented a risk of\nmaterial misstatement due to fraud.\nWe tailored the scope of our audit in order to perform sufficient\nwork to enable us to provide an opinion on the consolidated finan-\ncial statements as a whole, taking into account the structure of\nthe Group, the accounting processes and controls, and the indus-\ntry in which the group operates.\nThe Hexagon Group comprises a large number of subsidiaries.\nNone of these subsidiaries have, individually, been deemed to be\nsignificant for the audit of the Group. For the Group audit, we have\nselected the Parent company and a large number of entities allo-\ncated across the Group's five business areas for Group reporting.\nThe majority of the subsidiaries in the Group are also subject to\nstatutory audits according to local requirements.\nFor other reporting units, analytical audit procedures are per-\nformed as a part of the audit of the consolidation. The Group\naudit team has performed site visits in a selected number of legal\nentities as well as performed work on the finance and accounting\nconsolidation processes, treasury operations among others.\nMateriality The scope of our audit was influenced by our application of\nmateriality. An audit is designed to obtain reasonable assurance\nwhether the financial statements are free from material misstate-\nment. Misstatements may arise due to fraud or error. They are\nconsidered material if individually or in aggregate, they could rea-\nsonably be expected to influence the economic decisions of users\ntaken on the basis of the consolidated financial statements.\nBased on our professional judgement, we determined certain\nquantitative thresholds for materiality, including the overall group\nmateriality for the consolidated financial statements as a whole\nas set out in the table below. These, together with qualitative con-\nsiderations, helped us to determine the scope of our audit and the\nnature, timing and extent of our audit procedures and to evaluate\nthe effect of misstatements, both individually and in aggregate on\nthe financial statements as a whole.","key audit matter":"Key audit matters of the audit are those matters that, in our pro-\nfessional judgment, were of most significance in our audit of the\nannual accounts and consolidated accounts of the current period.\nThese matters were addressed in the context of our audit of, and\nin forming our opinion thereon, the annual accounts and consoli-\ndated accounts as a whole, but we do not provide a separate opin-\nion on these matters.","revenue recognition":"Key audit matter\nHexagon customer offerings contains solutions in which hardware\nand software are integrated as well as services and licenses. The\ncritical management estimates of customer contracts include\nestablishing the amounts that are to be recognised as income and\nwhen the income should be recognised.\nFor integrated customer contracts management need to assess\nif revenue should be allocated to each revenue type as different\naccounting principles apply for these revenue types. Manage-\nment makes estimates of completed performance in relation to\nthe contractual terms and conditions as as these performance\nobligations are or can be fulfilled at different points in time.\nPart of Hexagons business comes from major long term, com-\nplex and fixed-price customer contracts. Management makes\nestimates of completed performance in relation to the contrac-\ntual terms as a base for recognizing revenue on every reporting\ndate, these estimations are also the base for any potential loss\nprovision. Due to the degree of management judgment in arrangements con-\ntaining multiple performance obligations, these types of arrange-\nments have been a key audit matter in our audit.\nAccounting principles for revenue recognition are included in Note\n5 and key estimates and assumptions used for customer arrange-\nments are included in Note 2.\nHow our audit address the key audit matter\nOur audit included, amongst others a combination of testing of\ninternal controls over financial reporting including procedures\nto test key application configurations, analytical procedures\nincluding analysing complete transactional data sets with soft-\nware tools to identify large transactions, anomalies, unexpected\ntrends or variation. We have, in order to validate revenue for exis-\ntence and accuracy performed detailed tests of new major con-\ntracts in the Hexagon subsidiaries. We have also assessed that\ndisclosures are appropriate.","business combinations":"Key audit matter\nAcquisition of new businesses and the consolidation of new busi-\nnesses (business combinations) include purchase price alloca-\ntions of the fair values of acquired assets and liabilities including\nidentification of goodwill and other intangible assets. The valu-\nation is partly based on management assumptions of the future\nearnings of the acquired business and valuation of intangible\nassets at fair value.\nThe acquisitions contracts includes contingent earn-out pay-\nments which are included in the acquisition cost as a contingent\nconsideration and remeasured at every reporting date and thus\nsubject to management estimates and assumptions.\nBusiness combinations have been a key audit matter in our audit\ndue to the degree of management judgment in identifying and\naccounting of various acquired intangible assets.\nAccounting principles for business combinations are included in\nNote 1 and key estimates and assumptions used for fair values of\nacquires assets and assumed liabilities as well as identification\nof intangible assets and contingent consideration are included in\nNote 2. How our audit address the key audit matter\nOur audit procedures included, amongst others assessment\nof significant purchase agreements, test of the purchase price\nallocations including calculation and accounting for contingent\nconsiderations. We have involved our valuation specialists to\nchallenge the valuation and calculation methods used by manage-\nment. We have also assessed that disclosures are appropriate.","goodwill and other intangible assets with indefinite useful lives":"Key audit matter\nThe carrying value of goodwill, and other intangible assets with\nindefinite useful lives represent some 65 percent of reported total\nassets. IFRS require annual impairment tests or when there is an\nindication that values could be impaired.given that the carrying\nvalue of these assets are not amortised.\nMarket data, Hexagon's business plans and forecasts on future\ndevelopment forms the expectations on sales, earnings and cash\nflows that are central in the model to calculate a recoverable value\nto be compared to the booked carrying value.\nWe have focused on the valuation of goodwill and intangible\nassets with indefinite useful lives as these items involve a large\ndegree of judgement on behalf of management in assessing\nfuture cash flows.\nThe key assumptions used and management's sensitivity analysis\nfor how changes in key assumptions would affect the value in use\nare presented in Note 8. As stated in Note 2 the impairment test\nrequire management estimates and assumptions such as pro-\njected cash flows, future market conditions and discount rates.\nHow our audit address the key audit matter\nOur audit procedures included amongst others a review of man-\nagement impairment tests of goodwill and intangible assets with\nindefinite lives. We have examined whether Hexagon's impairment\ntest is based on the divisions' (cash generating units) financial\nforecasts approved by management. We also evaluated the sen-\nsitivity analysis for changes in significant parameters, which, indi-\nvidually or on a collective basis, could imply the existence of an\nimpairment requirement. Valuation experts have been involved to\nchallenge the assumptions and estimates made by management.\nWe have also assessed that disclosures are appropriate.","other information than the annual accounts and consolidated accounts":"This document also contains other information than the annual\naccounts and consolidated accounts and is found on pages 1-13,\n21-33, 79-85. The Board of Directors and the Managing Director\nare responsible for this other information.\nOur opinion on the annual accounts and consolidated accounts\ndoes not cover this other information and we do not express any\nform of assurance conclusion regarding this other information.\nIn connection with our audit of the annual accounts and consol-\nidated accounts, our responsibility is to read the information\nidentified above and consider whether the information is mate-\nrially inconsistent with the annual accounts and consolidated\naccounts. In this procedure we also take into account our knowl-\nedge otherwise obtained in the audit and assess whether the\ninformation otherwise appears to be materially misstated.\nIf we, based on the work performed concerning this information,\nconclude that there is a material misstatement of this other infor-\nmation, we are required to report that fact. We have nothing to\nreport in this regard.","responsibilities of the board of director's and the managing director":"The Board of Directors and the Managing Director are responsi-\nble for the preparation of the annual accounts and consolidated\naccounts and that they give a fair presentation in accordance\nwith the Annual Accounts Act and, concerning the consolidated\naccounts, in accordance with IFRS as adopted by the EU. The Board\nof Directors and the Managing Director are also responsible for\nsuch internal control as they determine is necessary to enable the\npreparation of annual accounts and consolidated accounts that are\nfree from material misstatement, whether due to fraud or error.\nIn preparing the annual accounts and consolidated accounts, The\nBoard of Directors and the Managing Director are responsible\nfor the assessment of the company's and the group's ability to\ncontinue as a going concern. They disclose, as applicable, matters\nrelated to going concern and using the going concern basis of\naccounting. The going concern basis of accounting is however not\napplied if the Board of Directors and the Managing Director intend\nto liquidate the company, to cease operations, or has no realistic\nalternative but to do so.\nThe Audit Committee shall, without prejudice to the Board of\nDirector's responsibilities and tasks in general, among other\nthings oversee the company's financial reporting process.","auditor's responsibility":"Our objectives are to obtain reasonable assurance about whether\nthe annual accounts and consolidated accounts as a whole are\nfree from material misstatement, whether due to fraud or error,\nand to issue an auditor's report that includes our opinions. Rea-\nsonable assurance is a high level of assurance, but is not a guaran-\ntee that an audit conducted in accordance with ISAs and generally\naccepted auditing standards in Sweden will always detect a mate-\nrial misstatement when it exists. Misstatements can arise from\nfraud or error and are considered material if, individually or in the\naggregate, they could reasonably be expected to influence the\neconomic decisions of users taken on the basis of these annual\naccounts and consolidated accounts.\nA further description of our responsibility for the audit of the\nannual accounts and consolidated accounts is available on Revi-\nsorsinspektionen's website: www.revisorsinspektionen.se/revi-\nsornsansvar. This description is part of the auditor's report.","report on other legal and regulatory requirements opinions":"In addition to our audit of the annual accounts and consolidated\naccounts, we have also audited the administration of the Board of\nDirector's and the Managing Director of Hexagon AB (publ) for the\nyear 2021 and the proposed appropriations of the company's\nprofit or loss.\nWe recommend to the general meeting of shareholders that\nthe profit be appropriated in accordance with the proposal in the\nstatutory administration report and that the members of the\nBoard of Director's and the Managing Director be discharged from\nliability for the financial year.","basis for opinions":"We conducted the audit in accordance with generally accepted\nauditing standards in Sweden. Our responsibilities under those\nstandards are further described in the Auditor's Responsibilities\nsection. We are independent of the parent company and the group\nin accordance with professional ethics for accountants in Sweden\nand have otherwise fulfilled our ethical responsibilities in\naccordance with these requirements.\nWe believe that the audit evidence we have obtained is sufficient\nand appropriate to provide a basis for our opinions.","responsibilities of the board of director's and the managing director (1)":"The Board of Directors is responsible for the proposal for\nappropriations of the company's profit or loss. At the proposal of\na dividend, this includes an assessment of whether the dividend is\njustifiable considering the requirements which the company's and\nthe group's type of operations, size and risks place on the size of\nthe parent company's and the group' equity, consolidation\nrequirements, liquidity and position in general.\nThe Board of Directors is responsible for the company's organiza-\ntion and the administration of the company's affairs. This includes\namong other things continuous assessment of the company's and\nthe group's financial situation and ensuring that the company's orga-\nnization is designed so that the accounting, management of assets\nand the company's financial affairs otherwise are controlled in a\nreassuring manner. The Managing Director shall manage the ongoing\nadministration according to the Board of Directors' guidelines and\ninstructions and among other matters take measures that are nec-\nessary to fulfill the company's accounting in accordance with law and\nhandle the management of assets in a reassuring manner.","auditor's responsibility (1)":"Our objective concerning the audit of the administration, and\nthereby our opinion about discharge from liability, is to obtain\naudit evidence to assess with a reasonable degree of assurance\nwhether any member of the Board of Directors or the Managing\nDirector in any material respect:\n- has undertaken any action or been guilty of any omission which\ncan give rise to liability to the company, or\n- in any other way has acted in contravention of the Companies\nAct, the Annual Accounts Act or the Articles of Association\nOur objective concerning the audit of the proposed appropri-\nations of the company's profit or loss, and thereby our opinion\nabout this, is to assess with reasonable degree of assurance\nwhether the proposal is in accordance with the Companies Act.\nReasonable assurance is a high level of assurance, but is not a\nguarantee that an audit conducted in accordance with generally\naccepted auditing standards in Sweden will always detect actions\nor omissions that can give rise to liability to the company, or that\nthe proposed appropriations of the company's profit or loss are\nnot in accordance with the Companies Act.\nA further description of our responsibility for the audit of the\nadministration is available on Revisorsinspektionen's website:\nwww.revisorsinspektionen.se/revisornsansvar. This description is\npart of the auditor's report.","the auditor's examination of the esef report opinion":"In addition to our audit of the annual accounts and consolidated\naccounts, we have also examined that the Board of Directors and\nthe Managing Director have prepared the annual accounts and\nconsolidated accounts in a format that enables uniform elec-\ntronic reporting (the ESEF report) pursuant to Chapter 16, Section\n4(a) of the Swedish Securities Market Act (2007:528) for Hexagon\nAB (publ) for the financial year 2021.\nOur examination and our opinion relate only to the statutory\nrequirements. In our opinion, the ESEF report #[checksum] has been prepared in\na format that, in all material respects, enables uniform electronic\nreporting.","basis for opinions (1)":"We have performed the examination in accordance with FAR's\nrecommendation RevR 18 Examination of the ESEF report. Our\nresponsibility under this recommendation is described in more\ndetail in the Auditors' responsibility section. We are independent\nof Hexagon AB (publ) in accordance with professional ethics for\naccountants in Sweden and have otherwise fulfilled our ethical\nresponsibilities in accordance with these requirements.\nWe believe that the evidence we have obtained is sufficient and\nappropriate to provide a basis for our opinion.","responsibilities of the board of director's and the managing director (2)":"The Board of Directors and the Managing Director are responsible\nfor ensuring that the ESEF report has been prepared in accor-\ndance with the Chapter 16, Section 4(a) of the Swedish Securities\nMarket Act (2007:528), and for such internal control that the Board\nof Directors and the Managing Director determine is necessary\nto prepare the ESEF report without material misstatements,\nwhether due to fraud or error.","auditor's responsibility (2)":"Our responsibility is to form an opinion with reasonable assurance\nwhether the ESEF report is in all material respects prepared in\na format that meets the requirements of Chapter 16, Section 4(a)\nof the Swedish Securities Market Act (2007:528), based on the\nprocedures performed.\nRevR 18 requires us to plan and execute procedures to achieve\nreasonable assurance that the ESEF report is prepared in a format\nthat meets these requirements.\nReasonable assurance is a high level of assurance, but it is not a\nguarantee that an engagement carried out according to RevR 18\nand generally accepted auditing standards in Sweden will always\ndetect a material misstatement when it exists. Misstatements\ncan arise from fraud or error and are considered material if,\nindividually or in aggregate, they could reasonably be expected to\ninfluence the economic decisions of users taken on the basis of\nthe ESEF report.\nThe audit firm applies ISQC 1 Quality Control for Firms that Per-\nform Audits and Reviews of Financial Statements, and other\nAssurance and Related Services Engagements and accordingly\nmaintains a comprehensive system of quality control, including\ndocumented policies and procedures regarding compliance with\nprofessional ethical requirements, professional standards and\nlegal and regulatory requirements.\nThe audit firm applies ISQC 1 Quality Control for Firms that Per-\nform Audits and Reviews of Financial Statements, and other\nAssurance and Related Services Engagements and accordingly\nmaintains a comprehensive system of quality control, including\ndocumented policies and procedures regarding compliance with\nprofessional ethical requirements, professional standards and\nlegal and regulatory requirements.\nThe reasonable assurance engagement involves obtaining evi-\ndence, through various procedures, that the ESEF report has\nbeen prepared in a format that enables uniform electronic report-\ning of the annual accounts. The procedures selected depend on\nthe auditor's judgment, including the assessment of the risks\nof material misstatement in the report, whether due to fraud or\nerror. In carrying out this risk assessment, and in order to design\nprocedures that are appropriate in the circumstances, the auditor\nconsiders those elements of internal control that are relevant to\nthe preparation of the ESEF report by the Board of Directors and\nthe Managing Director, but not for the purpose of expressing an\nopinion on the effectiveness of those internal controls. The rea-\nsonable assurance engagement also includes an evaluation of the\nappropriateness and reasonableness of assumptions made by\nthe Board of Directors and the Managing Director.\nThe procedures mainly include a technical validation of the ESEF\nreport, i.e. if the file containing the ESEF report meets the tech-\nnical specification set out in the Commission's Delegated Regula-\ntion (EU) 2019/815 and a reconciliation of the ESEF report with the\naudited annual accounts and consolidated accounts.\nFurthermore, the procedures also include an assessment of\nwhether the ESEF report has been marked with iXBRL which\nenables a fair and complete machine-readable version of the\nconsolidated statement of financial performance, statement of\nfinancial position, statement of changes in equity and the state-\nment of cash flow.\nPricewaterhouseCoopers AB, was appointed auditor of Hexagon\nAB (publ) by the general meeting of the shareholders on the 29 th\nApril 2021 and has been the company's auditor since 2021.\nStockholm 30 March, 2022\nPricewaterhouseCoopers AB\nBo Karlsson \nAuthorised Public Accountant\nPartner in charge\nHelena Kaiser de Carolis\nAuthorised Public Accountant "},"the share":{"share price development and trading":"In 2021, the Hexagon share price increased by 33.7 per cent\nto 143.65 SEK as of 31 December. The share price reached the\n52-week high of 151.45 SEK on 6 September and the 52-week low\non 5 March at 100.26 SEK. Hexagon's total market capitalisation as\nof 31 December 2021 was 372,804.5 MSEK.","ownership structure":"At year-end 2021, Hexagon had 50,034 registered shareholders\n(34,793). Shareholders in the USA accounted for the largest for-\neign holding, representing 31 per cent (20) of total shares followed\nby the UK, representing 6 per cent (15). The ten largest owners\nheld 55.9 per cent (55.4) of the share capital and 67.7 per cent\n(67.7) of the votes.","share capital":"At year-end 2021, Hexagon's share capital amounted to 85,761,451\nare of Class A with ten votes each and 2,595,227,888 are of Class\nB with one vote each. Each share has a quota value of 0.03 EUR.\nHexagon AB has acquired 9,350,000 of the company's own shares\nof Class B as of 31 December 2021. The purpose of the repurchase\nis to ensure Hexagon's undertakings in respect of the long-term\nincentive programmes (other than delivery of shares to partic-\nipants in the incentive programmes), including covering social\nsecurity costs.","incentive programmes":"At the Annual General Meeting on 29 April 2021, it was decided\nto implement the Share Programme 2021/2024. Participants in\nthe share programme are offered to be granted, free of charge,\nperformance awards that may entitle them to receive shares,\nprovided that the performance conditions are fulfilled. The\nperformance condition is related to the development of Hexa-\ngon's earnings per share compared with the target level set by\nthe Board during the measurement period 1 January 2021 to 31\nDecember 2024, where the last financial year during the measure-\nment period is compared with the financial year preceding the\nmeasurement period. The fulfilment of the performance-based\ncondition will be presented in the annual report for the financial\nShares allotted are acquired by a third party, in its own name,\nand transferred to the participants in accordance with the Share\nProgramme 2021/2024. The total costs for the share programme\nupon full fulfilment of the performance condition are estimated to\namount to a maximum of approximately 60 MEUR allocated over\nthe vesting period.","dividend and share split":"The dividend policy of Hexagon provides that, over the long-\nterm, dividends should comprise between 25 and 35 per cent of\nearnings per share after tax, assuming that Hexagon satisfies its\nequity ratio objective. Dividends are resolved upon by the Annual\nGeneral Meeting and payment is administered by Euroclear\nSweden. The Board of Directors proposes a dividend of 0.11 EUR (0.09) per\nshare for 2021. The proposed dividend amounts to 36 per cent of\nthe year's earnings per share after tax.\nDuring the year, a share split (7:1) was implemented, each B-share\nwas divided into seven shares. The record date for the split was 20\nShare price increase 2021\nNasdaq OMX Stockholm\nHEXA B\nReuters","hexab.st":"Bloomberg HEXAB SS\nSector Technology Segment","large cap":"Geographic distribution of\nshareholdings, % Sweden, 51 UK, 6 Other, 12","number of shareholders cash dividend per share,":"EUR 1) According to the Board of\nDirectors' proposal\nHexagon B\nOMX Stockholm_PI\nTotal number of shares\ntraded in thousands\nHexagon B\nOMX Stockholm_PI\nTotal number of shares\ntraded in thousands\nClass of shares\nNumber of shares\nNumber of votes\n% of capital\n% of votes","largest shareholders":"Owner/manager/deposit bank\nA shares\nB shares\n% of capital\n% of votes\n1) The concentration corresponds to the 20 largest shareholders presented in the list\nSource: Euroclear Sweden AB as of 30 December 2021","key data per share":"Source: Nasdaq\nSource: Nasdaq\nJan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 1) According to the Board of Directors' proposal\n2) Share split 7:1 2021, historical data has not been restated\n3) Based on the share price on 31 December and calendar year earnings","the hexagon share":"Year Transaction\nNominal value, SEK/\nEUR A shares,\nchange B shares,\nchange A shares,\nB shares,\nShare capital,\nSEK/EUR\n2005 Issue in kind of consideration shares1\n2005 Issue in kind of consideration shares1\n2009 Sale of repurchased shares, warrants exercised\n2010 Sale of repurchased shares, warrants exercised\n2011 Change of functional currency to EUR 0.22\n2012 Sale of repurchased shares, warrants exercised\n2013 Sale of repurchased shares, warrants exercised\n2021 Issue in kind of consideration shares3\n1) Issues in kind in connection with the acquisition of Leica Geosystems whereby shares in Leica Geosystems were contributed in exchange for B shares\nin Hexagon\n2) Issue in kind in connection with annual block exercise in Leica Geosystems' warrant programme whereby shares in Leica Geosystems received by\nthe programme participants based on the exercise of warrants were contributed in exchange for B shares in Hexagon\n3) Issue in kind in connection with the acquisition of Infor's EAM business","ownership structure analysts following hexagon ab":"Holding per shareholder\nNumber of\nshareholders No. of\nA shares\nNo. of\nB shares\nTotal number of\nSource: Euroclear Sweden AB as of 30 December 2021\nOrganisation Name ABG Sundal Collier\nOlof Cederholm\nBank of America\nAlexander Virgo\nBarclays Sven Merkt\nBerenberg Gal Munda\nBernstein Nicholas Green\nCarnegie Mikael Laséen\nDanske Bank\nViktor Trollsten\nDeutsche Bank\nJohannes Schaller\nDNB Joachim Gunell\nGoldman Sachs\nMohammed Moawalla\nHandelsbanken Daniel Djurberg\nJP Morgan\nStacy Pollard\nKepler Cheuvreux\nJohan Eliason\nMorgan Stanley\nAdam Wood\nNordea Agnieszka Vilela\nSEB Equities\nErik Golrang\nUBS Investment Research\nMagnus Kruber"},"quarterly income statements":"Year Research and development\nCapital gain from sale of shares in\nof which non-controlling\nEarnings include depreciation/\nEarnings per share after dilution,\nEarnings per share excl.\nAverage number of shares\nAverage number of shares\n3) Historical data has been restated after share split 7:1","10-year summary":"Income statement\nAdjusted operating earnings\n- of which non-controlling\nBalance sheet\nNon-interest bearing liabilities\nInterest bearing liabilities and\nKey ratios\nReturn on capital employed,\nShare of risk-bearing\nCash flow before changes in\nworking capital and excluding\nCash flow after changes in\nworking capital and excluding\nEarnings per share after\nCash flow per share before\nchanges in working capital\nand excluding non-recurring\nCash flow per share after\nchanges in working capital\nand excluding non-recurring\nAverage number of shares\nAverage number of shares\nNumber of shares, closing\n1) Restated - IAS 19\n2) As proposed by the Board of Directors\n3) Restated - IFRS 15\n4) IFRS 16 is applied from 2019, comparison numbers have not been restated\n5) From 2021 adjusted operating earnings (EBIT1) is excluded from amortisation of surplus values in the purchase price allocation (PPA), comparison numbers\nhave been restated\nThe share-related key financial ratios have been calculated considering all historical share issues and splits.","financial definitions":{"data":"In addition to the financial measures as required by the financial\nreporting framework based on IFRS, this report also includes\nother measures and indicators that are used to follow-up, analyse\nand manage the business. These measures also provide Hexagon\nstakeholders with useful financial information on the Group's\nposition, performance and development in a consistent way.\nBelow is a list of definitions of measures and indicators used in\nthis report.","amortisation of surplus values":"When a company is acquired, the purchase consideration is\nallocated to the identified assets and liabilities of the company.\nIntangible assets are most often allocated the substantial part f\nthe purchase consideration. The amortisation of surplus values\nis defined as the difference between the amortisation of such\nidentified intangible assets and what the amortisation would have\nbeen in the acquired company had the acquisition not taken place\nat all.","adjustments":"Adjustments consists of expenses related to the share pro-\ngramme (LTIP), amortisation of surplus values (PPA) and non-re-\ncurring items which refers to income and expenses that are not\nexpected to appear on a regular basis and impact comparability\nbetween periods.","adjusted operating earnings (ebit1)":"Operating earnings excluding adjustments. Adjustments are\nexcluded to facilitate the understanding of the Group's opera-\ntional development and to give comparable numbers between\nperiods.","adjusted operating earnings (ebitda)":"Adjusted operating earnings (EBIT1) excluding amortisation,\ndepreciation and impairment of fixed assets. The measure is pre-\nsented to give depiction of the result generated by the operating\nactivities. Adjusted operating margin\nAdjusted operating earnings (EBIT1) as a percentage of net sales\nfor the year.\nCapital employed\nTotal assets less non-interest bearing liabilities.\nCapital turnover rate\nNet sales for the year divided by average capital employed.","cash conversion":"Operating cash flow excluding interest, tax payments and non-re-\ncurring items divided by operating earnings (EBIT1).\nCash flow\nCash flow from operations before change in working capital and\nexcluding non-recurring items.","cash flow per share":"Cash flow from operations, after change in working capital,\nexcluding non-recurring items divided by average number of\nshares. Commercial paper\nAn unsecured promissory note with a fixed maturity of 1 to 365\ndays. Earnings per share\nNet earnings excluding non-controlling interests divided by aver-\nage number of shares.\nEquity ratio\nShareholders' equity including non-controlling interests as a\npercentage of total assets.\nGross margin\nGross earnings divided by operating net sales.\nInterest coverage ratio\nEarnings after financial items plus financial expenses divided by\nfinancial expenses.","investments":"Purchases less sales of tangible and intangible fixed assets,\nexcluding those included in acquisitions and divestitures of\nsubsidiaries. Net debt\nInterest bearing liabilities including pension liabilities and interest\nbearing provisions less cash and cash equivalents.","net indebtedness":"Interest bearing liabilities less interest bearing current receiv-\nables and liquid assets divided by shareholders' equity excluding\nnon-controlling interests.\nOperating net sales\nNet sales adjusted by the difference between fair value and book-\nvalue of deferred revenue regarding acquired businesses.\nOrganic growth\nNet sales compared to prior period excluding acquisitions and\ndivestments and adjusted for currency exchange movements.\nPay-out ratio\nDividend per share as a percentage of earnings per share.\nP/E ratio\nShare price divided by earnings per share.\nProfit margin before tax\nEarnings after financial items as a percentage of net sales.","return on capital employed (12-month average)":"Twelve months to end of period earnings after financial items,\nexcluding adjustments, plus financial expenses as a percentage\nof twelve months to end of period average capital employed. The\ntwelve months average capital employed is based on average\nquarterly capital employed.","return on shareholders' equity (12-month average)":"Twelve months to end of period net earnings excluding non-con-\ntrolling interests as a percentage of twelve months to end of\nperiod average shareholders' equity excluding non-controlling\ninterests last twelve months. The twelve months average equity is\nbased on quarterly average equity.","revolving credit facility":"A loan facility where the borrower may increase and reduce the\nsize of outstanding debt up to the available limit during the term\nof the loan.\nShareholders' equity per share\nShareholders' equity excluding non-controlling interests divided\nby the number of shares at year-end.\nShare price\nLast settled transaction on Nasdaq OMX Stockholm on the last\nbusiness day for the year.","term loan":"A fixed amount loan with a maturity date of more than one year\nand with a specified repayment schedule where the borrower is\nnot entitled to re-borrow any amount which it has repaid."},"business definitions":{"americas":"North America, South America and Central America\nAsia Asia (excluding Middle East), Australia and New Zealand\nCAD Computer-Aided Design, software\nfor creating technical drawings\nCAE Computer-Aided Engineering, simulation software\nCAM Computer-Aided Manufacturing, software\nfor controlling machine tools\nCMM Coordinate Measuring Machine\nEAM Enterprise Asset Management\nEHS Environment, Health and Safety\nEMEA Europe, Middle East and Africa","emerging markets":"Eastern Europe, Middle East, South America,\nAfrica and Asia excluding Australia, New Zealand, Japan and Korea\nESG Environmental, Social and Governance\nGDPR General Data Protection Regulation\nGES Hexagon's operating segment Geospatial Enterprise\nSolutions IES Hexagon's operating segment Industrial Enterprise Solutions\nISDA International Swaps and Derivatives Association","laser tracker":"A portable measurement system that uses a laser\nNAFTA North American Free Trade Agreement\nOECD Organisation of Economic Cooperation and Development\nR&D\nResearch and development\nUAV Unmanned Aerial Vehicle\nQMS Quality Management System"},"currency codes":"AUD Australian Dollar\nBRL Brazilian Real\nCAD Canadian Dollar\nCHF Swiss Franc\nCNY Chinese Yuan\nEUR Euro GBP British Pound\nINR Indian Rupee\nJPY Japanese Yen\nSEK Swedish Kronor\nUSD US Dollar\nProduced by Hexagon in cooperation with\nSpringtime-Intellecta. Print: Åtta.45.\nPhoto: Hexagon, Shutterstock and\nAdobeStock.","information for shareholders":{"annual general meeting 2022":"The Annual General Meeting (AGM) will be held on Friday 29 April\n2022.","shareholders who wish to attend the agm by postal voting must":"- be registered in the share register maintained by Euroclear Sweden\nAB no later than Thursday 21 April 2022,\n- give notice of their intention to participate no later than Thursday\n28 April 2022, by casting their postal votes in accordance with the\ninstructions below so that the postal vote is received by Euroclear\nSweden AB no later than that day.\nPlease note that the notification to the AGM can only be made by\npostal voting.\nShareholders who have their shares nominee-registered, must give\nnotice of participation by submitting a postal vote and temporarily\nre-register the shares in the shareholder's own name. Such re-\nregistration must be enrolled in the share register kept by Euroclear\nSweden AB as of the record date Thursday 21 April 2022. Voting rights\nregistration requested by the shareholder at such time that the regis-\ntration has been completed by the nominee no later than Friday 22 April\n2022 will be taken into account in the preparation of the share register.\nA special form must be used for the postal vote. The postal voting\nform is available on the company's website hexagon.com. Completed\nand signed postal voting forms can be sent by mail to Hexagon AB, c/o\nEuroclear Sweden, P.O. Box 191, SE-101 23 Stockholm, Sweden, or by\ne-mail to GeneralMeetingService@euroclear.com. Further instruc-\ntions and conditions can be found in the postal voting form.\nFor questions regarding the postal voting form, please contact","dividend":"The Board of Directors proposes that a dividend of 0.11 EUR per share\nbe declared for the financial year 2021.\nAs record day for right to receive dividend, the Board of Directors\nproposes Tuesday 3 May 2022. If the Annual General Meeting resolves\nin accordance with the proposal, the dividend is expected to be paid\nthrough Euroclear Sweden AB starting on Tuesday 10 May 2022.\nPayment is made in EUR, provided that EUR can be received on the\nshareholder's yield account; if not, payment will be distributed in SEK,\nwhereby currency exchange is made in accordance with Euroclear\nSweden AB's applicable procedures.\nFinancial information 2022\nHexagon will issue financial information concerning the business year\n2022 on the following dates:\nQ1 Interim Report 29 April 2022\nQ2 Interim Report 27 July 2022\nQ3 Interim Report 27 October 2022\nYear-End Report 1 February 2023","distribution policy":"The Hexagon Annual Report is distributed digitally. The annual report\ncan be downloaded at the website hexagon.com where Hexagon's\nAnnual Reports from 1997 and onwards are available. For a printed\ncopy please contact Hexagon AB.","address":"Hexagon AB\nSE-103 59 Stockholm, Sweden","visiting address":"Lilla Bantorget 15, Stockholm\nE-mail: info@hexagon.com\nWebsite: hexagon.com<br\\>10oFor po men or man"}}}}